Table of Contents
 Enum VisualStyleOperation
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiVisualStyleOperations::Operation")]
public enum VisualStyleOperation
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Disable = 2
Enable = 3
Inherit = 0
InvalidOperation = -1
Set = 1