Table of Contents
 Class CustomObjectSnapMode
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public sealed class CustomObjectSnapMode : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
CustomObjectSnapMode
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 CustomObjectSnapMode(string, string, string, Glyph)
public CustomObjectSnapMode(string localModeString, string globalModeString, string toolTipText, Glyph glyph)
Parameters
localModeString string
globalModeString string
toolTipText string
glyph Glyph
 CustomObjectSnapMode(string, string, string, Glyph, Bitmap, string)
public CustomObjectSnapMode(string localModeString, string globalModeString, string toolTipText, Glyph glyph, Bitmap bitmap, string displayString)
Parameters
localModeString string
globalModeString string
toolTipText string
glyph Glyph
bitmap Bitmap
displayString string
Properties
 Bitmap
public Bitmap Bitmap { get; }
Property Value
Bitmap
 DisplayString
public string DisplayString { get; }
Property Value
string
 GlobalModeString
public string GlobalModeString { get; }
Property Value
string
 Glyph
public Glyph Glyph { get; }
Property Value
Glyph
 GlyphSize
public static int GlyphSize { get; }
Property Value
int
 LocalModeString
public string LocalModeString { get; }
Property Value
string
 ToolTipText
public string ToolTipText { get; }
Property Value
string
Methods
 Activate(string)
public static void Activate(string mode)
Parameters
mode string
 ApplyToEntityType(RXClass, AddObjectSnapInfo)
public void ApplyToEntityType(RXClass entity, AddObjectSnapInfo callback)
Parameters
entity RXClass
callback AddObjectSnapInfo
 Deactivate(string)
public static void Deactivate(string mode)
Parameters
mode string
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 IsActive(string)
public static bool IsActive(string mode)
Parameters
mode string
Returns
bool
 RemoveFromEntityType(RXClass)
public void RemoveFromEntityType(RXClass entity)
Parameters
entity RXClass