Table of Contents
 Enum Variable.SecondaryTypeInfo
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public enum Variable.SecondaryTypeInfo
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Angle = 5
Area = 3
Boolean = 1
Distance = 4
Last = 6
None = 0
SymbolName = 2
UnitlessReal = 6