Table of Contents
 Enum CellProperties
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcDb::CellProperty")]
public enum CellProperties
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Alignment = 16
AutoScale = 256
BackgroundColor = 512
ContentColor = 32
ContentLayout = 16384
DataFormat = 2
DataType = 1
FlowDirBtoT = 65536
Invalid = 0
MarginBottom = 8192
MarginHorzSpacing = 131072
MarginLeft = 1024
MarginRight = 4096
MarginTop = 2048
MarginVertSpacing = 262144
MergeAll = 32768
Rotation = 4
Scale = 8
TextHeight = 128
TextStyle = 64