Table of Contents
 Enum VSEdgeModifiers
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcGiVisualStyleProperties::EdgeModifiers")]
public enum VSEdgeModifiers
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AlwaysOnTopFlag = 64
EdgeColorFlag = 8
EdgeHaloGapFlag = 16
EdgeJitterFlag = 2
EdgeOpacityFlag = 128
EdgeOverhangFlag = 1
EdgeWidthFlag = 4
None = 0