Table of Contents
 Enum GradientType
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiGradientFill::HatchGradientType")]
[Flags]
public enum GradientType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Curved = Cylinder | Hemispherical
Cylinder = 1
Hemispherical = 4
InvCurved = 8
InvCylinder = 2
InvHemispherical = Cylinder | InvSpherical
InvSpherical = InvCylinder | Hemispherical
Linear = 0
Spherical = Cylinder | InvCylinder