Table of Contents
 Class LenientResourceManager
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public sealed class LenientResourceManager : ResourceManager
Inheritance
object
ResourceManager
LenientResourceManager
Inherited Members
 ResourceManager.MagicNumber
 ResourceManager.HeaderVersionNumber
 ResourceManager.ReleaseAllResources()
 ResourceManager.CreateFileBasedResourceManager(string, string, Type)
 ResourceManager.GetResourceSet(CultureInfo, bool, bool)
 ResourceManager.GetString(string)
 ResourceManager.GetString(string, CultureInfo)
 ResourceManager.GetObject(string)
 ResourceManager.GetObject(string, CultureInfo)
 ResourceManager.GetStream(string)
 ResourceManager.GetStream(string, CultureInfo)
 ResourceManager.BaseName
 ResourceManager.IgnoreCase
 ResourceManager.ResourceSetType
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 LenientResourceManager(Type)
public LenientResourceManager(Type t)
Parameters
t Type
Methods
 InternalGetResourceSet(CultureInfo, bool, bool)
protected override sealed ResourceSet InternalGetResourceSet(CultureInfo culture, bool createIfNotExists, bool tryParents)
Parameters
culture CultureInfo
createIfNotExists bool
tryParents bool
Returns
ResourceSet