Table of Contents
 Class DistanceConstraint
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDistanceConstraint")]
public class DistanceConstraint : ExplicitConstraint, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
ConstraintGroupNode
GeometricalConstraint
ExplicitConstraint
DistanceConstraint
Implements
IDisposable
ICloneable
Inherited Members
 ExplicitConstraint.MeasuredValue
 ExplicitConstraint.DimDependencyId
 ExplicitConstraint.ValueDependencyId
 GeometricalConstraint.GetConnectedHelpParameterFor(ConstrainedGeometry)
 GeometricalConstraint.Deactivate()
 GeometricalConstraint.Reactivate()
 GeometricalConstraint.IsEnabled
 GeometricalConstraint.IsInternal
 GeometricalConstraint.IsImplied
 GeometricalConstraint.IsActive
 GeometricalConstraint.OwningCompositeConstraint
 GeometricalConstraint.ConnectedHelpParameters
 GeometricalConstraint.ConnectedGeometries
 ConstraintGroupNode.OwningConstraintGroupId
 ConstraintGroupNode.NodeId
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DistanceConstraint()
public DistanceConstraint()
 DistanceConstraint(Vector3d)
public DistanceConstraint(Vector3d direction)
Parameters
direction Vector3d
 DistanceConstraint(IntPtr, bool)
protected DistanceConstraint(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
 DistanceConstraint(uint, DistanceDirectionType)
public DistanceConstraint(uint consLineId, DistanceConstraint.DistanceDirectionType type)
Parameters
consLineId uint
type DistanceConstraint.DistanceDirectionType
Properties
 ConstrainedLineId
public uint ConstrainedLineId { get; }
Property Value
uint
 Direction
public Vector3d Direction { get; }
Property Value
Vector3d
 DirectionType
public DistanceConstraint.DistanceDirectionType DirectionType { get; }
Property Value
DistanceConstraint.DistanceDirectionType