Table of Contents
 Enum WebSymmetry
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiWebLightTraits::WebSymmetry")]
public enum WebSymmetry
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AxialSymmetry = 3
DoubleSymmetry = 2
NoSymmetry = 0
SingleSymmetry = 1