Table of Contents
 Class RXClass
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
[Wrapper("AcRxClass")]
public sealed class RXClass : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
RXClass
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 AppName
public string AppName { get; }
Property Value
string
 ClassVersion
public Version ClassVersion { get; }
Property Value
Version
 DxfName
public string DxfName { get; }
Property Value
string
 MyParent
public RXClass MyParent { get; }
Property Value
RXClass
 Name
public string Name { get; }
Property Value
string
 ProxyFlags
public int ProxyFlags { get; }
Property Value
int
Methods
 AddX(RXClass, RXObject)
public IntPtr AddX(RXClass runtimeClass, RXObject protocolExtension)
Parameters
runtimeClass RXClass
protocolExtension RXObject
Returns
IntPtr
 Create()
public RXObject Create()
Returns
RXObject
 DelX(RXClass)
public IntPtr DelX(RXClass runtimeClass)
Parameters
runtimeClass RXClass
Returns
IntPtr
 GetRuntimeType()
public Type GetRuntimeType()
Returns
Type
 GetX(RXClass)
public IntPtr GetX(RXClass runtimeClass)
Parameters
runtimeClass RXClass
Returns
IntPtr
 IsDerivedFrom(RXClass)
public bool IsDerivedFrom(RXClass runtimeClass)
Parameters
runtimeClass RXClass
Returns
bool
 QueryX(RXClass)
public IntPtr QueryX(RXClass runtimeClass)
Parameters
runtimeClass RXClass
Returns
IntPtr
 raise_EntityAlignment(object, EntityAlignmentEventArgs)
protected void raise_EntityAlignment(object sender, EntityAlignmentEventArgs arguments)
Parameters
sender object
arguments EntityAlignmentEventArgs
Events
 EntityAlignment
public event EntityAlignmentEventHandler EntityAlignment
Event Type
EntityAlignmentEventHandler