Table of Contents
 Struct DatabaseSummaryInfo
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDatabaseSummaryInfo")]
public struct DatabaseSummaryInfo
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Properties
 Author
public string Author { get; }
Property Value
string
 Comments
public string Comments { get; }
Property Value
string
 CustomProperties
public IDictionaryEnumerator CustomProperties { get; }
Property Value
IDictionaryEnumerator
 HyperlinkBase
public string HyperlinkBase { get; }
Property Value
string
 Keywords
public string Keywords { get; }
Property Value
string
 LastSavedBy
public string LastSavedBy { get; }
Property Value
string
 RevisionNumber
public string RevisionNumber { get; }
Property Value
string
 Subject
public string Subject { get; }
Property Value
string
 Title
public string Title { get; }
Property Value
string
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
Operators
 operator ==(DatabaseSummaryInfo, DatabaseSummaryInfo)
public static bool operator ==(DatabaseSummaryInfo a, DatabaseSummaryInfo b)
Parameters
a DatabaseSummaryInfo
b DatabaseSummaryInfo
Returns
bool
 operator !=(DatabaseSummaryInfo, DatabaseSummaryInfo)
public static bool operator !=(DatabaseSummaryInfo a, DatabaseSummaryInfo b)
Parameters
a DatabaseSummaryInfo
b DatabaseSummaryInfo
Returns
bool