Table of Contents
 Enum ProfileCurveType
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public enum ProfileCurveType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Arc = 1
LineSeg = 0