Table of Contents
 Class UInt32Collection
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeUInt32Array")]
public class UInt32Collection : IList, ICollection, IEnumerable
Inheritance
object
UInt32Collection
Implements
IList
ICollection
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 UInt32Collection()
public UInt32Collection()
 UInt32Collection(int)
public UInt32Collection(int capacity)
Parameters
capacity int
 UInt32Collection(uint[])
public UInt32Collection(uint[] values)
Parameters
values uint[]
Fields
 DefaultSize
public const int DefaultSize = 10
Field Value
int
Properties
 Capacity
public virtual int Capacity { get; set; }
Property Value
int
 Count
public virtual int Count { get; }
Property Value
int
 IsFixedSize
public virtual bool IsFixedSize { get; }
Property Value
bool
 IsReadOnly
public virtual bool IsReadOnly { get; }
Property Value
bool
 IsSynchronized
public virtual bool IsSynchronized { get; }
Property Value
bool
 this[int]
public virtual uint this[int index] { get; set; }
Parameters
index int
Property Value
uint
 SyncRoot
public virtual object SyncRoot { get; }
Property Value
object
Methods
 Add(uint)
public virtual int Add(uint value)
Parameters
value uint
Returns
int
 AddRange(uint[])
public virtual void AddRange(uint[] range)
Parameters
range uint[]
 Clear()
public virtual void Clear()
 Contains(uint)
public virtual bool Contains(uint value)
Parameters
value uint
Returns
bool
 CopyTo(uint[], int)
public virtual void CopyTo(uint[] array, int index)
Parameters
array uint[]
index int
 GetEnumerator()
public virtual UInt32CollectionEnumerator GetEnumerator()
Returns
UInt32CollectionEnumerator
 IndexOf(uint)
public virtual int IndexOf(uint value)
Parameters
value uint
Returns
int
 Insert(int, uint)
public virtual void Insert(int index, uint value)
Parameters
index int
value uint
 Remove(uint)
public virtual void Remove(uint value)
Parameters
value uint
 RemoveAt(int)
public virtual void RemoveAt(int index)
Parameters
index int
 ToArray()
public virtual uint[] ToArray()
Returns
uint[]
 TrimToSize()
public virtual void TrimToSize()