Table of Contents
 Class AssocSimplePersSubentId
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocSimplePersSubentId")]
public class AssocSimplePersSubentId : AssocPersSubentityId, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
AssocPersSubentityId
AssocSimplePersSubentId
Implements
IDisposable
ICloneable
Inherited Members
 AssocPersSubentityId.GetTransientSubentIds(Entity)
 AssocPersSubentityId.Mirror(Entity)
 AssocPersSubentityId.CreateObjectAndDwgInFields(Database, DwgFiler, ref AssocPersSubentityId)
 AssocPersSubentityId.CreateObjectAndDxfInFields(DxfFiler, ref AssocPersSubentityId)
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocSimplePersSubentId(SubentityId)
public AssocSimplePersSubentId(SubentityId SubentityId)
Parameters
SubentityId SubentityId
 AssocSimplePersSubentId(IntPtr, bool)
protected AssocSimplePersSubentId(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 IsNull
public override bool IsNull { get; }
Property Value
bool
Methods
 Audit(AuditInfo)
public override void Audit(AuditInfo auditInfo)
Parameters
auditInfo AuditInfo
 DwgInFields(DwgFiler)
public override void DwgInFields(DwgFiler filer)
Parameters
filer DwgFiler
 DwgOutFields(DwgFiler)
public override void DwgOutFields(DwgFiler filer)
Parameters
filer DwgFiler
 DxfInFields(DxfFiler)
public override void DxfInFields(DxfFiler filer)
Parameters
filer DxfFiler
 DxfOutFields(DxfFiler)
public override void DxfOutFields(DxfFiler filer)
Parameters
filer DxfFiler
 IsEqualTo(Entity, AssocPersSubentityId)
public override bool IsEqualTo(Entity entity, AssocPersSubentityId other)
Parameters
entity Entity
other AssocPersSubentityId
Returns
bool
 SubentId(Entity)
public virtual SubentityId SubentId(Entity entity)
Parameters
entity Entity
Returns
SubentityId
 SubentType(Entity)
public override SubentityType SubentType(Entity entity)
Parameters
entity Entity
Returns
SubentityType
 TransientSubentCount(Entity)
public override int TransientSubentCount(Entity entity)
Parameters
entity Entity
Returns
int