Table of Contents
 Enum ExteriorDaylightMode
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiToneOperatorParameters::ExteriorDaylightMode")]
public enum ExteriorDaylightMode
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
DaylightAuto = 2
DaylightOff = 0
DaylightOn = 1