Table of Contents
 Class NurbCurve2d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeNurbCurve2d")]
public sealed class NurbCurve2d : SplineEntity2d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity2d
Curve2d
SplineEntity2d
NurbCurve2d
Implements
IDisposable
ICloneable
Inherited Members
 SplineEntity2d.GetContinuityAtKnot(int)
 SplineEntity2d.GetContinuityAtKnot(int, Tolerance)
 SplineEntity2d.GetKnotAt(int)
 SplineEntity2d.SetKnotAt(int, double)
 SplineEntity2d.GetControlPointAt(int)
 SplineEntity2d.SetControlPointAt(int, Point2d)
 SplineEntity2d.HasFitData
 SplineEntity2d.EndPoint
 SplineEntity2d.StartPoint
 SplineEntity2d.EndParameter
 SplineEntity2d.StartParameter
 SplineEntity2d.NumControlPoints
 SplineEntity2d.Knots
 SplineEntity2d.NumKnots
 SplineEntity2d.Order
 SplineEntity2d.Degree
 SplineEntity2d.IsRational
 Curve2d.GetInterval()
 Curve2d.SetInterval(Interval)
 Curve2d.GetReverseParameterCurve()
 Curve2d.GetDistanceTo(Curve2d)
 Curve2d.GetDistanceTo(Curve2d, Tolerance)
 Curve2d.GetDistanceTo(Point2d)
 Curve2d.GetDistanceTo(Point2d, Tolerance)
 Curve2d.GetClosestPointTo(Curve2d)
 Curve2d.GetClosestPointTo(Curve2d, Tolerance)
 Curve2d.GetClosestPointTo(Point2d)
 Curve2d.GetClosestPointTo(Point2d, Tolerance)
 Curve2d.GetNormalPoint(Point2d)
 Curve2d.GetNormalPoint(Point2d, Tolerance)
 Curve2d.IsOn(double)
 Curve2d.IsOn(double, Tolerance)
 Curve2d.IsOn(Point2d, out double)
 Curve2d.IsOn(Point2d, out double, Tolerance)
 Curve2d.IsOn(Point2d)
 Curve2d.IsOn(Point2d, Tolerance)
 Curve2d.GetParameterOf(Point2d)
 Curve2d.GetParameterOf(Point2d, Tolerance)
 Curve2d.GetTrimmedOffset(double, OffsetCurveExtensionType)
 Curve2d.GetTrimmedOffset(double, OffsetCurveExtensionType, Tolerance)
 Curve2d.IsClosed()
 Curve2d.IsClosed(Tolerance)
 Curve2d.IsPeriodic(out double)
 Curve2d.IsLinear(out Line2d)
 Curve2d.IsLinear(out Line2d, Tolerance)
 Curve2d.GetLength(double, double)
 Curve2d.GetLength(double, double, Tolerance)
 Curve2d.GetParameterAtLength(double, double, bool)
 Curve2d.GetParameterAtLength(double, double, bool, Tolerance)
 Curve2d.GetArea(double, double)
 Curve2d.GetArea(double, double, Tolerance)
 Curve2d.IsDegenerate(out Entity2d)
 Curve2d.IsDegenerate(out Entity2d, Tolerance)
 Curve2d.GetSplitCurves(double)
 Curve2d.Explode(Interval)
 Curve2d.GetBoundBlockOf(Interval)
 Curve2d.GetOrthoBoundBlockOf(Interval)
 Curve2d.EvaluatePoint(double)
 Curve2d.GetSamplePoints(int)
 Curve2d.GetSamplePoints(double, double, double)
 Curve2d.HasEndPoint
 Curve2d.HasStartPoint
 Curve2d.OrthoBoundBlock
 Curve2d.BoundBlock
 Entity2d.Clone()
 Entity2d.IsEqualTo(Entity2d)
 Entity2d.IsEqualTo(Entity2d, Tolerance)
 Entity2d.TransformBy(Matrix2d)
 Entity2d.TranslateBy(Vector2d)
 Entity2d.RotateBy(double, Point2d)
 Entity2d.Mirror(Line2d)
 Entity2d.ScaleBy(double, Point2d)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 NurbCurve2d()
public NurbCurve2d()
 NurbCurve2d(EllipticalArc2d)
public NurbCurve2d(EllipticalArc2d ellipse)
Parameters
ellipse EllipticalArc2d
 NurbCurve2d(LineSegment2d)
public NurbCurve2d(LineSegment2d linSegment)
Parameters
linSegment LineSegment2d
 NurbCurve2d(Point2dCollection)
public NurbCurve2d(Point2dCollection fitPoints)
Parameters
fitPoints Point2dCollection
 NurbCurve2d(Point2dCollection, Tolerance)
public NurbCurve2d(Point2dCollection fitPoints, Tolerance fitTolerance)
Parameters
fitPoints Point2dCollection
fitTolerance Tolerance
 NurbCurve2d(Point2dCollection, Vector2d, Vector2d, bool, bool)
public NurbCurve2d(Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent, bool startTangentDefined, bool endTangentDefined)
Parameters
fitPoints Point2dCollection
startTangent Vector2d
endTangent Vector2d
startTangentDefined bool
endTangentDefined bool
 NurbCurve2d(Point2dCollection, Vector2d, Vector2d, bool, bool, KnotParameterizationEnum)
public NurbCurve2d(Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent, bool startTangentDefined, bool endTangentDefined, KnotParameterizationEnum knotParam)
Parameters
fitPoints Point2dCollection
startTangent Vector2d
endTangent Vector2d
startTangentDefined bool
endTangentDefined bool
knotParam KnotParameterizationEnum
 NurbCurve2d(Point2dCollection, Vector2d, Vector2d, bool, bool, KnotParameterizationEnum, Tolerance)
public NurbCurve2d(Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent, bool startTangentDefined, bool endTangentDefined, KnotParameterizationEnum knotParam, Tolerance fitTolerance)
Parameters
fitPoints Point2dCollection
startTangent Vector2d
endTangent Vector2d
startTangentDefined bool
endTangentDefined bool
knotParam KnotParameterizationEnum
fitTolerance Tolerance
 NurbCurve2d(Point2dCollection, Vector2d, Vector2d, bool, bool, Tolerance)
public NurbCurve2d(Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent, bool startTangentDefined, bool endTangentDefined, Tolerance fitTolerance)
Parameters
fitPoints Point2dCollection
startTangent Vector2d
endTangent Vector2d
startTangentDefined bool
endTangentDefined bool
fitTolerance Tolerance
 NurbCurve2d(Point2dCollection, Vector2dCollection, Tolerance, bool)
public NurbCurve2d(Point2dCollection fitPoints, Vector2dCollection fitTangents, Tolerance fitTolerance, bool periodic)
Parameters
fitPoints Point2dCollection
fitTangents Vector2dCollection
fitTolerance Tolerance
periodic bool
 NurbCurve2d(Point2dCollection, Vector2dCollection, bool)
public NurbCurve2d(Point2dCollection fitPoints, Vector2dCollection fitTangents, bool periodic)
Parameters
fitPoints Point2dCollection
fitTangents Vector2dCollection
periodic bool
 NurbCurve2d(int, KnotCollection, Point2dCollection, DoubleCollection, bool)
public NurbCurve2d(int degree, KnotCollection knots, Point2dCollection controlPoints, DoubleCollection weights, bool periodic)
Parameters
degree int
knots KnotCollection
controlPoints Point2dCollection
weights DoubleCollection
periodic bool
 NurbCurve2d(int, KnotCollection, Point2dCollection, bool)
public NurbCurve2d(int degree, KnotCollection knots, Point2dCollection controlPoints, bool periodic)
Parameters
degree int
knots KnotCollection
controlPoints Point2dCollection
periodic bool
 NurbCurve2d(int, PolylineCurve2d, bool)
public NurbCurve2d(int degree, PolylineCurve2d fitPolyline, bool periodic)
Parameters
degree int
fitPolyline PolylineCurve2d
periodic bool
Properties
 DefinitionData
public NurbCurve2dData DefinitionData { get; }
Property Value
NurbCurve2dData
 EvalMode
public bool EvalMode { get; }
Property Value
bool
 FitData
public NurbCurve2dFitData FitData { get; }
Property Value
NurbCurve2dFitData
 FitKnotParameterization
public KnotParameterizationEnum FitKnotParameterization { get; set; }
Property Value
KnotParameterizationEnum
 FitTolerance
public Tolerance FitTolerance { get; set; }
Property Value
Tolerance
 NumFitPoints
public int NumFitPoints { get; }
Property Value
int
 NumWeights
public int NumWeights { get; }
Property Value
int
Methods
 AddControlPointAt(double, Point2d, double)
public void AddControlPointAt(double newKnot, Point2d point, double weight)
Parameters
newKnot double
point Point2d
weight double
 AddFitPointAt(int, Point2d)
public bool AddFitPointAt(int index, Point2d point)
Parameters
index int
point Point2d
Returns
bool
 AddKnot(double)
public void AddKnot(double newKnot)
Parameters
newKnot double
 Create(IntPtr, bool)
public static NurbCurve2d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
NurbCurve2d
 DeleteControlPointAt(int)
public void DeleteControlPointAt(int index)
Parameters
index int
 DeleteFitPointAt(int)
public bool DeleteFitPointAt(int index)
Parameters
index int
Returns
bool
 ElevateDegree(int)
public void ElevateDegree(int plusDegree)
Parameters
plusDegree int
 GetFitPointAt(int)
public Point2d GetFitPointAt(int index)
Parameters
index int
Returns
Point2d
 GetFitTangents()
public Vector2d[] GetFitTangents()
Returns
Vector2d[]
 GetParametersOfC1Discontinuity()
public DoubleCollection GetParametersOfC1Discontinuity()
Returns
DoubleCollection
 GetParametersOfC1Discontinuity(Tolerance)
public DoubleCollection GetParametersOfC1Discontinuity(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
DoubleCollection
 GetParametersOfG1Discontinuity()
public DoubleCollection GetParametersOfG1Discontinuity()
Returns
DoubleCollection
 GetParametersOfG1Discontinuity(Tolerance)
public DoubleCollection GetParametersOfG1Discontinuity(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
DoubleCollection
 GetWeightAt(int)
public double GetWeightAt(int index)
Parameters
index int
Returns
double
 HardTrimByParams(double, double)
public void HardTrimByParams(double newStartParameter, double newEndParameter)
Parameters
newStartParameter double
newEndParameter double
 InsertKnot(double)
public void InsertKnot(double newKnot)
Parameters
newKnot double
 JoinWith(NurbCurve2d)
public void JoinWith(NurbCurve2d curve)
Parameters
curve NurbCurve2d
 MakeClosed()
public void MakeClosed()
 MakeNonPeriodic()
public void MakeNonPeriodic()
 MakeOpen()
public void MakeOpen()
 MakePeriodic()
public void MakePeriodic()
 MakeRational(double)
public void MakeRational(double weight)
Parameters
weight double
 PurgeFitData()
public bool PurgeFitData()
Returns
bool
 SetEvaluateMode(bool)
public void SetEvaluateMode(bool evaluateMode)
Parameters
evaluateMode bool
 SetFitData(KnotCollection, Point2dCollection, Vector2d, Vector2d, Tolerance, bool)
public void SetFitData(KnotCollection fitKnots, Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent, Tolerance fitTolerance, bool periodic)
Parameters
fitKnots KnotCollection
fitPoints Point2dCollection
startTangent Vector2d
endTangent Vector2d
fitTolerance Tolerance
periodic bool
 SetFitData(KnotCollection, Point2dCollection, Vector2d, Vector2d, bool)
public void SetFitData(KnotCollection fitKnots, Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent, bool periodic)
Parameters
fitKnots KnotCollection
fitPoints Point2dCollection
startTangent Vector2d
endTangent Vector2d
periodic bool
 SetFitData(Point2dCollection, Vector2d, Vector2d)
public void SetFitData(Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent)
Parameters
fitPoints Point2dCollection
startTangent Vector2d
endTangent Vector2d
 SetFitData(Point2dCollection, Vector2d, Vector2d, KnotParameterizationEnum, Tolerance)
public void SetFitData(Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent, KnotParameterizationEnum knotParam, Tolerance fitTolerance)
Parameters
fitPoints Point2dCollection
startTangent Vector2d
endTangent Vector2d
knotParam KnotParameterizationEnum
fitTolerance Tolerance
 SetFitData(Point2dCollection, Vector2d, Vector2d, Tolerance)
public void SetFitData(Point2dCollection fitPoints, Vector2d startTangent, Vector2d endTangent, Tolerance fitTolerance)
Parameters
fitPoints Point2dCollection
startTangent Vector2d
endTangent Vector2d
fitTolerance Tolerance
 SetFitData(int, Point2dCollection)
public void SetFitData(int degree, Point2dCollection fitPoints)
Parameters
degree int
fitPoints Point2dCollection
 SetFitData(int, Point2dCollection, Tolerance)
public void SetFitData(int degree, Point2dCollection fitPoints, Tolerance fitTolerance)
Parameters
degree int
fitPoints Point2dCollection
fitTolerance Tolerance
 SetFitPointAt(int, Point2d)
public bool SetFitPointAt(int index, Point2d point)
Parameters
index int
point Point2d
Returns
bool
 SetFitTangents(Vector2d, Vector2d)
public bool SetFitTangents(Vector2d startTangent, Vector2d endTangent)
Parameters
startTangent Vector2d
endTangent Vector2d
Returns
bool
 SetWeightAt(int, double)
public void SetWeightAt(int index, double value)
Parameters
index int
value double