Table of Contents
 Class DBObject
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbObject")]
public abstract class DBObject : Drawable, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
Implements
IDisposable
ICloneable
Derived
AssocAction
AssocActionBody
AssocActionParam
AssocDependency
AssocDependencyBody
AssocManager
Background
BlockPropertiesTable
DBDictionary
DBVisualStyle
DataLink
DataTable
DetailViewStyle
DrawOrderTable
Entity
Field
Filter
Index
GeoLocationData
Group
LinkedData
LongTransaction
MLeaderStyle
Material
MlineStyle
PlaceHolder
PlotSettings
PointCloudColorMap
PointCloudDefEx
ProxyObject
RasterImageDef
RasterVariables
RenderEnvironment
RenderGlobal
RenderSettings
SectionManager
SectionSettings
SectionViewStyle
Sun
SymbolTable
SymbolTableRecord
TableStyle
UnderlayDefinition
Xrecord
Inherited Members
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DBObject(IntPtr, bool)
protected DBObject(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 AcadObject
public object AcadObject { get; }
Property Value
object
 Annotative
public AnnotativeStates Annotative { get; set; }
Property Value
AnnotativeStates
 ClassID
public Guid ClassID { get; }
Property Value
Guid
 Database
public Database Database { get; }
Property Value
Database
 Drawable
public virtual Drawable Drawable { get; }
Property Value
Drawable
 ExtensionDictionary
public ObjectId ExtensionDictionary { get; }
Property Value
ObjectId
 Handle
public Handle Handle { get; }
Property Value
Handle
 HasFields
public bool HasFields { get; }
Property Value
bool
 HasSaveVersionOverride
public bool HasSaveVersionOverride { get; set; }
Property Value
bool
 Id
public override ObjectId Id { get; }
Property Value
ObjectId
 IsAProxy
public bool IsAProxy { get; }
Property Value
bool
 IsCancelling
public bool IsCancelling { get; }
Property Value
bool
 IsEraseStatusToggled
public bool IsEraseStatusToggled { get; }
Property Value
bool
 IsErased
public bool IsErased { get; }
Property Value
bool
 IsModified
public bool IsModified { get; }
Property Value
bool
 IsModifiedGraphics
public bool IsModifiedGraphics { get; }
Property Value
bool
 IsModifiedXData
public bool IsModifiedXData { get; }
Property Value
bool
 IsNewObject
public bool IsNewObject { get; }
Property Value
bool
 IsNotifyEnabled
public bool IsNotifyEnabled { get; }
Property Value
bool
 IsNotifying
public bool IsNotifying { get; }
Property Value
bool
 IsObjectIdsInFlux
public bool IsObjectIdsInFlux { get; }
Property Value
bool
 IsPersistent
public override bool IsPersistent { get; }
Property Value
bool
 IsReadEnabled
public bool IsReadEnabled { get; }
Property Value
bool
 IsReallyClosing
public bool IsReallyClosing { get; }
Property Value
bool
 IsTransactionResident
public bool IsTransactionResident { get; }
Property Value
bool
 IsUndoing
public bool IsUndoing { get; }
Property Value
bool
 IsWriteEnabled
public bool IsWriteEnabled { get; }
Property Value
bool
 MergeStyle
public virtual DuplicateRecordCloning MergeStyle { get; set; }
Property Value
DuplicateRecordCloning
 ObjectBirthVersion
public virtual FullDwgVersion ObjectBirthVersion { get; }
Property Value
FullDwgVersion
 ObjectId
public ObjectId ObjectId { get; }
Property Value
ObjectId
 OwnerId
public virtual ObjectId OwnerId { get; set; }
Property Value
ObjectId
 PaperOrientation
public PaperOrientationStates PaperOrientation { get; }
Property Value
PaperOrientationStates
 UndoFiler
public DwgFiler UndoFiler { get; }
Property Value
DwgFiler
 XData
public virtual ResultBuffer XData { get; set; }
Property Value
ResultBuffer
Methods
 AddContext(ObjectContext)
public void AddContext(ObjectContext context)
Parameters
context ObjectContext
 ApplyPaperOrientationTransform(Viewport)
public void ApplyPaperOrientationTransform(Viewport viewport)
Parameters
viewport Viewport
 ApplyPartialUndo(DwgFiler, RXClass)
public virtual void ApplyPartialUndo(DwgFiler undoFiler, RXClass classObj)
Parameters
undoFiler DwgFiler
classObj RXClass
 Audit(AuditInfo)
public virtual void Audit(AuditInfo auditInfo)
Parameters
auditInfo AuditInfo
 Cancel()
[Obsolete("Use Transaction instead")]
public void Cancel()
 Close()
[Obsolete("Use Transaction instead")]
public void Close()
 CloseAndPage(bool)
[Obsolete("Use Transaction instead")]
public void CloseAndPage(bool onlyWhenClean)
Parameters
onlyWhenClean bool
 CreateExtensionDictionary()
public void CreateExtensionDictionary()
 DecomposeForSave(DwgVersion)
public virtual DecomposeForSaveReplacementRecord DecomposeForSave(DwgVersion version)
Parameters
version DwgVersion
Returns
DecomposeForSaveReplacementRecord
 DeepClone(DBObject, IdMapping, bool)
public DBObject DeepClone(DBObject ownerPointer, IdMapping idMap, bool isPrimary)
Parameters
ownerPointer DBObject
idMap IdMapping
isPrimary bool
Returns
DBObject
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 DisableUndoRecording(bool)
public void DisableUndoRecording(bool disable)
Parameters
disable bool
 Dispose(bool)
[HandleProcessCorruptedStateExceptions]
protected override void Dispose(bool A_0)
Parameters
A_0 bool
 DowngradeOpen()
public void DowngradeOpen()
 DowngradeToNotify(bool)
public void DowngradeToNotify(bool wasWritable)
Parameters
wasWritable bool
 DwgIn(DwgFiler)
public void DwgIn(DwgFiler filer)
Parameters
filer DwgFiler
 DwgOut(DwgFiler)
public void DwgOut(DwgFiler filer)
Parameters
filer DwgFiler
 DxfIn(DxfFiler)
public void DxfIn(DxfFiler filer)
Parameters
filer DxfFiler
 DxfOut(DxfFiler)
public void DxfOut(DxfFiler filer)
Parameters
filer DxfFiler
 Erase()
public void Erase()
 Erase(bool)
public void Erase(bool erasing)
Parameters
erasing bool
 FromAcadObject(object)
public static ObjectId FromAcadObject(object acadObj)
Parameters
acadObj object
Returns
ObjectId
 GetEventExtender(bool)
public DBObjectEventExtender GetEventExtender(bool create)
Parameters
create bool
Returns
DBObjectEventExtender
 GetField()
public ObjectId GetField()
Returns
ObjectId
 GetField(string)
public ObjectId GetField(string propertyName)
Parameters
propertyName string
Returns
ObjectId
 GetObjectSaveVersion(DwgFiler)
public virtual FullDwgVersion GetObjectSaveVersion(DwgFiler filer)
Parameters
filer DwgFiler
Returns
FullDwgVersion
 GetObjectSaveVersion(DxfFiler)
public virtual FullDwgVersion GetObjectSaveVersion(DxfFiler filer)
Parameters
filer DxfFiler
Returns
FullDwgVersion
 GetParameterInterface(string, bool)
public IParameter GetParameterInterface(string name, bool runtimeInterface)
Parameters
name string
runtimeInterface bool
Returns
IParameter
 GetPersistentReactorIds()
public ObjectIdCollection GetPersistentReactorIds()
Returns
ObjectIdCollection
 GetReactors()
[Obsolete("Use GetTransientReactors() instead.")]
public List<RXObject> GetReactors()
Returns
List<RXObject>
 GetTransientReactors()
public List<RXObject> GetTransientReactors()
Returns
List<RXObject>
 GetXDataForApplication(string)
public ResultBuffer GetXDataForApplication(string applicationName)
Parameters
applicationName string
Returns
ResultBuffer
 HandOverTo(DBObject, bool, bool)
public void HandOverTo(DBObject newPointer, bool keepXData, bool keepExtensionDictionary)
Parameters
newPointer DBObject
keepXData bool
keepExtensionDictionary bool
 HasContext(ObjectContext)
public bool HasContext(ObjectContext context)
Parameters
context ObjectContext
Returns
bool
 HasPersistentReactor(ObjectId)
public bool HasPersistentReactor(ObjectId objId)
Parameters
objId ObjectId
Returns
bool
 IsCustomObject(ObjectId)
public static bool IsCustomObject(ObjectId id)
Parameters
id ObjectId
Returns
bool
 ReleaseExtensionDictionary()
public void ReleaseExtensionDictionary()
 RemoveContext(ObjectContext)
public void RemoveContext(ObjectContext context)
Parameters
context ObjectContext
 RemoveField()
public ObjectId RemoveField()
Returns
ObjectId
 RemoveField(ObjectId)
public void RemoveField(ObjectId id)
Parameters
id ObjectId
 RemoveField(string)
public ObjectId RemoveField(string propertyName)
Parameters
propertyName string
Returns
ObjectId
 ResetScaleDependentProperties()
public void ResetScaleDependentProperties()
 SetField(Field)
public ObjectId SetField(Field field)
Parameters
field Field
Returns
ObjectId
 SetField(string, Field)
public ObjectId SetField(string propertyName, Field field)
Parameters
propertyName string
field Field
Returns
ObjectId
 SetFromStyle()
public bool SetFromStyle()
Returns
bool
 SetObjectIdsInFlux()
public void SetObjectIdsInFlux()
 SetPaperOrientation(bool)
public void SetPaperOrientation(bool bPaperOrientation)
Parameters
bPaperOrientation bool
 SubSetAttributes(DrawableTraits)
protected override int SubSetAttributes(DrawableTraits traits)
Parameters
traits DrawableTraits
Returns
int
 SubViewportDraw(ViewportDraw)
protected override void SubViewportDraw(ViewportDraw vd)
Parameters
vd ViewportDraw
 SubViewportDrawLogicalFlags(ViewportDraw)
protected override int SubViewportDrawLogicalFlags(ViewportDraw vd)
Parameters
vd ViewportDraw
Returns
int
 SubWorldDraw(WorldDraw)
protected override bool SubWorldDraw(WorldDraw wd)
Parameters
wd WorldDraw
Returns
bool
 SupportsCollection(string)
public bool SupportsCollection(string collectionName)
Parameters
collectionName string
Returns
bool
 SwapIdWith(ObjectId, bool, bool)
public void SwapIdWith(ObjectId otherId, bool swapExtendedData, bool swapExtensionDictionary)
Parameters
otherId ObjectId
swapExtendedData bool
swapExtensionDictionary bool
 SwapReferences(IdMapping)
public virtual void SwapReferences(IdMapping idMap)
Parameters
idMap IdMapping
 UpgradeFromNotify()
public bool UpgradeFromNotify()
Returns
bool
 UpgradeOpen()
public void UpgradeOpen()
 WblockClone(RXObject, IdMapping, bool)
public DBObject WblockClone(RXObject ownerPointer, IdMapping idMap, bool isPrimary)
Parameters
ownerPointer RXObject
idMap IdMapping
isPrimary bool
Returns
DBObject
 XDataTransformBy(Matrix3d)
public void XDataTransformBy(Matrix3d transform)
Parameters
transform Matrix3d
Events
 Cancelled
public event EventHandler Cancelled
Event Type
EventHandler
 Copied
public event ObjectEventHandler Copied
Event Type
ObjectEventHandler
 Erased
public event ObjectErasedEventHandler Erased
Event Type
ObjectErasedEventHandler
 Goodbye
public event EventHandler Goodbye
Event Type
EventHandler
 Modified
public event EventHandler Modified
Event Type
EventHandler
 ModifiedXData
public event EventHandler ModifiedXData
Event Type
EventHandler
 ModifyUndone
public event EventHandler ModifyUndone
Event Type
EventHandler
 ObjectClosed
public event ObjectClosedEventHandler ObjectClosed
Event Type
ObjectClosedEventHandler
 OpenedForModify
public event EventHandler OpenedForModify
Event Type
EventHandler
 Reappended
public event EventHandler Reappended
Event Type
EventHandler
 SubObjectModified
public event ObjectEventHandler SubObjectModified
Event Type
ObjectEventHandler
 Unappended
public event EventHandler Unappended
Event Type
EventHandler