Table of Contents
 Enum VSFaceModifiers
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcGiVisualStyleProperties::FaceModifiers")]
public enum VSFaceModifiers
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
FaceOpacityFlag = 1
None = 0
SpecularFlag = 2