Table of Contents
 Enum CellAlignment
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::CellAlignment")]
public enum CellAlignment
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BottomCenter = 8
BottomLeft = 7
BottomRight = 9
MiddleCenter = 5
MiddleLeft = 4
MiddleRight = 6
TopCenter = 2
TopLeft = 1
TopRight = 3