Table of Contents
 Enum ImageDisplayOptions
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcDbRasterImage::ImageDisplayOpt")]
public enum ImageDisplayOptions
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Clip = 4
Show = 1
ShowUnaligned = 2
Transparent = 8