Table of Contents
 Enum SectionViewArrowDirection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbSectionViewStyle::ArrowDirection")]
public enum SectionViewArrowDirection
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AwayFromCuttingPlane = 1
TowardsCuttingPlane = 0