Table of Contents
 Class CellContent
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class CellContent
Inheritance
object
CellContent
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 BlockTableRecordId
public ObjectId BlockTableRecordId { get; set; }
Property Value
ObjectId
 ContentColor
public Color ContentColor { get; set; }
Property Value
Color
 ContentTypes
public CellContentTypes ContentTypes { get; }
Property Value
CellContentTypes
 DataFormat
public string DataFormat { get; set; }
Property Value
string
 DataType
public DataTypeParameter DataType { get; set; }
Property Value
DataTypeParameter
 FieldId
public ObjectId FieldId { get; set; }
Property Value
ObjectId
 Formula
public string Formula { get; set; }
Property Value
string
 HasFormula
public bool HasFormula { get; }
Property Value
bool
 IsAutoScale
public bool IsAutoScale { get; set; }
Property Value
bool
 Overrides
public CellProperties Overrides { get; set; }
Property Value
CellProperties
 Rotation
public double Rotation { get; set; }
Property Value
double
 Scale
public double Scale { get; set; }
Property Value
double
 TextHeight
public double TextHeight { get; set; }
Property Value
double
 TextString
public string TextString { get; set; }
Property Value
string
 TextStyleId
public ObjectId TextStyleId { get; set; }
Property Value
ObjectId
 Value
public object Value { get; set; }
Property Value
object
Methods
 DeleteContent()
public void DeleteContent()
 GetBlockAttributeValue(ObjectId)
public string GetBlockAttributeValue(ObjectId attDefId)
Parameters
attDefId ObjectId
Returns
string
 GetTextString(FormatOption)
public string GetTextString(FormatOption formatOption)
Parameters
formatOption FormatOption
Returns
string
 GetValue(FormatOption)
public object GetValue(FormatOption formatOption)
Parameters
formatOption FormatOption
Returns
object
 SetBlockAttributeValue(ObjectId, string)
public void SetBlockAttributeValue(ObjectId attDefId, string value)
Parameters
attDefId ObjectId
value string
 SetValue(object, ParseOption)
public void SetValue(object value, ParseOption parseOption)
Parameters
value object
parseOption ParseOption