Table of Contents
 Enum ObjectSnapModes
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcDb::OsnapMode")]
public enum ObjectSnapModes
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ModeCenter = ModeEnd | ModeMid
ModeEnd = 1
ModeIns = ModeMid | ModeQuad
ModeMid = 2
ModeNear = ModeMid | ModePerpendicular
ModeNode = 4
ModePerpendicular = 8
ModeQuad = ModeEnd | ModeNode
ModeTangent = ModeEnd | ModePerpendicular