Table of Contents
 Class DrawingCompare
Namespace
Autodesk.AutoCAD.DatabaseServices.Internal
Assembly
Acdbmgd.dll
public class DrawingCompare
Inheritance
object
DrawingCompare
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DrawingCompare()
public DrawingCompare()
Fields
 m_ObjectDiffEvent
public ObjectDiffEventHandler m_ObjectDiffEvent
Field Value
ObjectDiffEventHandler
Methods
 CompareDwgFiles(string, string)
public CompareReturnStatus CompareDwgFiles(string file1name, string file2name)
Parameters
file1name string
file2name string
Returns
CompareReturnStatus
 OnDiffDetected(int, ulong*, int)
public void OnDiffDetected(int drawingId, ulong* handle, int changeType)
Parameters
drawingId int
handle ulong*
changeType int
Events
 ObjectDiffEvent
public event ObjectDiffEventHandler ObjectDiffEvent
Event Type
ObjectDiffEventHandler