Table of Contents
 Enum FindFileHint
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbHostApplicationServices::FindFileHint")]
public enum FindFileHint
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ArxApplication = 7
CompiledShapeFile = 2
Default = 0
EmbeddedImageFile = 4
FontFile = 1
FontMapFile = 8
PatternFile = 6
TrueTypeFontFile = 3
UnderlayFile = 9
XRefDrawing = 5