Table of Contents
 Struct Matrix3d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeMatrix3d")]
public struct Matrix3d : IFormattable
Implements
IFormattable
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 Matrix3d(double[])
public Matrix3d(double[] data)
Parameters
data double[]
Properties
 CoordinateSystem3d
public CoordinateSystem3d CoordinateSystem3d { get; }
Property Value
CoordinateSystem3d
 this[int, int]
public double this[int row, int column] { get; }
Parameters
row int
column int
Property Value
double
 Identity
public static Matrix3d Identity { get; }
Property Value
Matrix3d
 Normal
public double Normal { get; }
Property Value
double
 Translation
public Vector3d Translation { get; }
Property Value
Vector3d
Methods
 AlignCoordinateSystem(Point3d, Vector3d, Vector3d, Vector3d, Point3d, Vector3d, Vector3d, Vector3d)
public static Matrix3d AlignCoordinateSystem(Point3d fromOrigin, Vector3d fromXAxis, Vector3d fromYAxis, Vector3d fromZAxis, Point3d toOrigin, Vector3d toXAxis, Vector3d toYAxis, Vector3d toZAxis)
Parameters
fromOrigin Point3d
fromXAxis Vector3d
fromYAxis Vector3d
fromZAxis Vector3d
toOrigin Point3d
toXAxis Vector3d
toYAxis Vector3d
toZAxis Vector3d
Returns
Matrix3d
 Displacement(Vector3d)
public static Matrix3d Displacement(Vector3d vector)
Parameters
vector Vector3d
Returns
Matrix3d
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetDeterminant()
public double GetDeterminant()
Returns
double
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 GetScale()
public double GetScale()
Returns
double
 Inverse()
public Matrix3d Inverse()
Returns
Matrix3d
 IsEqualTo(Matrix3d)
public bool IsEqualTo(Matrix3d mat)
Parameters
mat Matrix3d
Returns
bool
 IsEqualTo(Matrix3d, Tolerance)
public bool IsEqualTo(Matrix3d mat, Tolerance tolerance)
Parameters
mat Matrix3d
tolerance Tolerance
Returns
bool
 IsInverse(Matrix3d)
public bool IsInverse(Matrix3d inv)
Parameters
inv Matrix3d
Returns
bool
 IsInverse(Matrix3d, Tolerance)
public bool IsInverse(Matrix3d inv, Tolerance tolerance)
Parameters
inv Matrix3d
tolerance Tolerance
Returns
bool
 IsScaledOrtho()
public bool IsScaledOrtho()
Returns
bool
 IsScaledOrtho(Tolerance)
public bool IsScaledOrtho(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 IsSingular()
public bool IsSingular()
Returns
bool
 IsSingular(Tolerance)
public bool IsSingular(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 IsUniscaledOrtho()
public bool IsUniscaledOrtho()
Returns
bool
 IsUniscaledOrtho(Tolerance)
public bool IsUniscaledOrtho(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 Mirroring(Line3d)
public static Matrix3d Mirroring(Line3d line)
Parameters
line Line3d
Returns
Matrix3d
 Mirroring(Plane)
public static Matrix3d Mirroring(Plane plane)
Parameters
plane Plane
Returns
Matrix3d
 Mirroring(Point3d)
public static Matrix3d Mirroring(Point3d pointValue)
Parameters
pointValue Point3d
Returns
Matrix3d
 PlaneToWorld(Plane)
public static Matrix3d PlaneToWorld(Plane plane)
Parameters
plane Plane
Returns
Matrix3d
 PlaneToWorld(Vector3d)
public static Matrix3d PlaneToWorld(Vector3d normal)
Parameters
normal Vector3d
Returns
Matrix3d
 PostMultiplyBy(Matrix3d)
public Matrix3d PostMultiplyBy(Matrix3d rightSide)
Parameters
rightSide Matrix3d
Returns
Matrix3d
 PreMultiplyBy(Matrix3d)
public Matrix3d PreMultiplyBy(Matrix3d leftSide)
Parameters
leftSide Matrix3d
Returns
Matrix3d
 Projection(Plane, Vector3d)
public static Matrix3d Projection(Plane projectionPlane, Vector3d projectDir)
Parameters
projectionPlane Plane
projectDir Vector3d
Returns
Matrix3d
 Rotation(double, Vector3d, Point3d)
public static Matrix3d Rotation(double angle, Vector3d axis, Point3d center)
Parameters
angle double
axis Vector3d
center Point3d
Returns
Matrix3d
 Scaling(double, Point3d)
public static Matrix3d Scaling(double scaleAll, Point3d center)
Parameters
scaleAll double
center Point3d
Returns
Matrix3d
 ToArray()
public double[] ToArray()
Returns
double[]
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
 ToString(string, IFormatProvider)
public string ToString(string format, IFormatProvider provider)
Parameters
format string
provider IFormatProvider
Returns
string
 Transpose()
public Matrix3d Transpose()
Returns
Matrix3d
 WorldToPlane(Plane)
public static Matrix3d WorldToPlane(Plane plane)
Parameters
plane Plane
Returns
Matrix3d
 WorldToPlane(Vector3d)
public static Matrix3d WorldToPlane(Vector3d normal)
Parameters
normal Vector3d
Returns
Matrix3d
Operators
 operator ==(Matrix3d, Matrix3d)
public static bool operator ==(Matrix3d a, Matrix3d b)
Parameters
a Matrix3d
b Matrix3d
Returns
bool
 operator !=(Matrix3d, Matrix3d)
public static bool operator !=(Matrix3d a, Matrix3d b)
Parameters
a Matrix3d
b Matrix3d
Returns
bool
 operator *(Matrix3d, Matrix3d)
public static Matrix3d operator *(Matrix3d a, Matrix3d b)
Parameters
a Matrix3d
b Matrix3d
Returns
Matrix3d