Table of Contents
 Class ObjectTypeAttribute
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[AttributeUsage(AttributeTargets.Property|AttributeTargets.Field|AttributeTargets.Parameter|AttributeTargets.ReturnValue, AllowMultiple = false, Inherited = true)]
public sealed class ObjectTypeAttribute : Attribute, _Attribute
Inheritance
object
Attribute
ObjectTypeAttribute
Implements
_Attribute
Inherited Members
 Attribute.GetCustomAttributes(MemberInfo, Type)
 Attribute.GetCustomAttributes(MemberInfo, Type, bool)
 Attribute.GetCustomAttributes(MemberInfo)
 Attribute.GetCustomAttributes(MemberInfo, bool)
 Attribute.IsDefined(MemberInfo, Type)
 Attribute.IsDefined(MemberInfo, Type, bool)
 Attribute.GetCustomAttribute(MemberInfo, Type)
 Attribute.GetCustomAttribute(MemberInfo, Type, bool)
 Attribute.GetCustomAttributes(ParameterInfo)
 Attribute.GetCustomAttributes(ParameterInfo, Type)
 Attribute.GetCustomAttributes(ParameterInfo, Type, bool)
 Attribute.GetCustomAttributes(ParameterInfo, bool)
 Attribute.IsDefined(ParameterInfo, Type)
 Attribute.IsDefined(ParameterInfo, Type, bool)
 Attribute.GetCustomAttribute(ParameterInfo, Type)
 Attribute.GetCustomAttribute(ParameterInfo, Type, bool)
 Attribute.GetCustomAttributes(Module, Type)
 Attribute.GetCustomAttributes(Module)
 Attribute.GetCustomAttributes(Module, bool)
 Attribute.GetCustomAttributes(Module, Type, bool)
 Attribute.IsDefined(Module, Type)
 Attribute.IsDefined(Module, Type, bool)
 Attribute.GetCustomAttribute(Module, Type)
 Attribute.GetCustomAttribute(Module, Type, bool)
 Attribute.GetCustomAttributes(Assembly, Type)
 Attribute.GetCustomAttributes(Assembly, Type, bool)
 Attribute.GetCustomAttributes(Assembly)
 Attribute.GetCustomAttributes(Assembly, bool)
 Attribute.IsDefined(Assembly, Type)
 Attribute.IsDefined(Assembly, Type, bool)
 Attribute.GetCustomAttribute(Assembly, Type)
 Attribute.GetCustomAttribute(Assembly, Type, bool)
 Attribute.Equals(object)
 Attribute.GetHashCode()
 Attribute.Match(object)
 Attribute.IsDefaultAttribute()
 Attribute.TypeId
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ObjectTypeAttribute(Type)
public ObjectTypeAttribute(Type type)
Parameters
type Type
Properties
 ObjectType
public Type ObjectType { get; }
Property Value
Type