Table of Contents
 Class WorldGeometry
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiWorldGeometry")]
public abstract class WorldGeometry : Geometry, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Geometry
WorldGeometry
Implements
IDisposable
ICloneable
Inherited Members
 Geometry.PushModelTransform(Matrix3d)
 Geometry.PushModelTransform(Vector3d)
 Geometry.PopModelTransform()
 Geometry.PushPositionTransform(PositionBehavior, Point2d)
 Geometry.PushPositionTransform(PositionBehavior, Point3d)
 Geometry.PushScaleTransform(ScaleBehavior, Point2d)
 Geometry.PushScaleTransform(ScaleBehavior, Point3d)
 Geometry.PushOrientationTransform(OrientationBehavior)
 Geometry.Circle(Point3d, Point3d, Point3d)
 Geometry.Circle(Point3d, double, Vector3d)
 Geometry.CircularArc(Point3d, Point3d, Point3d, ArcType)
 Geometry.CircularArc(Point3d, double, Vector3d, Vector3d, double, ArcType)
 Geometry.Polyline(Polyline, int, int)
 Geometry.Polyline(Polyline)
 Geometry.Polyline(Point3dCollection, Vector3d, IntPtr)
 Geometry.PolyPolyline(PolylineCollection)
 Geometry.Polygon(Point3dCollection)
 Geometry.PolyPolygon(UInt32Collection, Point3dCollection, UInt32Collection, Point3dCollection, EntityColorCollection, LinetypeCollection, EntityColorCollection, TransparencyCollection)
 Geometry.Mesh(int, int, Point3dCollection, EdgeData, FaceData, VertexData, bool)
 Geometry.Shell(Point3dCollection, IntegerCollection, EdgeData, FaceData, VertexData, bool)
 Geometry.Text(Point3d, Vector3d, Vector3d, string, bool, TextStyle)
 Geometry.Text(Point3d, Vector3d, Vector3d, double, double, double, string)
 Geometry.Xline(Point3d, Point3d)
 Geometry.Ray(Point3d, Point3d)
 Geometry.Draw(Drawable)
 Geometry.PushClipBoundary(ClipBoundary)
 Geometry.PopClipBoundary()
 Geometry.WorldLine(Point3d, Point3d)
 Geometry.Image(ImageBGRA32, Point3d, Vector3d, Vector3d, TransparencyMode)
 Geometry.Image(ImageBGRA32, Point3d, Vector3d, Vector3d)
 Geometry.RowOfDots(int, Point3d, Vector3d)
 Geometry.EllipticalArc(Point3d, Vector3d, double, double, double, double, double, ArcType)
 Geometry.Polypoint(Point3dCollection, Vector3dCollection, IntPtrCollection)
 Geometry.OwnerDraw(GdiDrawObject, Point3d, Vector3d, Vector3d)
 Geometry.Edge(Curve2dCollection)
 Geometry.WorldToModelTransform
 Geometry.ModelToWorldTransform
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 WorldGeometry()
protected WorldGeometry()
 WorldGeometry(IntPtr, bool)
protected WorldGeometry(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Methods
 SetExtents(Extents3d)
public abstract void SetExtents(Extents3d extents)
Parameters
extents Extents3d
 StartAttributesSegment()
public abstract void StartAttributesSegment()