Table of Contents
 Enum HatchPatternType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbHatch::HatchPatternType")]
public enum HatchPatternType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CustomDefined = 2
PreDefined = 1
UserDefined = 0