Table of Contents
 Class PointCloudItem
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class PointCloudItem : Notifier, INotifyPropertyChanged
Inheritance
object
Notifier
PointCloudItem
Implements
INotifyPropertyChanged
Inherited Members
 Notifier.raise_PropertyChanged(object, PropertyChangedEventArgs)
 Notifier.OnPropertyChanged(string)
 Notifier.PropertyChanged
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 PointCloudItem()
public PointCloudItem()
Properties
 CategoryId
public PointCloudItemType CategoryId { get; set; }
Property Value
PointCloudItemType
 CurrentAdsName
public ValueType CurrentAdsName { get; set; }
Property Value
ValueType
 Guid
public string Guid { get; set; }
Property Value
string
 ItemId
public int ItemId { get; set; }
Property Value
int
 Name
public string Name { get; set; }
Property Value
string
 ProjectName
public string ProjectName { get; set; }
Property Value
string
 Visibility
public bool Visibility { get; set; }
Property Value
bool
Methods
 Clone()
public PointCloudItem Clone()
Returns
PointCloudItem
 CompareTo(PointCloudItem)
public bool CompareTo(PointCloudItem other)
Parameters
other PointCloudItem
Returns
bool
 CreatePointCloudDataItemCollection(IntPtr)
public static List<PointCloudItem> CreatePointCloudDataItemCollection(IntPtr unmanagedObjPtr)
Parameters
unmanagedObjPtr IntPtr
Returns
List<PointCloudItem>
 ToCmdString()
public string ToCmdString()
Returns
string