Table of Contents
 Interface IMenuItem
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public interface IMenuItem
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Checked
bool Checked { get; set; }
Property Value
bool
 Enabled
bool Enabled { get; set; }
Property Value
bool
 Icon
Icon Icon { get; set; }
Property Value
Icon
 Items
IEnumerable<IMenuItem> Items { get; }
Property Value
IEnumerable<IMenuItem>
 Text
string Text { get; set; }
Property Value
string
 Visible
bool Visible { get; set; }
Property Value
bool
Methods
 OnClicked(EventArgs)
void OnClicked(EventArgs eventArgs)
Parameters
eventArgs EventArgs
Events
 Click
event EventHandler Click
Event Type
EventHandler