Table of Contents
 Struct GridPropertyParameter
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcGridProp")]
public struct GridPropertyParameter
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
 Color
public Color Color
Field Value
Color
 DoubleLineSpacing
public double DoubleLineSpacing
Field Value
double
 LineStyle
public GridLineStyle LineStyle
Field Value
GridLineStyle
 LineWeight
public LineWeight LineWeight
Field Value
LineWeight
 Linetype
public ObjectId Linetype
Field Value
ObjectId
 PropertyMask
public GridProperties PropertyMask
Field Value
GridProperties
 Visibility
public Visibility Visibility
Field Value
Visibility