Table of Contents
 Enum GetGripPointsFlags
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
public enum GetGripPointsFlags
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CyclableGripsOnly = 2
DynamicDimensionMode = 4
GripPointsOnly = 1