Table of Contents
 Enum CellClass
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcDb::CellClass")]
public enum CellClass
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Data = 2
Label = 1
None = 0