Table of Contents
 Class AssocNetwork
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocNetwork")]
public class AssocNetwork : AssocAction, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
AssocAction
AssocNetwork
Implements
IDisposable
ICloneable
Inherited Members
 AssocAction.GetActionBody(ObjectId)
 AssocAction.SetStatus(AssocStatus, bool, bool)
 AssocAction.SetOwningNetwork(ObjectId, bool)
 AssocAction.GetDependencies(bool, bool)
 AssocAction.AddDependency(ObjectId, bool)
 AssocAction.RemoveDependency(ObjectId, bool)
 AssocAction.RemoveAllDependencies(bool)
 AssocAction.GetDependentObjects(bool, bool)
 AssocAction.IsOwnedDependency(AssocDependency)
 AssocAction.IsExternalDependency(AssocDependency)
 AssocAction.IsRelevantDependencyChange(AssocDependency)
 AssocAction.HasDependencyCachedValue(AssocDependency)
 AssocAction.AreDependenciesOnTheSameThing(AssocDependency, AssocDependency)
 AssocAction.AreDependenciesEqual(AssocDependency, AssocDependency)
 AssocAction.GetActionsDependentOnObject(DBObject, bool, bool, ObjectIdCollection)
 AssocAction.GetActionsDependentOnObject(DBObject, bool, bool)
 AssocAction.DependentObjectCloned(AssocDependency, DBObject, DBObject)
 AssocAction.AddMoreObjectsToDeepClone(IdMapping, ObjectIdCollection)
 AssocAction.PostProcessAfterDeepClone(IdMapping)
 AssocAction.PostProcessAfterDeepCloneCancel(IdMapping)
 AssocAction.EvaluateDependencies()
 AssocAction.EvaluateDependency(AssocDependency)
 AssocAction.OwnedDependencyStatusChanged(AssocDependency, AssocStatus)
 AssocAction.TransformActionBy(Matrix3d)
 AssocAction.IsEqualTo(AssocAction)
 AssocAction.EvaluationPriority()
 AssocAction.GetDependentActionsToEvaluate(ActionsToEvaluateCallback)
 AssocAction.Evaluate(AssocEvaluationCallback)
 AssocAction.ObjectThatOwnsNetworkInstance()
 AssocAction.DragStatus(DragStatus)
 AssocAction.RemoveActionsControllingObject(ObjectId, int, ObjectId)
 AssocAction.RemoveActionsControllingObject(ObjectId, int)
 AssocAction.RemoveActionsControllingObject(ObjectId)
 AssocAction.CurrentEvaluationCallback
 AssocAction.IsActionEvaluationInProgress
 AssocAction.OwningNetwork
 AssocAction.Status
 AssocAction.IsActionBodyAProxy
 AssocAction.ActionBody
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocNetwork()
public AssocNetwork()
 AssocNetwork(IntPtr, bool)
protected AssocNetwork(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 GetActions
public ObjectIdCollection GetActions { get; }
Property Value
ObjectIdCollection
Methods
 AddAction(ObjectId, bool)
public void AddAction(ObjectId actionId, bool alsoSetAsDatabaseOwner)
Parameters
actionId ObjectId
alsoSetAsDatabaseOwner bool
 AddActions(ObjectIdCollection, bool)
public void AddActions(ObjectIdCollection actionIds, bool alsoSetAsDatabaseOwner)
Parameters
actionIds ObjectIdCollection
alsoSetAsDatabaseOwner bool
 GetInstanceFromDatabase(Database, bool, string)
public static ObjectId GetInstanceFromDatabase(Database database, bool createIfDoesNotExist, string dictionaryKey)
Parameters
database Database
createIfDoesNotExist bool
dictionaryKey string
Returns
ObjectId
 GetInstanceFromObject(ObjectId, bool, bool, string)
public static ObjectId GetInstanceFromObject(ObjectId owningObjectId, bool createIfDoesNotExist, bool addToTopLevelNetwork, string dictionaryKey)
Parameters
owningObjectId ObjectId
createIfDoesNotExist bool
addToTopLevelNetwork bool
dictionaryKey string
Returns
ObjectId
 OwnedActionStatusChanged(AssocAction, AssocStatus)
public void OwnedActionStatusChanged(AssocAction ownedAction, AssocStatus previousStatus)
Parameters
ownedAction AssocAction
previousStatus AssocStatus
 RemoveAction(ObjectId, bool)
public void RemoveAction(ObjectId actionId, bool alsoEraseIt)
Parameters
actionId ObjectId
alsoEraseIt bool
 RemoveAllActions(bool)
public void RemoveAllActions(bool alsoEraseThem)
Parameters
alsoEraseThem bool
 RemoveInstanceFromDatabase(Database, bool, string)
public static void RemoveInstanceFromDatabase(Database database, bool alsoEraseIt, string dictionaryKey)
Parameters
database Database
alsoEraseIt bool
dictionaryKey string
 RemoveInstanceFromObject(ObjectId, bool, string)
public static void RemoveInstanceFromObject(ObjectId owningObjectId, bool alsoEraseIt, string dictionaryKey)
Parameters
owningObjectId ObjectId
alsoEraseIt bool
dictionaryKey string