Table of Contents
 Class Notifier
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class Notifier : INotifyPropertyChanged
Inheritance
object
Notifier
Implements
INotifyPropertyChanged
Derived
PointCloudItem
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Notifier()
public Notifier()
Methods
 OnPropertyChanged(string)
public void OnPropertyChanged(string propertyName)
Parameters
propertyName string
 raise_PropertyChanged(object, PropertyChangedEventArgs)
protected virtual void raise_PropertyChanged(object value0, PropertyChangedEventArgs value1)
Parameters
value0 object
value1 PropertyChangedEventArgs
Events
 PropertyChanged
public virtual event PropertyChangedEventHandler PropertyChanged
Event Type
PropertyChangedEventHandler