Table of Contents
 Enum ClipError
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public enum ClipError
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
InvalidClipBoundary = 1
NotInitialized = 2
OK = 0