Table of Contents
 Class AssocActionBody
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocActionBody")]
public abstract class AssocActionBody : DBObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
AssocActionBody
Implements
IDisposable
ICloneable
Derived
AssocParamBasedActionBody
Inherited Members
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocActionBody()
public AssocActionBody()
 AssocActionBody(IntPtr, bool)
protected AssocActionBody(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 OwnedParams
public ObjectIdCollection OwnedParams { get; }
Property Value
ObjectIdCollection
 OwningNetwork
public ObjectId OwningNetwork { get; }
Property Value
ObjectId
 ParamCount
public int ParamCount { get; }
Property Value
int
 ParentAction
public ObjectId ParentAction { get; }
Property Value
ObjectId
 Status
public AssocStatus Status { get; set; }
Property Value
AssocStatus
Methods
 AddDependency(ObjectId, bool)
public void AddDependency(ObjectId dependencyId, bool setThisActionAsOwningAction)
Parameters
dependencyId ObjectId
setThisActionAsOwningAction bool
 AddMoreObjectsToDeepCloneOverride(IdMapping, ObjectIdCollection)
public virtual void AddMoreObjectsToDeepCloneOverride(IdMapping idMap, ObjectIdCollection additionalObjectsToClone)
Parameters
idMap IdMapping
additionalObjectsToClone ObjectIdCollection
 AddParam(ObjectId, ref int)
public void AddParam(ObjectId paramId, ref int paramIndex)
Parameters
paramId ObjectId
paramIndex int
 AreDependenciesEqualOverride(AssocDependency, AssocDependency)
public virtual bool AreDependenciesEqualOverride(AssocDependency dependency1, AssocDependency dependency2)
Parameters
dependency1 AssocDependency
dependency2 AssocDependency
Returns
bool
 AreDependenciesOnTheSameThingOverride(AssocDependency, AssocDependency)
public virtual bool AreDependenciesOnTheSameThingOverride(AssocDependency dependency1, AssocDependency dependency2)
Parameters
dependency1 AssocDependency
dependency2 AssocDependency
Returns
bool
 CreateActionAndActionBodyAndPostToDatabase(RXClass, ObjectId, ObjectId, ObjectId)
public static void CreateActionAndActionBodyAndPostToDatabase(RXClass pActionBodyClass, ObjectId objectId, ObjectId createdActionId, ObjectId createdActionBodyId)
Parameters
pActionBodyClass RXClass
objectId ObjectId
createdActionId ObjectId
createdActionBodyId ObjectId
 DependentObjectClonedOverride(AssocDependency, DBObject, DBObject)
public virtual void DependentObjectClonedOverride(AssocDependency pDependency, DBObject dbObj, DBObject dbNewObj)
Parameters
pDependency AssocDependency
dbObj DBObject
dbNewObj DBObject
 DragStatusOverride(DragStatus)
public virtual void DragStatusOverride(DragStatus status)
Parameters
status DragStatus
 DwgInFields(DwgFiler)
public virtual ErrorStatus DwgInFields(DwgFiler filer)
Parameters
filer DwgFiler
Returns
ErrorStatus
 DwgOutFields(DwgFiler)
public virtual ErrorStatus DwgOutFields(DwgFiler filer)
Parameters
filer DwgFiler
Returns
ErrorStatus
 DxfInFields(DxfFiler)
public virtual ErrorStatus DxfInFields(DxfFiler filer)
Parameters
filer DxfFiler
Returns
ErrorStatus
 DxfOutFields(DxfFiler)
public virtual ErrorStatus DxfOutFields(DxfFiler filer)
Parameters
filer DxfFiler
Returns
ErrorStatus
 EvaluateDependencies()
public void EvaluateDependencies()
 EvaluateDependencyOverride(AssocDependency)
public virtual bool EvaluateDependencyOverride(AssocDependency dependency)
Parameters
dependency AssocDependency
Returns
bool
 EvaluateOverride()
public abstract void EvaluateOverride()
 EvaluationPriorityOverride(ref AssocEvaluationPriority)
public virtual void EvaluationPriorityOverride(ref AssocEvaluationPriority priority)
Parameters
priority AssocEvaluationPriority
 GetActionBodiesOnObject(DBObject, bool, bool, out ObjectId, out ObjectIdCollection, out ObjectIdCollection)
public static void GetActionBodiesOnObject(DBObject pObject, bool ignoreInternalActions, bool ignoreSuppressedActions, out ObjectId creationActionBodyId, out ObjectIdCollection modificationActionBodyIds, out ObjectIdCollection readOnlyActionBodyIds)
Parameters
pObject DBObject
ignoreInternalActions bool
ignoreSuppressedActions bool
creationActionBodyId ObjectId
modificationActionBodyIds ObjectIdCollection
readOnlyActionBodyIds ObjectIdCollection
 GetDependencies(bool, bool)
public ObjectIdCollection GetDependencies(bool readDependenciesWanted, bool writeDependenciesWanted)
Parameters
readDependenciesWanted bool
writeDependenciesWanted bool
Returns
ObjectIdCollection
 GetDependenciesOverride(bool, bool)
public ObjectIdCollection GetDependenciesOverride(bool readDependenciesWanted, bool writeDependenciesWanted)
Parameters
readDependenciesWanted bool
writeDependenciesWanted bool
Returns
ObjectIdCollection
 GetDependentActionsToEvaluateOverride(ActionsToEvaluateCallback)
public virtual void GetDependentActionsToEvaluateOverride(ActionsToEvaluateCallback actionsToEvaluateCallback)
Parameters
actionsToEvaluateCallback ActionsToEvaluateCallback
 GetDependentObjectsOverride(bool, bool)
public ObjectIdCollection GetDependentObjectsOverride(bool readDependenciesWanted, bool writeDependenciesWanted)
Parameters
readDependenciesWanted bool
writeDependenciesWanted bool
Returns
ObjectIdCollection
 GetParentAction(ObjectId)
public static ObjectId GetParentAction(ObjectId actionBodyId)
Parameters
actionBodyId ObjectId
Returns
ObjectId
 GetValueParam(string)
public AssocActionBody.ValueParam GetValueParam(string paramName)
Parameters
paramName string
Returns
AssocActionBody.ValueParam
 GetValueParam(string, int)
public AssocActionBody.ValueParam GetValueParam(string paramName, int paramIndex)
Parameters
paramName string
paramIndex int
Returns
AssocActionBody.ValueParam
 GetValueParamArray(string)
public AssocActionBody.ValueParam[] GetValueParamArray(string paramName)
Parameters
paramName string
Returns
ValueParam[]
 GetValueParamUnitType(string)
public UnitType GetValueParamUnitType(string paramName)
Parameters
paramName string
Returns
UnitType
 HasAnyErasedOrBrokenDependencies()
public bool HasAnyErasedOrBrokenDependencies()
Returns
bool
 HasDependencyCachedValueOverride(AssocDependency)
public virtual bool HasDependencyCachedValueOverride(AssocDependency dependency)
Parameters
dependency AssocDependency
Returns
bool
 IsActionEvaluationInProgress()
public bool IsActionEvaluationInProgress()
Returns
bool
 IsEqualToOverride(AssocAction)
public virtual bool IsEqualToOverride(AssocAction otherAction)
Parameters
otherAction AssocAction
Returns
bool
 IsExternalDependencyOverride(AssocDependency)
public virtual bool IsExternalDependencyOverride(AssocDependency dependency)
Parameters
dependency AssocDependency
Returns
bool
 IsOwnedDependencyOverride(AssocDependency)
public virtual bool IsOwnedDependencyOverride(AssocDependency dependency)
Parameters
dependency AssocDependency
Returns
bool
 IsRelevantDependencyChangeOverride(AssocDependency)
public virtual bool IsRelevantDependencyChangeOverride(AssocDependency dependency)
Parameters
dependency AssocDependency
Returns
bool
 OwnedDependencyStatusChangedOverride(AssocDependency, AssocStatus)
public virtual void OwnedDependencyStatusChangedOverride(AssocDependency ownedDependency, AssocStatus previousStatus)
Parameters
ownedDependency AssocDependency
previousStatus AssocStatus
 OwnedValueParamNames()
public string[] OwnedValueParamNames()
Returns
string[]
 ParamAtIndex(int)
public ObjectId ParamAtIndex(int paramIndex)
Parameters
paramIndex int
Returns
ObjectId
 ParamAtName(string)
public ObjectId ParamAtName(string paramName)
Parameters
paramName string
Returns
ObjectId
 ParamAtName(string, int)
public ObjectId ParamAtName(string paramName, int index)
Parameters
paramName string
index int
Returns
ObjectId
 ParamsAtName(string)
public ObjectIdCollection ParamsAtName(string paramName)
Parameters
paramName string
Returns
ObjectIdCollection
 PostProcessAfterDeepCloneCancelOverride(IdMapping)
public virtual void PostProcessAfterDeepCloneCancelOverride(IdMapping idMap)
Parameters
idMap IdMapping
 PostProcessAfterDeepCloneOverride(IdMapping)
public virtual void PostProcessAfterDeepCloneOverride(IdMapping idMap)
Parameters
idMap IdMapping
 RemoveAllDependencies(bool)
public void RemoveAllDependencies(bool alsoEraseThem)
Parameters
alsoEraseThem bool
 RemoveAllDependenciesOverride(bool)
public virtual void RemoveAllDependenciesOverride(bool alsoEraseThem)
Parameters
alsoEraseThem bool
 RemoveAllParams(bool)
public void RemoveAllParams(bool alsoEraseThem)
Parameters
alsoEraseThem bool
 RemoveDependency(ObjectId, bool)
public void RemoveDependency(ObjectId dependencyId, bool alsoEraseIt)
Parameters
dependencyId ObjectId
alsoEraseIt bool
 RemoveParam(ObjectId, bool)
public void RemoveParam(ObjectId paramId, bool alsoEraseIt)
Parameters
paramId ObjectId
alsoEraseIt bool
 RemoveValueParam(string)
public void RemoveValueParam(string paramName)
Parameters
paramName string
 SetStatus(AssocStatus, bool, bool)
public void SetStatus(AssocStatus newStatus, bool notifyOwningNetwork, bool setInOwnedActions)
Parameters
newStatus AssocStatus
notifyOwningNetwork bool
setInOwnedActions bool
 SetValueParam(string, ValueParam, bool)
public string SetValueParam(string paramName, AssocActionBody.ValueParam param, bool silentMode)
Parameters
paramName string
param AssocActionBody.ValueParam
silentMode bool
Returns
string
 SetValueParam(string, ValueParam, bool, int)
public string SetValueParam(string paramName, AssocActionBody.ValueParam param, bool silentMode, int paramIndex)
Parameters
paramName string
param AssocActionBody.ValueParam
silentMode bool
paramIndex int
Returns
string
 SetValueParamArray(string, ValueParam[], bool)
public string[] SetValueParamArray(string paramName, AssocActionBody.ValueParam[] valueParams, bool silentMode)
Parameters
paramName string
valueParams ValueParam[]
silentMode bool
Returns
string[]
 SetValueParamUnitType(string, UnitType)
public void SetValueParamUnitType(string paramName, UnitType unitType)
Parameters
paramName string
unitType UnitType
 TransformActionByOverride(Matrix3d)
public virtual void TransformActionByOverride(Matrix3d A_0)
Parameters
A_0 Matrix3d
 ValueParamInputVariables(string)
public ObjectIdCollection ValueParamInputVariables(string paramName)
Parameters
paramName string
Returns
ObjectIdCollection
 currentEvaluationCallback()
public AssocEvaluationCallback currentEvaluationCallback()
Returns
AssocEvaluationCallback