Table of Contents
 Class ClipBoundary2d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeClipBoundary2d")]
public sealed class ClipBoundary2d : Entity2d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity2d
ClipBoundary2d
Implements
IDisposable
ICloneable
Inherited Members
 Entity2d.Clone()
 Entity2d.IsEqualTo(Entity2d)
 Entity2d.IsEqualTo(Entity2d, Tolerance)
 Entity2d.TransformBy(Matrix2d)
 Entity2d.TranslateBy(Vector2d)
 Entity2d.RotateBy(double, Point2d)
 Entity2d.Mirror(Line2d)
 Entity2d.ScaleBy(double, Point2d)
 Entity2d.IsOn(Point2d)
 Entity2d.IsOn(Point2d, Tolerance)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ClipBoundary2d()
public ClipBoundary2d()
 ClipBoundary2d(Point2d, Point2d)
public ClipBoundary2d(Point2d firstCorner, Point2d secondCorner)
Parameters
firstCorner Point2d
secondCorner Point2d
 ClipBoundary2d(Point2dCollection)
public ClipBoundary2d(Point2dCollection clipBoundary)
Parameters
clipBoundary Point2dCollection
Methods
 ClipPolygon(Point2dCollection)
public ClipBoundary2dData ClipPolygon(Point2dCollection rawVertices)
Parameters
rawVertices Point2dCollection
Returns
ClipBoundary2dData
 ClipPolyline(Point2dCollection)
public ClipBoundary2dData ClipPolyline(Point2dCollection rawVertices)
Parameters
rawVertices Point2dCollection
Returns
ClipBoundary2dData
 Create(IntPtr, bool)
public static ClipBoundary2d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
ClipBoundary2d
 Set(Point2d, Point2d)
public ClipError Set(Point2d firstCorner, Point2d secondCorner)
Parameters
firstCorner Point2d
secondCorner Point2d
Returns
ClipError
 Set(Point2dCollection)
public ClipError Set(Point2dCollection clipBoundary)
Parameters
clipBoundary Point2dCollection
Returns
ClipError