Table of Contents
 Class AssocVariableCallback
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocVariableCallback")]
public abstract class AssocVariableCallback : IDisposable
Inheritance
object
AssocVariableCallback
Implements
IDisposable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocVariableCallback()
public AssocVariableCallback()
 AssocVariableCallback(AcDbAssocVariableCallback*, bool)
protected AssocVariableCallback(AcDbAssocVariableCallback* unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr AcDbAssocVariableCallback*
autoDelete bool
Methods
 CanBeErased(AssocVariable)
public abstract bool CanBeErased(AssocVariable variable)
Parameters
variable AssocVariable
Returns
bool
 Dispose()
public override sealed void Dispose()
 Dispose(bool)
protected virtual void Dispose(bool A_0)
Parameters
A_0 bool
 ValidateNameAndExpression(AssocVariable, string, string)
public abstract string ValidateNameAndExpression(AssocVariable variable, string nameToValidate, string expressionToValidate)
Parameters
variable AssocVariable
nameToValidate string
expressionToValidate string
Returns
string