Table of Contents
 Class CurveCurveIntersector2d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeCurveCurveInt2d")]
public sealed class CurveCurveIntersector2d : Entity2d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity2d
CurveCurveIntersector2d
Implements
IDisposable
ICloneable
Inherited Members
 Entity2d.Clone()
 Entity2d.IsEqualTo(Entity2d)
 Entity2d.IsEqualTo(Entity2d, Tolerance)
 Entity2d.TransformBy(Matrix2d)
 Entity2d.TranslateBy(Vector2d)
 Entity2d.RotateBy(double, Point2d)
 Entity2d.Mirror(Line2d)
 Entity2d.ScaleBy(double, Point2d)
 Entity2d.IsOn(Point2d)
 Entity2d.IsOn(Point2d, Tolerance)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 CurveCurveIntersector2d()
public CurveCurveIntersector2d()
 CurveCurveIntersector2d(Curve2d, Curve2d)
public CurveCurveIntersector2d(Curve2d curve1, Curve2d curve2)
Parameters
curve1 Curve2d
curve2 Curve2d
 CurveCurveIntersector2d(Curve2d, Curve2d, Interval, Interval)
public CurveCurveIntersector2d(Curve2d curve1, Curve2d curve2, Interval range1, Interval range2)
Parameters
curve1 Curve2d
curve2 Curve2d
range1 Interval
range2 Interval
 CurveCurveIntersector2d(Curve2d, Curve2d, Interval, Interval, Tolerance)
public CurveCurveIntersector2d(Curve2d curve1, Curve2d curve2, Interval range1, Interval range2, Tolerance tolerance)
Parameters
curve1 Curve2d
curve2 Curve2d
range1 Interval
range2 Interval
tolerance Tolerance
 CurveCurveIntersector2d(Curve2d, Curve2d, Tolerance)
public CurveCurveIntersector2d(Curve2d curve1, Curve2d curve2, Tolerance tolerance)
Parameters
curve1 Curve2d
curve2 Curve2d
tolerance Tolerance
Properties
 Curve1
public Curve2d Curve1 { get; }
Property Value
Curve2d
 Curve2
public Curve2d Curve2 { get; }
Property Value
Curve2d
 NumberOfIntersectionPoints
public int NumberOfIntersectionPoints { get; }
Property Value
int
 OverlapCount
public int OverlapCount { get; }
Property Value
int
 OverlapDirection
public bool OverlapDirection { get; }
Property Value
bool
 Tolerance
public Tolerance Tolerance { get; }
Property Value
Tolerance
Methods
 ChangeCurveOrder()
public void ChangeCurveOrder()
 Create(IntPtr, bool)
public static CurveCurveIntersector2d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
CurveCurveIntersector2d
 GetIntersectionParameters(int)
public double[] GetIntersectionParameters(int intersection)
Parameters
intersection int
Returns
double[]
 GetIntersectionPoint(int)
public Point2d GetIntersectionPoint(int number)
Parameters
number int
Returns
Point2d
 GetIntersectionPointTolerance(int)
public double GetIntersectionPointTolerance(int intersection)
Parameters
intersection int
Returns
double
 GetIntersectionRanges()
public Interval[] GetIntersectionRanges()
Returns
Interval[]
 GetOverlapRanges(int)
public Interval[] GetOverlapRanges(int overlapNumber)
Parameters
overlapNumber int
Returns
Interval[]
 GetPointOnCurve1(int)
public PointOnCurve2d GetPointOnCurve1(int intersection)
Parameters
intersection int
Returns
PointOnCurve2d
 GetPointOnCurve2(int)
public PointOnCurve2d GetPointOnCurve2(int intersection)
Parameters
intersection int
Returns
PointOnCurve2d
 IsTangential(int)
public bool IsTangential(int intersection)
Parameters
intersection int
Returns
bool
 IsTransversal(int)
public bool IsTransversal(int intersection)
Parameters
intersection int
Returns
bool
 OrderWithRegardsTo1()
public void OrderWithRegardsTo1()
 OrderWithRegardsTo2()
public void OrderWithRegardsTo2()
 Set(Curve2d, Curve2d)
public void Set(Curve2d curve1, Curve2d curve2)
Parameters
curve1 Curve2d
curve2 Curve2d
 Set(Curve2d, Curve2d, Interval, Interval)
public void Set(Curve2d curve1, Curve2d curve2, Interval range1, Interval range2)
Parameters
curve1 Curve2d
curve2 Curve2d
range1 Interval
range2 Interval
 Set(Curve2d, Curve2d, Interval, Interval, Tolerance)
public void Set(Curve2d curve1, Curve2d curve2, Interval range1, Interval range2, Tolerance tolerance)
Parameters
curve1 Curve2d
curve2 Curve2d
range1 Interval
range2 Interval
tolerance Tolerance
 Set(Curve2d, Curve2d, Tolerance)
public void Set(Curve2d curve1, Curve2d curve2, Tolerance tolerance)
Parameters
curve1 Curve2d
curve2 Curve2d
tolerance Tolerance