Table of Contents
 Enum LeaderDirectionType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMLeaderStyle::LeaderDirectionType")]
public enum LeaderDirectionType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BottomLeader = 4
LeftLeader = 1
RightLeader = 2
TopLeader = 3
UnknownLeader = 0