Table of Contents
 Enum Vertex2dType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::Vertex2dType")]
public enum Vertex2dType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CurveFitVertex = 3
SimpleVertex = 0
SplineControlVertex = 1
SplineFitVertex = 2