Table of Contents
 Enum GridLineType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::GridLineType")]
[Flags]
public enum GridLineType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AllGridLines = HorizontalGridLines | VerticalGridLines
HorizontalBottom = 4
HorizontalGridLines = HorizontalTop | HorizontalInside | HorizontalBottom
HorizontalInside = 2
HorizontalTop = 1
InnerGridLines = HorizontalInside | VerticalInside
InvalidGridLine = 0
OuterGridLines = HorizontalTop | HorizontalBottom | VerticalLeft | VerticalRight
VerticalGridLines = VerticalLeft | VerticalInside | VerticalRight
VerticalInside = 16
VerticalLeft = 8
VerticalRight = 32