Table of Contents
 Class VertexRef
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbVertexRef")]
public class VertexRef : SubentRef, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
GeomRef
SubentRef
VertexRef
Implements
IDisposable
ICloneable
Inherited Members
 SubentRef.CopyFrom(SubentRef)
 SubentRef.CreateEntity()
 SubentRef.SubentId
 SubentRef.Entity
 GeomRef.Reset()
 GeomRef.IsEmpty
 GeomRef.IsValid
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 VertexRef()
public VertexRef()
 VertexRef(CompoundObjectId)
public VertexRef(CompoundObjectId compoundObjectId)
Parameters
compoundObjectId CompoundObjectId
 VertexRef(CompoundObjectId, SubentityId)
public VertexRef(CompoundObjectId compoundObjectId, SubentityId subentId)
Parameters
compoundObjectId CompoundObjectId
subentId SubentityId
 VertexRef(CompoundObjectId, SubentityId, Point3d)
public VertexRef(CompoundObjectId compoundObjectId, SubentityId subentId, Point3d point)
Parameters
compoundObjectId CompoundObjectId
subentId SubentityId
point Point3d
 VertexRef(Entity)
public VertexRef(Entity entity)
Parameters
entity Entity
 VertexRef(FullSubentityPath)
public VertexRef(FullSubentityPath path)
Parameters
path FullSubentityPath
 VertexRef(Point3d)
public VertexRef(Point3d point)
Parameters
point Point3d
 VertexRef(IntPtr, bool)
protected VertexRef(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 Point
public Point3d Point { get; }
Property Value
Point3d