Table of Contents
 Class AugmentedPolylineCurve3d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeAugPolyline3d")]
public sealed class AugmentedPolylineCurve3d : PolylineCurve3d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
Curve3d
SplineEntity3d
PolylineCurve3d
AugmentedPolylineCurve3d
Implements
IDisposable
ICloneable
Inherited Members
 PolylineCurve3d.FitPointAt(int)
 PolylineCurve3d.SetFitPointAt(int, Point3d)
 PolylineCurve3d.NumberOfFitPoints
 SplineEntity3d.GetContinuityAtKnot(int)
 SplineEntity3d.GetContinuityAtKnot(int, Tolerance)
 SplineEntity3d.KnotAt(int)
 SplineEntity3d.SetKnotAt(int, double)
 SplineEntity3d.ControlPointAt(int)
 SplineEntity3d.SetControlPointAt(int, Point3d)
 SplineEntity3d.HasFitData
 SplineEntity3d.EndPoint
 SplineEntity3d.StartPoint
 SplineEntity3d.EndParameter
 SplineEntity3d.StartParameter
 SplineEntity3d.NumberOfControlPoints
 SplineEntity3d.Knots
 SplineEntity3d.NumberOfKnots
 SplineEntity3d.Order
 SplineEntity3d.Degree
 SplineEntity3d.IsRational
 Curve3d.GetInterval()
 Curve3d.SetInterval(Interval)
 Curve3d.GetReverseParameterCurve()
 Curve3d.GetDistanceTo(Curve3d)
 Curve3d.GetDistanceTo(Curve3d, Tolerance)
 Curve3d.GetDistanceTo(Point3d)
 Curve3d.GetDistanceTo(Point3d, Tolerance)
 Curve3d.GetClosestPointTo(Curve3d)
 Curve3d.GetClosestPointTo(Curve3d, Tolerance)
 Curve3d.GetClosestPointTo(Point3d)
 Curve3d.GetClosestPointTo(Point3d, Tolerance)
 Curve3d.GetProjectedClosestPointTo(Curve3d, Vector3d)
 Curve3d.GetProjectedClosestPointTo(Curve3d, Vector3d, Tolerance)
 Curve3d.GetProjectedClosestPointTo(Point3d, Vector3d)
 Curve3d.GetProjectedClosestPointTo(Point3d, Vector3d, Tolerance)
 Curve3d.GetNormalPoint(Point3d)
 Curve3d.GetNormalPoint(Point3d, Tolerance)
 Curve3d.GetBoundBlockOf(Interval)
 Curve3d.GetOrthoBoundBlockOf(Interval)
 Curve3d.GetProjectedEntity(Plane, Vector3d)
 Curve3d.GetProjectedEntity(Plane, Vector3d, Tolerance)
 Curve3d.GetOrthoProjectEntity(Plane)
 Curve3d.GetOrthoProjectEntity(Plane, Tolerance)
 Curve3d.IsOn(double)
 Curve3d.IsOn(double, Tolerance)
 Curve3d.IsOn(Point3d, out double)
 Curve3d.IsOn(Point3d, out double, Tolerance)
 Curve3d.IsOn(Point3d)
 Curve3d.IsOn(Point3d, Tolerance)
 Curve3d.GetParameterOf(Point3d)
 Curve3d.GetParameterOf(Point3d, Tolerance)
 Curve3d.GetTrimmedOffset(double, Vector3d, OffsetCurveExtensionType)
 Curve3d.GetTrimmedOffset(double, Vector3d, OffsetCurveExtensionType, Tolerance)
 Curve3d.IsClosed()
 Curve3d.IsClosed(Tolerance)
 Curve3d.IsPlanar(out Plane)
 Curve3d.IsPlanar(out Plane, Tolerance)
 Curve3d.IsLinear(out Line3d)
 Curve3d.IsLinear(out Line3d, Tolerance)
 Curve3d.IsCoplanarWith(Curve3d, out Plane)
 Curve3d.IsCoplanarWith(Curve3d, out Plane, Tolerance)
 Curve3d.IsPeriodic(out double)
 Curve3d.IsDegenerate(out Entity3d)
 Curve3d.IsDegenerate(out Entity3d, Tolerance)
 Curve3d.GetLength(double, double, double)
 Curve3d.GetParameterAtLength(double, double, bool, double)
 Curve3d.GetArea(double, double)
 Curve3d.GetArea(double, double, Tolerance)
 Curve3d.GetSplitCurves(double)
 Curve3d.Explode(Interval)
 Curve3d.EvaluatePoint(double)
 Curve3d.GetSamplePoints(int)
 Curve3d.GetSamplePoints(double, double, double)
 Curve3d.GetNewSamplePoints(double, double, double)
 Curve3d.HasEndPoint
 Curve3d.HasStartPoint
 Curve3d.OrthoBoundBlock
 Curve3d.BoundBlock
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AugmentedPolylineCurve3d()
public AugmentedPolylineCurve3d()
 AugmentedPolylineCurve3d(Curve3d, double, double, double)
public AugmentedPolylineCurve3d(Curve3d curve, double fromParameter, double toParameter, double eps)
Parameters
curve Curve3d
fromParameter double
toParameter double
eps double
 AugmentedPolylineCurve3d(KnotCollection, Point3dCollection, Vector3dCollection)
public AugmentedPolylineCurve3d(KnotCollection knots, Point3dCollection controlPoints, Vector3dCollection vectorBundle)
Parameters
knots KnotCollection
controlPoints Point3dCollection
vectorBundle Vector3dCollection
 AugmentedPolylineCurve3d(Point3dCollection, Vector3dCollection)
public AugmentedPolylineCurve3d(Point3dCollection controlPoints, Vector3dCollection vectorBundle)
Parameters
controlPoints Point3dCollection
vectorBundle Vector3dCollection
 AugmentedPolylineCurve3d(IntPtr, bool)
protected AugmentedPolylineCurve3d(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 ApproximateTolerance
public double ApproximateTolerance { get; set; }
Property Value
double
 D1Vectors
public Vector3dCollection D1Vectors { get; }
Property Value
Vector3dCollection
 D2Vectors
public Vector3dCollection D2Vectors { get; }
Property Value
Vector3dCollection
 Points
public Point3dCollection Points { get; }
Property Value
Point3dCollection
Methods
 Create(IntPtr, bool)
public static AugmentedPolylineCurve3d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
AugmentedPolylineCurve3d
 GetD2VectorAt(int)
public Vector3d GetD2VectorAt(int index)
Parameters
index int
Returns
Vector3d
 GetPointAt(int)
public Point3d GetPointAt(int index)
Parameters
index int
Returns
Point3d
 GetVectorAt(int)
public Vector3d GetVectorAt(int index)
Parameters
index int
Returns
Vector3d
 SetD2VectorAt(int, Vector3d)
public void SetD2VectorAt(int index, Vector3d point)
Parameters
index int
point Vector3d
 SetPointAt(int, Point3d)
public void SetPointAt(int index, Point3d point)
Parameters
index int
point Point3d
 SetVectorAt(int, Vector3d)
public void SetVectorAt(int index, Vector3d point)
Parameters
index int
point Vector3d