Table of Contents
 Class BlockTableRecordEnumerator
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbBlockTableRecordIterator")]
public sealed class BlockTableRecordEnumerator : DisposableWrapper, IDisposable, IEnumerator
Inheritance
object
MarshalByRefObject
DisposableWrapper
BlockTableRecordEnumerator
Implements
IDisposable
IEnumerator
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 BlockTableRecordEnumerator(IntPtr, bool, bool)
protected BlockTableRecordEnumerator(IntPtr unmanagedPointer, bool autoDelete, bool skipDeleted)
Parameters
unmanagedPointer IntPtr
autoDelete bool
skipDeleted bool
Properties
 Current
public ObjectId Current { get; }
Property Value
ObjectId
Methods
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 MoveNext()
public bool MoveNext()
Returns
bool
 Reset()
public void Reset()