Table of Contents
 Class EdgeRef
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbEdgeRef")]
public class EdgeRef : SubentRef, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
GeomRef
SubentRef
EdgeRef
Implements
IDisposable
ICloneable
Inherited Members
 SubentRef.CopyFrom(SubentRef)
 SubentRef.CreateEntity()
 SubentRef.SubentId
 SubentRef.Entity
 GeomRef.Reset()
 GeomRef.IsEmpty
 GeomRef.IsValid
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 EdgeRef()
public EdgeRef()
 EdgeRef(CompoundObjectId)
public EdgeRef(CompoundObjectId compoundObjectId)
Parameters
compoundObjectId CompoundObjectId
 EdgeRef(CompoundObjectId, SubentityId)
public EdgeRef(CompoundObjectId compoundObjectId, SubentityId edgeSubentId)
Parameters
compoundObjectId CompoundObjectId
edgeSubentId SubentityId
 EdgeRef(CompoundObjectId, SubentityId, SubentityId)
public EdgeRef(CompoundObjectId compoundObjectId, SubentityId edgeSubentId, SubentityId faceSubentId)
Parameters
compoundObjectId CompoundObjectId
edgeSubentId SubentityId
faceSubentId SubentityId
 EdgeRef(CompoundObjectId, SubentityId, SubentityId, Curve3d)
public EdgeRef(CompoundObjectId compoundObjectId, SubentityId edgeSubentId, SubentityId faceSubentId, Curve3d curve)
Parameters
compoundObjectId CompoundObjectId
edgeSubentId SubentityId
faceSubentId SubentityId
curve Curve3d
 EdgeRef(Entity)
public EdgeRef(Entity entity)
Parameters
entity Entity
 EdgeRef(FullSubentityPath)
public EdgeRef(FullSubentityPath path)
Parameters
path FullSubentityPath
 EdgeRef(Curve3d)
public EdgeRef(Curve3d curve)
Parameters
curve Curve3d
 EdgeRef(IntPtr, bool)
protected EdgeRef(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 Curve
public Curve3d Curve { get; }
Property Value
Curve3d
 FaceSubentity
public SubentityId FaceSubentity { get; set; }
Property Value
SubentityId