Table of Contents
 Struct MeshPointMap
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct MeshPointMap
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 MeshPointMap(Point2d, Point2d)
public MeshPointMap(Point2d sourcePt, Point2d destPt)
Parameters
sourcePt Point2d
destPt Point2d
Properties
 DestPoint
public Point2d DestPoint { get; set; }
Property Value
Point2d
 SourcePoint
public Point2d SourcePoint { get; set; }
Property Value
Point2d