Table of Contents
 Enum TableCellType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[TypeConverter(typeof(EnumConverter))]
[Wrapper("AcDb::CellType")]
public enum TableCellType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BlockCell = 2
MultipleContentCell = 3
TextCell = 1
UnknownCell = 0