Table of Contents
 Enum OffsetCurveExtensionType
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public enum OffsetCurveExtensionType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Chamfer = 1
Extend = 2
Fillet = 0