Table of Contents
 Class Point2dCollection
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGePoint2dArray")]
public class Point2dCollection : IList, ICollection, IEnumerable
Inheritance
object
Point2dCollection
Implements
IList
ICollection
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Point2dCollection()
public Point2dCollection()
 Point2dCollection(Point2d[])
public Point2dCollection(Point2d[] values)
Parameters
values Point2d[]
 Point2dCollection(int)
public Point2dCollection(int capacity)
Parameters
capacity int
Fields
 DefaultSize
public const int DefaultSize = 10
Field Value
int
Properties
 Capacity
public virtual int Capacity { get; set; }
Property Value
int
 Count
public virtual int Count { get; }
Property Value
int
 IsFixedSize
public virtual bool IsFixedSize { get; }
Property Value
bool
 IsReadOnly
public virtual bool IsReadOnly { get; }
Property Value
bool
 IsSynchronized
public virtual bool IsSynchronized { get; }
Property Value
bool
 this[int]
public virtual Point2d this[int index] { get; set; }
Parameters
index int
Property Value
Point2d
 SyncRoot
public virtual object SyncRoot { get; }
Property Value
object
Methods
 Add(Point2d)
public virtual int Add(Point2d value)
Parameters
value Point2d
Returns
int
 AddRange(Point2d[])
public virtual void AddRange(Point2d[] range)
Parameters
range Point2d[]
 Clear()
public virtual void Clear()
 Contains(Point2d)
public virtual bool Contains(Point2d value)
Parameters
value Point2d
Returns
bool
 CopyTo(Point2d[], int)
public virtual void CopyTo(Point2d[] array, int index)
Parameters
array Point2d[]
index int
 GetEnumerator()
public virtual Point2dCollectionEnumerator GetEnumerator()
Returns
Point2dCollectionEnumerator
 IndexOf(Point2d)
public virtual int IndexOf(Point2d value)
Parameters
value Point2d
Returns
int
 Insert(int, Point2d)
public virtual void Insert(int index, Point2d value)
Parameters
index int
value Point2d
 Remove(Point2d)
public virtual void Remove(Point2d value)
Parameters
value Point2d
 RemoveAt(int)
public virtual void RemoveAt(int index)
Parameters
index int
 ToArray()
public virtual Point2d[] ToArray()
Returns
Point2d[]
 TrimToSize()
public virtual void TrimToSize()