Table of Contents
 Class VisualStyle
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiVisualStyle")]
public class VisualStyle : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
VisualStyle
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 VisualStyle()
public VisualStyle()
 VisualStyle(VisualStyleType)
public VisualStyle(VisualStyleType type)
Parameters
type VisualStyleType
 VisualStyle(IntPtr, bool)
protected VisualStyle(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 Type
public VisualStyleType Type { get; set; }
Property Value
VisualStyleType
Methods
 GetPropertyType(VisualStyleProperty)
public VariantType GetPropertyType(VisualStyleProperty prop)
Parameters
prop VisualStyleProperty
Returns
VariantType
 GetTrait(VisualStyleProperty)
public object GetTrait(VisualStyleProperty prop)
Parameters
prop VisualStyleProperty
Returns
object
 GetTraitFlag(VisualStyleProperty, uint)
public bool GetTraitFlag(VisualStyleProperty prop, uint flagVal)
Parameters
prop VisualStyleProperty
flagVal uint
Returns
bool
 Operation(VisualStyleProperty)
public VisualStyleOperation Operation(VisualStyleProperty prop)
Parameters
prop VisualStyleProperty
Returns
VisualStyleOperation
 SetTrait(VisualStyleProperty, Color, VisualStyleOperation)
public void SetTrait(VisualStyleProperty prop, Color color, VisualStyleOperation op)
Parameters
prop VisualStyleProperty
color Color
op VisualStyleOperation
 SetTrait(VisualStyleProperty, VisualStyleOperation)
public void SetTrait(VisualStyleProperty prop, VisualStyleOperation op)
Parameters
prop VisualStyleProperty
op VisualStyleOperation
 SetTrait(VisualStyleProperty, bool, VisualStyleOperation)
public void SetTrait(VisualStyleProperty prop, bool bVal, VisualStyleOperation __unnamed002)
Parameters
prop VisualStyleProperty
bVal bool
__unnamed002 VisualStyleOperation
 SetTrait(VisualStyleProperty, double, VisualStyleOperation)
public void SetTrait(VisualStyleProperty prop, double dVal, VisualStyleOperation op)
Parameters
prop VisualStyleProperty
dVal double
op VisualStyleOperation
 SetTrait(VisualStyleProperty, double, double, double, VisualStyleOperation)
public void SetTrait(VisualStyleProperty prop, double red, double green, double blue, VisualStyleOperation op)
Parameters
prop VisualStyleProperty
red double
green double
blue double
op VisualStyleOperation
 SetTrait(VisualStyleProperty, int, VisualStyleOperation)
public void SetTrait(VisualStyleProperty prop, int nVal, VisualStyleOperation op)
Parameters
prop VisualStyleProperty
nVal int
op VisualStyleOperation
 SetTrait(VisualStyleProperty, object, VisualStyleOperation)
public void SetTrait(VisualStyleProperty prop, object val, VisualStyleOperation op)
Parameters
prop VisualStyleProperty
val object
op VisualStyleOperation
 SetTraitFlag(VisualStyleProperty, uint, bool)
public void SetTraitFlag(VisualStyleProperty prop, uint flagVal, bool bEnable)
Parameters
prop VisualStyleProperty
flagVal uint
bEnable bool