Table of Contents
 Struct MeshPointMaps
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct MeshPointMaps
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 MeshPointMaps(Point2dCollection, Point2dCollection)
public MeshPointMaps(Point2dCollection sourcePts, Point2dCollection destPts)
Parameters
sourcePts Point2dCollection
destPts Point2dCollection
Properties
 DestPonints
public Point2dCollection DestPonints { get; set; }
Property Value
Point2dCollection
 SourcePonints
public Point2dCollection SourcePonints { get; set; }
Property Value
Point2dCollection