Table of Contents
 Enum MTextFragmentCallbackStatus
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum MTextFragmentCallbackStatus
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Continue = 1
Terminate = 0