Table of Contents
 Class Point3dCollection
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGePoint3dArray")]
public sealed class Point3dCollection : DisposableWrapper, IDisposable, IList, ICollection, IEnumerable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Point3dCollection
Implements
IDisposable
IList
ICollection
IEnumerable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Point3dCollection()
public Point3dCollection()
 Point3dCollection(Point3d[])
public Point3dCollection(Point3d[] values)
Parameters
values Point3d[]
Properties
 Count
public int Count { get; }
Property Value
int
 this[int]
public Point3d this[int index] { get; set; }
Parameters
index int
Property Value
Point3d
Methods
 Add(Point3d)
public int Add(Point3d value)
Parameters
value Point3d
Returns
int
 Clear()
public void Clear()
 Contains(Point3d)
public bool Contains(Point3d value)
Parameters
value Point3d
Returns
bool
 CopyTo(Point3d[], int)
public void CopyTo(Point3d[] array, int index)
Parameters
array Point3d[]
index int
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 GetEnumerator()
public IEnumerator GetEnumerator()
Returns
IEnumerator
 IndexOf(Point3d)
public int IndexOf(Point3d value)
Parameters
value Point3d
Returns
int
 Insert(int, Point3d)
public void Insert(int index, Point3d value)
Parameters
index int
value Point3d
 Remove(Point3d)
public void Remove(Point3d value)
Parameters
value Point3d
 RemoveAt(int)
public void RemoveAt(int index)
Parameters
index int