Table of Contents
 Enum TextAttachmentDirection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMLeaderStyle::TextAttachmentDirection")]
public enum TextAttachmentDirection
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AttachmentHorizontal = 0
AttachmentVertical = 1