Table of Contents
 Delegate ObjectDiffEventHandler
Namespace
Autodesk.AutoCAD.DatabaseServices.Internal
Assembly
Acdbmgd.dll
public delegate void ObjectDiffEventHandler(object sender, ObjectDiffEventArgs e)
Parameters
sender object
e ObjectDiffEventArgs
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ObjectDiffEventHandler(object, IntPtr)
public ObjectDiffEventHandler(object A_0, IntPtr A_1)
Parameters
A_0 object
A_1 IntPtr
Methods
 BeginInvoke(object, ObjectDiffEventArgs, AsyncCallback, object)
public IAsyncResult BeginInvoke(object sender, ObjectDiffEventArgs e, AsyncCallback callback, object obj)
Parameters
sender object
e ObjectDiffEventArgs
callback AsyncCallback
obj object
Returns
IAsyncResult
 EndInvoke(IAsyncResult)
public void EndInvoke(IAsyncResult result)
Parameters
result IAsyncResult
 Invoke(object, ObjectDiffEventArgs)
public void Invoke(object sender, ObjectDiffEventArgs e)
Parameters
sender object
e ObjectDiffEventArgs