Table of Contents
 Enum DefaultLightingType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcGiViewportTraits::DefaultLightingType")]
public enum DefaultLightingType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
OneDistantLight = 0
TwoDistantLights = 1