Table of Contents
 Enum EntityVisualStyleType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbEntity::VisualStyleType")]
public enum EntityVisualStyleType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
EdgeVisualStyle = 2
FaceVisualStyle = 1
FullVisualStyle = 0