Table of Contents
 Struct PCAdsName
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct PCAdsName
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
 name1
public long name1
Field Value
long
 name2
public long name2
Field Value
long