Table of Contents
 Enum GripStatus
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::GripStatus")]
public enum GripStatus
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
DimDataToBeDeleted = 2
GripsDone = 0
GripsToBeDeleted = 1