Table of Contents
 Struct CurveBoundaryData
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public struct CurveBoundaryData
Inherited Members
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Properties
 Orientation2d
public bool Orientation2d { get; }
Property Value
bool
 Orientation3d
public bool Orientation3d { get; }
Property Value
bool
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetCurve2ds()
public Curve2d[] GetCurve2ds()
Returns
Curve2d[]
 GetCurve3ds()
public Entity3d[] GetCurve3ds()
Returns
Entity3d[]
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 IsEqualTo(CurveBoundaryData)
public bool IsEqualTo(CurveBoundaryData a)
Parameters
a CurveBoundaryData
Returns
bool
Operators
 operator ==(CurveBoundaryData, CurveBoundaryData)
public static bool operator ==(CurveBoundaryData a, CurveBoundaryData b)
Parameters
a CurveBoundaryData
b CurveBoundaryData
Returns
bool
 operator !=(CurveBoundaryData, CurveBoundaryData)
public static bool operator !=(CurveBoundaryData a, CurveBoundaryData b)
Parameters
a CurveBoundaryData
b CurveBoundaryData
Returns
bool