Table of Contents
 Enum ErrorCondition
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGe::ErrorCondition")]
public enum ErrorCondition
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Arg1 = 2
Arg1InsideThis = 11
Arg1OnThis = 10
Arg1TooBig = 9
Arg2 = 3
EqualArg1Arg2 = 5
EqualArg1Arg3 = 6
EqualArg2Arg3 = 7
LinearlyDependentArg1Arg2Arg3 = 8
OK = 0
PerpendicularArg1Arg2 = 4
This = 1