Table of Contents
 Enum AutoTransform
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiMapper::AutoTransform")]
public enum AutoTransform
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
InheritAutoTransform = 0
Model = 4
None = 1
TransformObject = 2