Table of Contents
 Class SymbolUtilityServices
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbSymUtilServices")]
public sealed class SymbolUtilityServices
Inheritance
object
SymbolUtilityServices
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 SymbolUtilityServices()
public SymbolUtilityServices()
Properties
 BlockModelSpaceName
public static string BlockModelSpaceName { get; }
Property Value
string
 BlockPaperSpaceName
public static string BlockPaperSpaceName { get; }
Property Value
string
 LayerDefpointsName
public static string LayerDefpointsName { get; }
Property Value
string
 LayerZeroName
public static string LayerZeroName { get; }
Property Value
string
 LinetypeByBlockName
public static string LinetypeByBlockName { get; }
Property Value
string
 LinetypeByLayerName
public static string LinetypeByLayerName { get; }
Property Value
string
 LinetypeContinuousName
public static string LinetypeContinuousName { get; }
Property Value
string
 RegAppAcadName
public static string RegAppAcadName { get; }
Property Value
string
 TextStyleStandardName
public static string TextStyleStandardName { get; }
Property Value
string
 ViewportActiveName
public static string ViewportActiveName { get; }
Property Value
string
Methods
 GetBlockModelSpaceId(Database)
public static ObjectId GetBlockModelSpaceId(Database databasePointer)
Parameters
databasePointer Database
Returns
ObjectId
 GetBlockNameFromInsertPathName(string)
public static string GetBlockNameFromInsertPathName(string pathName)
Parameters
pathName string
Returns
string
 GetBlockPaperSpaceId(Database)
public static ObjectId GetBlockPaperSpaceId(Database databasePointer)
Parameters
databasePointer Database
Returns
ObjectId
 GetInsertPathNameFromBlockName(string)
public static string GetInsertPathNameFromBlockName(string blockName)
Parameters
blockName string
Returns
string
 GetLayerDefpointsId(Database)
public static ObjectId GetLayerDefpointsId(Database database)
Parameters
database Database
Returns
ObjectId
 GetLayerZeroId(Database)
public static ObjectId GetLayerZeroId(Database database)
Parameters
database Database
Returns
ObjectId
 GetLinetypeByBlockId(Database)
public static ObjectId GetLinetypeByBlockId(Database databasePointer)
Parameters
databasePointer Database
Returns
ObjectId
 GetLinetypeByLayerId(Database)
public static ObjectId GetLinetypeByLayerId(Database databasePointer)
Parameters
databasePointer Database
Returns
ObjectId
 GetLinetypeContinuousId(Database)
public static ObjectId GetLinetypeContinuousId(Database databasePointer)
Parameters
databasePointer Database
Returns
ObjectId
 GetMaxSymbolNameLength(bool, bool)
public static int GetMaxSymbolNameLength(bool isNewName, bool compatibilityMode)
Parameters
isNewName bool
compatibilityMode bool
Returns
int
 GetPathNameFromSymbolName(string, string)
public static string GetPathNameFromSymbolName(string symbolName, string extensions)
Parameters
symbolName string
extensions string
Returns
string
 GetRegAppAcadId(Database)
public static ObjectId GetRegAppAcadId(Database databasePointer)
Parameters
databasePointer Database
Returns
ObjectId
 GetSymbolNameFromPathName(string, string)
public static string GetSymbolNameFromPathName(string pathName, string extensions)
Parameters
pathName string
extensions string
Returns
string
 GetTextStyleStandardId(Database)
public static ObjectId GetTextStyleStandardId(Database databasePointer)
Parameters
databasePointer Database
Returns
ObjectId
 IsBlockLayoutName(string)
public static bool IsBlockLayoutName(string name)
Parameters
name string
Returns
bool
 IsBlockModelSpaceName(string)
public static bool IsBlockModelSpaceName(string name)
Parameters
name string
Returns
bool
 IsBlockPaperSpaceName(string)
public static bool IsBlockPaperSpaceName(string name)
Parameters
name string
Returns
bool
 IsCompatibilityMode(Database)
public static bool IsCompatibilityMode(Database database)
Parameters
database Database
Returns
bool
 IsLayerDefpointsName(string)
public static bool IsLayerDefpointsName(string name)
Parameters
name string
Returns
bool
 IsLayerZeroName(string)
public static bool IsLayerZeroName(string name)
Parameters
name string
Returns
bool
 IsLinetypeByBlockName(string)
public static bool IsLinetypeByBlockName(string name)
Parameters
name string
Returns
bool
 IsLinetypeByLayerName(string)
public static bool IsLinetypeByLayerName(string name)
Parameters
name string
Returns
bool
 IsLinetypeContinuousName(string)
public static bool IsLinetypeContinuousName(string name)
Parameters
name string
Returns
bool
 IsRegAppAcadName(string)
public static bool IsRegAppAcadName(string name)
Parameters
name string
Returns
bool
 IsTextStyleStandardName(string)
public static bool IsTextStyleStandardName(string name)
Parameters
name string
Returns
bool
 IsViewportActiveName(string)
public static bool IsViewportActiveName(string name)
Parameters
name string
Returns
bool
 MakeDependentName(string, string)
public static string MakeDependentName(string dwgName, string symbolName)
Parameters
dwgName string
symbolName string
Returns
string
 PreValidateSymbolName(string, bool)
public static string PreValidateSymbolName(string symbolName, bool preserveCase)
Parameters
symbolName string
preserveCase bool
Returns
string
 RepairPreExtendedSymbolName(string, bool)
public static string RepairPreExtendedSymbolName(string oldName, bool allowVerticalBar)
Parameters
oldName string
allowVerticalBar bool
Returns
string
 RepairSymbolName(string, bool)
public static string RepairSymbolName(string oldName, bool allowVerticalBar)
Parameters
oldName string
allowVerticalBar bool
Returns
string
 ValidateCompatibleSymbolName(string, bool, bool, bool)
public static ErrorStatus ValidateCompatibleSymbolName(string name, bool isNewName, bool allowVerticalBar, bool compatibilityMode)
Parameters
name string
isNewName bool
allowVerticalBar bool
compatibilityMode bool
Returns
ErrorStatus
 ValidatePreExtendedSymbolName(string, bool)
public static void ValidatePreExtendedSymbolName(string name, bool allowVerticalBar)
Parameters
name string
allowVerticalBar bool
 ValidateSymbolName(string, bool)
public static void ValidateSymbolName(string name, bool allowVerticalBar)
Parameters
name string
allowVerticalBar bool