Table of Contents
 Enum DwgVersion
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::AcDbDwgVersion ")]
public enum DwgVersion
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AC1001 = 8
AC1002 = 9
AC1003 = 10
AC1004 = 11
AC1005 = 12
AC1006 = 13
AC1007 = 14
AC1008 = 15
AC1009 = 16
AC1010 = 17
AC1011 = 18
AC1012 = 19
AC1013 = 20
AC1014 = 21
AC1015 = 23
AC1021 = 27
AC1024 = 29
AC1027 = 31
AC1500 = 22
AC1800 = 25
AC1800a = 24
AC1To2 = 1
AC1To40 = 2
AC1To50 = 3
AC2100a = 26
AC2400a = 28
AC2700a = 30
AC2To10 = 5
AC2To20 = 4
AC2To21 = 6
AC2To22 = 7
Current = 31
MC0To0 = 0
Max = 32767
Newest = 31
Unknown = 32766