Table of Contents
 Enum PlotStyleNameType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::PlotStyleNameType")]
public enum PlotStyleNameType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
PlotStyleNameByBlock = 1
PlotStyleNameById = 3
PlotStyleNameByLayer = 0
PlotStyleNameIsDictionaryDefault = 2