Table of Contents
 Enum AngularConstraint.AngularSectorType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum AngularConstraint.AngularSectorType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AntiParallelAntiClockwise = 3
AntiParallelClockwise = 1
ParallelAntiClockwise = 0
ParallelClockwise = 2