Table of Contents
 Enum KnotParameterizationEnum
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public enum KnotParameterizationEnum
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Chord = 0
CustomParameterization = 15
NotDefinedParameterization = 16
SqrtChord = 1
Uniform = 2