Table of Contents
 Class Profile3d
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb3dProfile")]
public class Profile3d : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Profile3d
Implements
IDisposable
ICloneable
Derived
LoftProfile
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Profile3d()
public Profile3d()
 Profile3d(Entity)
public Profile3d(Entity entity)
Parameters
entity Entity
 Profile3d(FullSubentityPath)
public Profile3d(FullSubentityPath faceSubentPath)
Parameters
faceSubentPath FullSubentityPath
 Profile3d(PathRef)
public Profile3d(PathRef pathRef)
Parameters
pathRef PathRef
 Profile3d(Profile3d)
public Profile3d(Profile3d profile3d)
Parameters
profile3d Profile3d
 Profile3d(VertexRef)
public Profile3d(VertexRef vertexRef)
Parameters
vertexRef VertexRef
Properties
 Entity
public Entity Entity { get; set; }
Property Value
Entity
 IsClosed
public bool IsClosed { get; }
Property Value
bool
 IsEdge
public bool IsEdge { get; }
Property Value
bool
 IsFace
public bool IsFace { get; }
Property Value
bool
 IsPlanar
public bool IsPlanar { get; }
Property Value
bool
 IsSubent
public bool IsSubent { get; }
Property Value
bool
 IsValid
public bool IsValid { get; }
Property Value
bool
 ProfilePathRef
public PathRef ProfilePathRef { get; set; }
Property Value
PathRef
 ProfileVertexRef
public VertexRef ProfileVertexRef { get; set; }
Property Value
VertexRef
Methods
 ConvertProfile(PathRef[])
public static Profile3d ConvertProfile(PathRef[] pathRefArray)
Parameters
pathRefArray PathRef[]
Returns
Profile3d
 ConvertProfile(bool, bool, bool, bool)
public Profile3d[] ConvertProfile(bool explodeMultiFaceRegions, bool convertSurfaceToEdges, bool nonPlanarOnly, bool outerLoopOnly)
Parameters
explodeMultiFaceRegions bool
convertSurfaceToEdges bool
nonPlanarOnly bool
outerLoopOnly bool
Returns
Profile3d[]
 CopyFrom(Profile3d)
public void CopyFrom(Profile3d source)
Parameters
source Profile3d
 MergeProfiles(Profile3d[], bool, bool)
public static Profile3d[] MergeProfiles(Profile3d[] profiles, bool mergeEdges, bool mergeCurves)
Parameters
profiles Profile3d[]
mergeEdges bool
mergeCurves bool
Returns
Profile3d[]