Table of Contents
 Enum UnitType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcValue::UnitType")]
public enum UnitType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Angle = 2
AngleNotTransformed = 65536
Area = 4
Currency = 16
Distance = 1
Percentage = 32
Unitless = 0
Volume = 8