Table of Contents
 Enum ColumnType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMText::ColumnType")]
public enum ColumnType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
DynamicColumns = 2
NoColumns = 0
StaticColumns = 1