Table of Contents
 Class Utilities
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public class Utilities
Inheritance
object
Utilities
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Utilities()
public Utilities()
Methods
 GetErrorStatus(ErrorStatus)
public static string GetErrorStatus(ErrorStatus eStatus)
Parameters
eStatus ErrorStatus
Returns
string
 GetReservedString(ReservedStringEnumType, bool)
public static string GetReservedString(ReservedStringEnumType reservedType, bool bGetLocalized)
Parameters
reservedType ReservedStringEnumType
bGetLocalized bool
Returns
string
 RegRedirectEnumKeys(string, KeyHandler)
public static bool RegRedirectEnumKeys(string subPath, KeyHandler handler)
Parameters
subPath string
handler KeyHandler
Returns
bool
 RegRedirectOpenKey(string, bool)
public static RegistryKey RegRedirectOpenKey(string subPath, bool writable)
Parameters
subPath string
writable bool
Returns
RegistryKey
 TranslateReservedString(string)
public static string TranslateReservedString(string pGlobalName)
Parameters
pGlobalName string
Returns
string