Table of Contents
 Enum TransparencyMode
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiGeometry::TransparencyMode")]
public enum TransparencyMode
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Transparency1Bit = 1
Transparency8Bit = 2
TransparencyOff = 0