Table of Contents
 Delegate ObjectErasedEventHandler
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public delegate void ObjectErasedEventHandler(object sender, ObjectErasedEventArgs e)
Parameters
sender object
e ObjectErasedEventArgs
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ObjectErasedEventHandler(object, IntPtr)
public ObjectErasedEventHandler(object A_0, IntPtr A_1)
Parameters
A_0 object
A_1 IntPtr
Methods
 BeginInvoke(object, ObjectErasedEventArgs, AsyncCallback, object)
public IAsyncResult BeginInvoke(object sender, ObjectErasedEventArgs e, AsyncCallback callback, object obj)
Parameters
sender object
e ObjectErasedEventArgs
callback AsyncCallback
obj object
Returns
IAsyncResult
 EndInvoke(IAsyncResult)
public void EndInvoke(IAsyncResult result)
Parameters
result IAsyncResult
 Invoke(object, ObjectErasedEventArgs)
public void Invoke(object sender, ObjectErasedEventArgs e)
Parameters
sender object
e ObjectErasedEventArgs