Table of Contents
 Enum BlockConnectionType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMLeaderStyle::BlockConnectionType")]
public enum BlockConnectionType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ConnectBase = 1
ConnectExtents = 0