Table of Contents
 Class AssocDimDependencyBody
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocDimDependencyBody")]
public class AssocDimDependencyBody : AssocDimDependencyBodyBase, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
AssocDependencyBody
AssocDimDependencyBodyBase
AssocDimDependencyBody
Implements
IDisposable
ICloneable
Inherited Members
 AssocDimDependencyBodyBase.Constraint()
 AssocDimDependencyBodyBase.GetSubentityGeoms(Vector3d)
 AssocDimDependencyBodyBase.GetVariableNameAndExpression(ref string, ref string, string)
 AssocDimDependencyBodyBase.GetEntityNameAndExpression(ref string, ref string)
 AssocDimDependencyBodyBase.SetVariableNameAndExpression(string, string)
 AssocDimDependencyBodyBase.SetEntityNameAndExpression(string, string, string)
 AssocDimDependencyBodyBase.SetNameAndExpression(string, string)
 AssocDimDependencyBodyBase.ValidateEntityText(string)
 AssocDimDependencyBodyBase.ComposeEntityText(int)
 AssocDimDependencyBodyBase.SetVariableValueToMeasuredValue()
 AssocDimDependencyBodyBase.DeactivateConstraint()
 AssocDimDependencyBodyBase.ReactivateConstraint()
 AssocDimDependencyBodyBase.GetNameAndExpressionFromEntityText(string, bool, double, bool, ref string, ref string)
 AssocDimDependencyBodyBase.DragStatus(DragStatus)
 AssocDimDependencyBodyBase.GetFromEntity(ObjectId)
 AssocDimDependencyBodyBase.EntityAttachmentPointMoved(SubentityGeometry[], double)
 AssocDimDependencyBodyBase.EvaluateOverride()
 AssocDimDependencyBodyBase.ModifiedOverride(DBObject)
 AssocDimDependencyBodyBase.ErasedOverride(DBObject, int)
 AssocDimDependencyBodyBase.SubErase(int)
 AssocDimDependencyBodyBase.DwgInFields(DwgFiler)
 AssocDimDependencyBodyBase.DwgOutFields(DwgFiler)
 AssocDimDependencyBodyBase.DxfInFields(DxfFiler)
 AssocDimDependencyBodyBase.DxfOutFields(DxfFiler)
 AssocDimDependencyBodyBase.FormatToCurrentPrecision(string, bool)
 AssocDimDependencyBodyBase.SetEraseDimensionIfDependencyIsErased(bool)
 AssocDimDependencyBodyBase.GetEraseDimensionIfDependencyIsErased()
 AssocDimDependencyBodyBase.IsRelevantChangeOverride
 AssocDimDependencyBodyBase.GetCurrentlyUsedEntityNameFormat
 AssocDimDependencyBodyBase.IsReferenceOnly
 AssocDimDependencyBodyBase.GetMeasuredValue
 AssocDimDependencyBodyBase.IsConstraintActive
 AssocDimDependencyBodyBase.SubentityConstrainedGeoms
 AssocDimDependencyBodyBase.ConstrainedGeoms
 AssocDimDependencyBodyBase.Variable
 AssocDependencyBody.SetStatus(AssocStatus, bool)
 AssocDependencyBody.currentEvaluationCallback()
 AssocDependencyBody.IsDependentOnTheSameThingAsOverride(AssocDependency)
 AssocDependencyBody.IsEqualToOverride(AssocDependency)
 AssocDependencyBody.ClonedOverride(DBObject, DBObject)
 AssocDependencyBody.HasCachedValueOverride
 AssocDependencyBody.IsActionEvaluationInProgress
 AssocDependencyBody.IsAttachedToObject
 AssocDependencyBody.DependentOnObject
 AssocDependencyBody.OwningAction
 AssocDependencyBody.Status
 AssocDependencyBody.ParentDependency
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocDimDependencyBody()
public AssocDimDependencyBody()
 AssocDimDependencyBody(IntPtr, bool)
protected AssocDimDependencyBody(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 EntityMeasurementOverride
public override double EntityMeasurementOverride { get; }
Property Value
double
 EntityTextOverride
public override string EntityTextOverride { get; set; }
Property Value
string
 IsEntityAttachmentChangedOverride
public override bool IsEntityAttachmentChangedOverride { get; }
Property Value
bool
Methods
 CreateAndPostToDatabase(ObjectId, ref ObjectId, ref ObjectId)
public static void CreateAndPostToDatabase(ObjectId dimId, ref ObjectId dimDepId, ref ObjectId dimDepBodyId)
Parameters
dimId ObjectId
dimDepId ObjectId
dimDepBodyId ObjectId
 UpdateDependentOnObjectOverride()
public override void UpdateDependentOnObjectOverride()