Table of Contents
 Enum TableBreakOptions
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::TableBreakOptions")]
[Flags]
[TypeConverter(typeof(EnumConverter))]
public enum TableBreakOptions
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AllowManualHeights = 16
AllowManualPositions = 8
EnableBreaking = 1
None = 0
RepeatBottomLabels = 4
RepeatTopLabels = 2