Table of Contents
 Enum IndexCreation
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcDb::IndexCreation")]
public enum IndexCreation
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
IndexByLayer = 1
IndexSpatially = 2
NoIndex = 0