Table of Contents
 Enum VSDisplayShadowType
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiVisualStyleProperties::DisplayShadowType")]
public enum VSDisplayShadowType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Full = 2
FullAndGround = 3
GroundPlane = 1
None = 0