Table of Contents
 Enum ShadePlotResLevel
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbPlotSettings::ShadePlotResLevel")]
public enum ShadePlotResLevel
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Custom = 5
Draft = 0
Maximum = 4
Normal = 2
Presentation = 3
Preview = 1