Table of Contents
 Class Cell
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcCell")]
public sealed class Cell : CellRange, ISubObject, IEnumerable<CellReference>, IEnumerable
Inheritance
object
CellRange
Cell
Implements
ISubObject
IEnumerable<CellReference>
IEnumerable
Inherited Members
 CellRange.Create(Table, int, int, int, int)
 CellRange.Equals(object)
 CellRange.GetHashCode()
 CellRange.GetEnumerator()
 CellRange.IEnumerableGetEnumerator()
 CellRange.GetStyleOverrides()
 CellRange.ClearStyleOverrides()
 CellRange.GetCustomData(string)
 CellRange.SetCustomData(string, object)
 CellRange.DeleteContent()
 CellRange.GetDataLink()
 CellRange.SetDataLink(ObjectId, bool)
 CellRange.IsMerged
 CellRange.IsSingleCell
 CellRange.this[int, int]
 CellRange.Borders
 CellRange.CanInsertColumn
 CellRange.CanInsertRow
 CellRange.CanDeleteColumns
 CellRange.CanDeleteRows
 CellRange.IsEmpty
 CellRange.IsFormatEditable
 CellRange.IsContentEditable
 CellRange.IsLinked
 CellRange.TextStyleId
 CellRange.TextHeight
 CellRange.IsMergeAllEnabled
 CellRange.DataType
 CellRange.DataFormat
 CellRange.ContentLayout
 CellRange.State
 CellRange.ContentColor
 CellRange.BackgroundColor
 CellRange.IsBackgroundColorNone
 CellRange.Alignment
 CellRange.Style
 CellRange.BottomRightPlusOne
 CellRange.BottomRight
 CellRange.TopLeft
 CellRange.RightColumn
 CellRange.BottomRow
 CellRange.LeftColumn
 CellRange.TopRow
 CellRange.IsNull
 CellRange.ParentTable
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Cell(Table, int, int)
public Cell(Table table, int row, int column)
Parameters
table Table
row int
column int
Properties
 AttachmentPoint
public Point3d AttachmentPoint { get; }
Property Value
Point3d
 BlockTableRecordId
public ObjectId BlockTableRecordId { get; set; }
Property Value
ObjectId
 CellType
public TableCellType CellType { get; }
Property Value
TableCellType
 Column
public int Column { get; }
Property Value
int
 ContentTypes
public CellContentTypes ContentTypes { get; }
Property Value
CellContentTypes
 Contents
public CellContentsCollection Contents { get; }
Property Value
CellContentsCollection
 DataLink
public ObjectId DataLink { get; set; }
Property Value
ObjectId
 FieldId
public ObjectId FieldId { get; set; }
Property Value
ObjectId
 Row
public int Row { get; }
Property Value
int
 TextString
public string TextString { get; set; }
Property Value
string
 ToolTip
public string ToolTip { get; set; }
Property Value
string
 Value
public object Value { get; set; }
Property Value
object
Methods
 GetBlockAttributeValue(ObjectId)
public string GetBlockAttributeValue(ObjectId attDefId)
Parameters
attDefId ObjectId
Returns
string
 GetDataLinkRange()
public CellRange GetDataLinkRange()
Returns
CellRange
 GetExtents()
public Point3dCollection GetExtents()
Returns
Point3dCollection
 GetMergeRange()
public CellRange GetMergeRange()
Returns
CellRange
 GetTextString(FormatOption)
public string GetTextString(FormatOption formatOption)
Parameters
formatOption FormatOption
Returns
string
 GetValue(FormatOption)
public object GetValue(FormatOption formatOption)
Parameters
formatOption FormatOption
Returns
object
 RemoveDataLink()
public void RemoveDataLink()
 ResetValue()
public void ResetValue()
 SetBlockAttributeValue(ObjectId, string)
public void SetBlockAttributeValue(ObjectId attDefId, string value)
Parameters
attDefId ObjectId
value string
 SetValue(object, ParseOption)
public void SetValue(object value, ParseOption parseOption)
Parameters
value object
parseOption ParseOption
 UpdateDataLink(UpdateDirection, UpdateOption)
public void UpdateDataLink(UpdateDirection dir, UpdateOption option)
Parameters
dir UpdateDirection
option UpdateOption