Table of Contents
 Struct CompositeParameter
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public struct CompositeParameter
Inherited Members
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 CompositeParameter(int, double)
public CompositeParameter(int segmentIndex, double localParameter)
Parameters
segmentIndex int
localParameter double
Properties
 LocalParameter
public double LocalParameter { get; }
Property Value
double
 SegmentIndex
public int SegmentIndex { get; }
Property Value
int
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 IsEqualTo(CompositeParameter)
public bool IsEqualTo(CompositeParameter a)
Parameters
a CompositeParameter
Returns
bool
 IsEqualTo(CompositeParameter, Tolerance)
public bool IsEqualTo(CompositeParameter a, Tolerance tolerance)
Parameters
a CompositeParameter
tolerance Tolerance
Returns
bool
Operators
 operator ==(CompositeParameter, CompositeParameter)
public static bool operator ==(CompositeParameter a, CompositeParameter b)
Parameters
a CompositeParameter
b CompositeParameter
Returns
bool
 operator !=(CompositeParameter, CompositeParameter)
public static bool operator !=(CompositeParameter a, CompositeParameter b)
Parameters
a CompositeParameter
b CompositeParameter
Returns
bool