Table of Contents
 Enum LoftOptionsNormalOption
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbLoftOptions::NormalOption")]
public enum LoftOptionsNormalOption
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AllNormal = 4
EndsNormal = 3
FirstNormal = 1
LastNormal = 2
NoNormal = 0
UseDraftAngles = 5