Table of Contents
 Class Torus
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeTorus")]
public sealed class Torus : Surface, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
Surface
Torus
Implements
IDisposable
ICloneable
Inherited Members
 Surface.GetClosestPointTo(Point3d)
 Surface.GetClosestPointTo(Point3d, Tolerance)
 Surface.GetEnvelope()
 Surface.ParameterOf(Point3d)
 Surface.ParameterOf(Point3d, Tolerance)
 Surface.IsOn(Point3d, Point2d)
 Surface.IsOn(Point3d, Point2d, Tolerance)
 Surface.ClosestPointTo(Point3d)
 Surface.ClosestPointTo(Point3d, Tolerance)
 Surface.DistanceTo(Point3d)
 Surface.DistanceTo(Point3d, Tolerance)
 Surface.IsClosedInU()
 Surface.IsClosedInU(Tolerance)
 Surface.IsClosedInV()
 Surface.IsClosedInV(Tolerance)
 Surface.EvaluatePoint(Point2d, int, ref Vector3dCollection, ref Vector3d)
 Surface.EvaluatePoint(Point2d, int, ref Vector3dCollection)
 Surface.EvaluatePoint(Point2d)
 Surface.ReverseNormal
 Surface.IsNormalReversed
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.IsOn(Point3d)
 Entity3d.IsOn(Point3d, Tolerance)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Torus()
public Torus()
 Torus(double, double, Point3d, Vector3d)
public Torus(double majorRadius, double minorRadius, Point3d origin, Vector3d axisOfSymmetry)
Parameters
majorRadius double
minorRadius double
origin Point3d
axisOfSymmetry Vector3d
 Torus(double, double, Point3d, Vector3d, Vector3d, double, double, double, double)
public Torus(double majorRadius, double minorRadius, Point3d origin, Vector3d axisOfSymmetry, Vector3d referenceAxis, double startAngleU, double endAngleU, double startAngleV, double endAngleV)
Parameters
majorRadius double
minorRadius double
origin Point3d
axisOfSymmetry Vector3d
referenceAxis Vector3d
startAngleU double
endAngleU double
startAngleV double
endAngleV double
Properties
 AxisOfSymmetry
public Vector3d AxisOfSymmetry { get; }
Property Value
Vector3d
 Center
public Point3d Center { get; }
Property Value
Point3d
 IsApple
public bool IsApple { get; }
Property Value
bool
 IsDegenerate
public bool IsDegenerate { get; }
Property Value
bool
 IsDoughnut
public bool IsDoughnut { get; }
Property Value
bool
 IsHollow
public bool IsHollow { get; }
Property Value
bool
 IsLemon
public bool IsLemon { get; }
Property Value
bool
 IsOuterNormal
public bool IsOuterNormal { get; }
Property Value
bool
 IsVortex
public bool IsVortex { get; }
Property Value
bool
 MajorRadius
public double MajorRadius { get; set; }
Property Value
double
 MinorRadius
public double MinorRadius { get; set; }
Property Value
double
 ReferenceAxis
public Vector3d ReferenceAxis { get; }
Property Value
Vector3d
Methods
 Create(IntPtr, bool)
public static Torus Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
Torus
 GetAnglesInU()
public double[] GetAnglesInU()
Returns
double[]
 GetAnglesInV()
public double[] GetAnglesInV()
Returns
double[]
 IntersectWith(LinearEntity3d)
public Point3d[] IntersectWith(LinearEntity3d linearEntity)
Parameters
linearEntity LinearEntity3d
Returns
Point3d[]
 IntersectWith(LinearEntity3d, Tolerance)
public Point3d[] IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance)
Parameters
linearEntity LinearEntity3d
tolerance Tolerance
Returns
Point3d[]
 Set(double, double, Point3d, Vector3d)
public void Set(double majorRadius, double minorRadius, Point3d origin, Vector3d axisOfSymmetry)
Parameters
majorRadius double
minorRadius double
origin Point3d
axisOfSymmetry Vector3d
 Set(double, double, Point3d, Vector3d, Vector3d, double, double, double, double)
public void Set(double majorRadius, double minorRadius, Point3d origin, Vector3d axisOfSymmetry, Vector3d refAxis, double startAngleU, double endAngleU, double startAngleV, double endAngleV)
Parameters
majorRadius double
minorRadius double
origin Point3d
axisOfSymmetry Vector3d
refAxis Vector3d
startAngleU double
endAngleU double
startAngleV double
endAngleV double
 SetAnglesInU(double, double)
public void SetAnglesInU(double startAngle, double endAngle)
Parameters
startAngle double
endAngle double
 SetAnglesInV(double, double)
public void SetAnglesInV(double startAngle, double endAngle)
Parameters
startAngle double
endAngle double