Table of Contents
 Enum DrawFlags
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiSubEntityTraits::DrawFlags")]
[Flags]
public enum DrawFlags
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
DrawBackfaces = 1
DrawFillTextBoundaryEnd = 512
DrawFillTextBoundaryStart = 256
DrawNoLineWeight = 32
None = 0