Table of Contents
 Class TransientManager
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiTransientManager")]
public class TransientManager : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
TransientManager
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 TransientManager(IntPtr)
protected TransientManager(IntPtr unmanagedPointer)
Parameters
unmanagedPointer IntPtr
Properties
 CurrentTransientManager
public static TransientManager CurrentTransientManager { get; set; }
Property Value
TransientManager
Methods
 AddChildTransient(Drawable, Drawable)
public bool AddChildTransient(Drawable added, Drawable parent)
Parameters
added Drawable
parent Drawable
Returns
bool
 AddTransient(Drawable, TransientDrawingMode, int, IntegerCollection)
public bool AddTransient(Drawable added, TransientDrawingMode mode, int subDrawingMode, IntegerCollection viewportNumbers)
Parameters
added Drawable
mode TransientDrawingMode
subDrawingMode int
viewportNumbers IntegerCollection
Returns
bool
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 EraseChildTransient(Drawable, Drawable)
public bool EraseChildTransient(Drawable erased, Drawable parent)
Parameters
erased Drawable
parent Drawable
Returns
bool
 EraseTransient(Drawable, IntegerCollection)
public bool EraseTransient(Drawable erased, IntegerCollection viewportNumbers)
Parameters
erased Drawable
viewportNumbers IntegerCollection
Returns
bool
 EraseTransients(TransientDrawingMode, int, IntegerCollection)
public bool EraseTransients(TransientDrawingMode mode, int subDrawingMode, IntegerCollection viewportNumbers)
Parameters
mode TransientDrawingMode
subDrawingMode int
viewportNumbers IntegerCollection
Returns
bool
 GetFreeSubDrawingMode(TransientDrawingMode, IntegerCollection, ref int)
public int GetFreeSubDrawingMode(TransientDrawingMode mode, IntegerCollection viewportNumbers, ref int subDrawingMode)
Parameters
mode TransientDrawingMode
viewportNumbers IntegerCollection
subDrawingMode int
Returns
int
 UpdateChildTransient(Drawable, Drawable)
public void UpdateChildTransient(Drawable updated, Drawable parent)
Parameters
updated Drawable
parent Drawable
 UpdateTransient(Drawable, IntegerCollection)
public void UpdateTransient(Drawable updated, IntegerCollection viewportNumbers)
Parameters
updated Drawable
viewportNumbers IntegerCollection