Table of Contents
 Enum FrameSetting
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbRasterVariables::FrameSettings")]
public enum FrameSetting
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ImageFrameAbove = 1
ImageFrameBelow = 2
ImageFrameInvalid = -1
ImageFrameOff = 0
ImageFrameOnNoPlot = 3