Table of Contents
 Struct ColorRGBA
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiColorRGBA")]
public struct ColorRGBA
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 ColorRGBA()
public ColorRGBA()
 ColorRGBA(double, double, double)
public ColorRGBA(double red, double green, double blue)
Parameters
red double
green double
blue double
 ColorRGBA(double, double, double, double)
public ColorRGBA(double red, double green, double blue, double alpha)
Parameters
red double
green double
blue double
alpha double
Properties
 Alpha
public double Alpha { get; set; }
Property Value
double
 Blue
public double Blue { get; set; }
Property Value
double
 Green
public double Green { get; set; }
Property Value
double
 Red
public double Red { get; set; }
Property Value
double