Table of Contents
 Enum VSDisplayStyles
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcGiVisualStyleProperties::DisplayStyles")]
public enum VSDisplayStyles
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BackgroundsFlag = 1
LightingFlag = 2
MaterialsFlag = 4
None = 0
TexturesFlag = 8