Table of Contents
 Struct RenderGlobal.ProcedureAndDestinationParameter
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct RenderGlobal.ProcedureAndDestinationParameter
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 ProcedureAndDestinationParameter(Procedure, Destination)
public ProcedureAndDestinationParameter(RenderGlobal.Procedure p, RenderGlobal.Destination d)
Parameters
p RenderGlobal.Procedure
d RenderGlobal.Destination
Properties
 Destination
public RenderGlobal.Destination Destination { get; }
Property Value
RenderGlobal.Destination
 Procedure
public RenderGlobal.Procedure Procedure { get; }
Property Value
RenderGlobal.Procedure