Table of Contents
 Class GeometricalConstraint
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcGeomConstraint")]
public class GeometricalConstraint : ConstraintGroupNode, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
ConstraintGroupNode
GeometricalConstraint
Implements
IDisposable
ICloneable
Derived
ColinearConstraint
CompositeConstraint
ConcentricConstraint
EqualCurvatureConstraint
EqualDistanceConstraint
EqualHelpParameterConstraint
EqualLengthConstraint
EqualRadiusConstraint
ExplicitConstraint
FixedConstraint
MidPointConstraint
NormalConstraint
ParallelConstraint
PerpendicularConstraint
PointCoincidenceConstraint
PointCurveConstraint
SymmetricConstraint
TangentConstraint
Inherited Members
 ConstraintGroupNode.OwningConstraintGroupId
 ConstraintGroupNode.NodeId
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 GeometricalConstraint(IntPtr, bool)
protected GeometricalConstraint(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 ConnectedGeometries
public virtual ConstrainedGeometry[] ConnectedGeometries { get; }
Property Value
ConstrainedGeometry[]
 ConnectedHelpParameters
public virtual HelpParameter[] ConnectedHelpParameters { get; }
Property Value
HelpParameter[]
 IsActive
public bool IsActive { get; }
Property Value
bool
 IsEnabled
public bool IsEnabled { get; }
Property Value
bool
 IsImplied
public bool IsImplied { get; }
Property Value
bool
 IsInternal
public bool IsInternal { get; }
Property Value
bool
 OwningCompositeConstraint
public CompositeConstraint OwningCompositeConstraint { get; }
Property Value
CompositeConstraint
Methods
 Deactivate()
public void Deactivate()
 GetConnectedHelpParameterFor(ConstrainedGeometry)
public virtual HelpParameter GetConnectedHelpParameterFor(ConstrainedGeometry consGeom)
Parameters
consGeom ConstrainedGeometry
Returns
HelpParameter
 Reactivate()
public void Reactivate()