Table of Contents
 Enum SecurityActions
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
public enum SecurityActions
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AddTimeStamp = 32
EncryptData = 1
EncryptProperties = 2
SignData = 16