Table of Contents
 Class MaterialTraits
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiMaterialTraits")]
public abstract class MaterialTraits : NonEntityTraits, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
SubEntityTraits
DrawableTraits
NonEntityTraits
MaterialTraits
Implements
IDisposable
ICloneable
Inherited Members
 NonEntityTraits.SetupForEntity(Entity)
 NonEntityTraits.SetSelectionMarker(IntPtr)
 NonEntityTraits.AddLight(ObjectId)
 NonEntityTraits.SetLayerFlags(DrawableTraits.LayerFlags)
 NonEntityTraits.SetHighlightProperty(DrawableTraits.HighlightProperty, object)
 NonEntityTraits.GetHighlightProperty(DrawableTraits.HighlightProperty)
 NonEntityTraits.SelectionFlags
 NonEntityTraits.LinePattern
 NonEntityTraits.Fill
 NonEntityTraits.SelectionOnlyGeometry
 NonEntityTraits.ShadowFlags
 NonEntityTraits.DrawFlags
 NonEntityTraits.VisualStyle
 NonEntityTraits.Sectionable
 NonEntityTraits.Mapper
 NonEntityTraits.Material
 NonEntityTraits.PlotStyleDescriptor
 NonEntityTraits.Thickness
 NonEntityTraits.LineTypeScale
 NonEntityTraits.LineWeight
 NonEntityTraits.FillType
 NonEntityTraits.LineType
 NonEntityTraits.Layer
 NonEntityTraits.Transparency
 NonEntityTraits.TrueColor
 NonEntityTraits.Color
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 MaterialTraits()
protected MaterialTraits()
 MaterialTraits(IntPtr, bool)
protected MaterialTraits(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 Ambient
public abstract MaterialColor Ambient { get; set; }
Property Value
MaterialColor
 Bump
public abstract MaterialMap Bump { get; set; }
Property Value
MaterialMap
 ChannelFlags
public abstract ChannelFlags ChannelFlags { get; set; }
Property Value
ChannelFlags
 ColorBleedScale
public abstract double ColorBleedScale { get; set; }
Property Value
double
 Diffuse
public abstract MaterialDiffuseComponent Diffuse { get; set; }
Property Value
MaterialDiffuseComponent
 FinalGather
public abstract FinalGatherMode FinalGather { get; set; }
Property Value
FinalGatherMode
 GlobalIllumination
public abstract GlobalIlluminationMode GlobalIllumination { get; set; }
Property Value
GlobalIlluminationMode
 IlluminationModel
public abstract IlluminationModel IlluminationModel { get; set; }
Property Value
IlluminationModel
 IndirectBumpScale
public abstract double IndirectBumpScale { get; set; }
Property Value
double
 Luminance
public abstract double Luminance { get; set; }
Property Value
double
 LuminanceMode
public abstract LuminanceMode LuminanceMode { get; set; }
Property Value
LuminanceMode
 Mode
public abstract Mode Mode { get; set; }
Property Value
Mode
 NormalMap
public abstract MaterialNormalMapComponent NormalMap { get; set; }
Property Value
MaterialNormalMapComponent
 Opacity
public abstract MaterialOpacityComponent Opacity { get; set; }
Property Value
MaterialOpacityComponent
 ReflectanceScale
public abstract double ReflectanceScale { get; set; }
Property Value
double
 Reflection
public abstract MaterialMap Reflection { get; set; }
Property Value
MaterialMap
 Reflectivity
public abstract double Reflectivity { get; set; }
Property Value
double
 Refraction
public abstract MaterialRefractionComponent Refraction { get; set; }
Property Value
MaterialRefractionComponent
 SelfIllumination
public abstract double SelfIllumination { get; set; }
Property Value
double
 Specular
public abstract MaterialSpecularComponent Specular { get; set; }
Property Value
MaterialSpecularComponent
 Translucence
public abstract double Translucence { get; set; }
Property Value
double
 TransmittanceScale
public abstract double TransmittanceScale { get; set; }
Property Value
double
 TwoSided
public abstract bool TwoSided { get; set; }
Property Value
bool