Table of Contents
 Class Line2dCollection
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public sealed class Line2dCollection : IList, ICollection, IEnumerable
Inheritance
object
Line2dCollection
Implements
IList
ICollection
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Line2dCollection()
public Line2dCollection()
Properties
 Count
public int Count { get; }
Property Value
int
 this[int]
public Line2d this[int index] { get; set; }
Parameters
index int
Property Value
Line2d
Methods
 Add(Line2d)
public int Add(Line2d value)
Parameters
value Line2d
Returns
int
 Clear()
public void Clear()
 Contains(Line2d)
public bool Contains(Line2d value)
Parameters
value Line2d
Returns
bool
 CopyTo(Line2d[], int)
public void CopyTo(Line2d[] array, int index)
Parameters
array Line2d[]
index int
 GetEnumerator()
public IEnumerator GetEnumerator()
Returns
IEnumerator
 IndexOf(Line2d)
public int IndexOf(Line2d value)
Parameters
value Line2d
Returns
int
 Insert(int, Line2d)
public void Insert(int index, Line2d value)
Parameters
index int
value Line2d
 Remove(Line2d)
public void Remove(Line2d value)
Parameters
value Line2d
 RemoveAt(int)
public void RemoveAt(int index)
Parameters
index int