Table of Contents
 Enum GeometricalConstraint.ConstraintType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum GeometricalConstraint.ConstraintType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Coincident = 6
Collinear = 5
Concentric = 7
EqualLength = 10
EqualRadius = 9
Fix = 13
Horizontal = 0
Normal = 4
Parallel = 2
Perpendicular = 3
Smooth = 12
Symmetric = 11
Tangent = 8
Vertical = 1