Table of Contents
 Enum SegmentType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbPolyline::SegType")]
public enum SegmentType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Arc = 1
Coincident = 2
Empty = 4
Line = 0
Point = 3