Table of Contents
 Enum VSFaceLightingQuality
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiVisualStyleProperties::FaceLightingQuality")]
public enum VSFaceLightingQuality
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
NoLighting = 0
PerFaceLighting = 1
PerPixelLighting = 3
PerVertexLighting = 2