Table of Contents
 Class AssocPathBasedSurfaceActionBody
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocPathBasedSurfaceActionBody")]
public class AssocPathBasedSurfaceActionBody : AssocSurfaceActionBody, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
AssocActionBody
AssocParamBasedActionBody
AssocSurfaceActionBody
AssocPathBasedSurfaceActionBody
Implements
IDisposable
ICloneable
Derived
AssocBlendSurfaceActionBody
AssocEdgeChamferActionBody
AssocExtendSurfaceActionBody
AssocExtrudedSurfaceActionBody
AssocLoftedSurfaceActionBody
AssocNetworkSurfaceActionBody
AssocPatchSurfaceActionBody
AssocPlaneSurfaceActionBody
AssocRevolvedSurfaceActionBody
AssocSweptSurfaceActionBody
AssocTrimSurfaceActionBody
Inherited Members
 AssocSurfaceActionBody.ResultingSurfaceDep(bool, bool)
 AssocSurfaceActionBody.ResultingSurfaceDep(bool)
 AssocSurfaceActionBody.SetResultingSurface(ObjectId, bool)
 AssocSurfaceActionBody.EvaluateOverride()
 AssocSurfaceActionBody.FindActionsThatAffectedTopologicalSubentity(Entity, SubentityId)
 AssocSurfaceActionBody.IsSemiAssociative
 AssocSurfaceActionBody.ResultingSurface
 AssocActionBody.GetParentAction(ObjectId)
 AssocActionBody.SetStatus(AssocStatus, bool, bool)
 AssocActionBody.GetDependencies(bool, bool)
 AssocActionBody.AddDependency(ObjectId, bool)
 AssocActionBody.RemoveDependency(ObjectId, bool)
 AssocActionBody.RemoveAllDependencies(bool)
 AssocActionBody.EvaluateDependencies()
 AssocActionBody.IsActionEvaluationInProgress()
 AssocActionBody.currentEvaluationCallback()
 AssocActionBody.HasAnyErasedOrBrokenDependencies()
 AssocActionBody.CreateActionAndActionBodyAndPostToDatabase(RXClass, ObjectId, ObjectId, ObjectId)
 AssocActionBody.GetActionBodiesOnObject(DBObject, bool, bool, out ObjectId, out ObjectIdCollection, out ObjectIdCollection)
 AssocActionBody.DwgInFields(DwgFiler)
 AssocActionBody.DwgOutFields(DwgFiler)
 AssocActionBody.DxfInFields(DxfFiler)
 AssocActionBody.DxfOutFields(DxfFiler)
 AssocActionBody.GetDependenciesOverride(bool, bool)
 AssocActionBody.GetDependentObjectsOverride(bool, bool)
 AssocActionBody.RemoveAllDependenciesOverride(bool)
 AssocActionBody.IsOwnedDependencyOverride(AssocDependency)
 AssocActionBody.IsExternalDependencyOverride(AssocDependency)
 AssocActionBody.HasDependencyCachedValueOverride(AssocDependency)
 AssocActionBody.IsRelevantDependencyChangeOverride(AssocDependency)
 AssocActionBody.AreDependenciesOnTheSameThingOverride(AssocDependency, AssocDependency)
 AssocActionBody.AreDependenciesEqualOverride(AssocDependency, AssocDependency)
 AssocActionBody.EvaluateDependencyOverride(AssocDependency)
 AssocActionBody.DependentObjectClonedOverride(AssocDependency, DBObject, DBObject)
 AssocActionBody.AddMoreObjectsToDeepCloneOverride(IdMapping, ObjectIdCollection)
 AssocActionBody.PostProcessAfterDeepCloneOverride(IdMapping)
 AssocActionBody.PostProcessAfterDeepCloneCancelOverride(IdMapping)
 AssocActionBody.OwnedDependencyStatusChangedOverride(AssocDependency, AssocStatus)
 AssocActionBody.IsEqualToOverride(AssocAction)
 AssocActionBody.EvaluationPriorityOverride(ref AssocEvaluationPriority)
 AssocActionBody.GetDependentActionsToEvaluateOverride(ActionsToEvaluateCallback)
 AssocActionBody.TransformActionByOverride(Matrix3d)
 AssocActionBody.DragStatusOverride(DragStatus)
 AssocActionBody.RemoveAllParams(bool)
 AssocActionBody.AddParam(ObjectId, ref int)
 AssocActionBody.RemoveParam(ObjectId, bool)
 AssocActionBody.ParamsAtName(string)
 AssocActionBody.ParamAtName(string, int)
 AssocActionBody.ParamAtName(string)
 AssocActionBody.ParamAtIndex(int)
 AssocActionBody.OwnedValueParamNames()
 AssocActionBody.GetValueParam(string, int)
 AssocActionBody.GetValueParam(string)
 AssocActionBody.GetValueParamArray(string)
 AssocActionBody.SetValueParam(string, AssocActionBody.ValueParam, bool)
 AssocActionBody.SetValueParam(string, AssocActionBody.ValueParam, bool, int)
 AssocActionBody.SetValueParamArray(string, AssocActionBody.ValueParam[], bool)
 AssocActionBody.GetValueParamUnitType(string)
 AssocActionBody.SetValueParamUnitType(string, UnitType)
 AssocActionBody.RemoveValueParam(string)
 AssocActionBody.ValueParamInputVariables(string)
 AssocActionBody.OwnedParams
 AssocActionBody.ParamCount
 AssocActionBody.OwningNetwork
 AssocActionBody.Status
 AssocActionBody.ParentAction
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocPathBasedSurfaceActionBody()
public AssocPathBasedSurfaceActionBody()
 AssocPathBasedSurfaceActionBody(IntPtr, bool)
protected AssocPathBasedSurfaceActionBody(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 InputPathParams
public ObjectIdCollection InputPathParams { get; }
Property Value
ObjectIdCollection
 InputVertexParams
public ObjectIdCollection InputVertexParams { get; }
Property Value
ObjectIdCollection
Methods
 GetInputPaths(out EdgeRef[][][])
public void GetInputPaths(out EdgeRef[][][] paths)
Parameters
paths EdgeRef[][][]
 GetInputPoints()
public VertexRef[] GetInputPoints()
Returns
VertexRef[]
 MakeInputPathsDrawOnTopOfResultingSurface()
public void MakeInputPathsDrawOnTopOfResultingSurface()
 RemoveAllPathParams()
public void RemoveAllPathParams()
 RemoveAllVertexParams()
public void RemoveAllVertexParams()
 SetInputPaths(EdgeRef[][])
public void SetInputPaths(EdgeRef[][] edges)
Parameters
edges EdgeRef[][]
 SetInputPaths(PathRef[])
public void SetInputPaths(PathRef[] paths)
Parameters
paths PathRef[]
 SetInputPoints(VertexRef[])
public void SetInputPoints(VertexRef[] points)
Parameters
points VertexRef[]
 UpdateInputPath(int, PathRef)
public void UpdateInputPath(int index, PathRef pathRef)
Parameters
index int
pathRef PathRef