Table of Contents
 Class DoubleCollection
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeDoubleArray")]
public class DoubleCollection : IList, ICollection, IEnumerable
Inheritance
object
DoubleCollection
Implements
IList
ICollection
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DoubleCollection()
public DoubleCollection()
 DoubleCollection(double[])
public DoubleCollection(double[] values)
Parameters
values double[]
 DoubleCollection(int)
public DoubleCollection(int capacity)
Parameters
capacity int
Fields
 DefaultSize
public const int DefaultSize = 10
Field Value
int
Properties
 Capacity
public virtual int Capacity { get; set; }
Property Value
int
 Count
public virtual int Count { get; }
Property Value
int
 IsFixedSize
public virtual bool IsFixedSize { get; }
Property Value
bool
 IsReadOnly
public virtual bool IsReadOnly { get; }
Property Value
bool
 IsSynchronized
public virtual bool IsSynchronized { get; }
Property Value
bool
 this[int]
public virtual double this[int index] { get; set; }
Parameters
index int
Property Value
double
 SyncRoot
public virtual object SyncRoot { get; }
Property Value
object
Methods
 Add(double)
public virtual int Add(double value)
Parameters
value double
Returns
int
 AddRange(double[])
public virtual void AddRange(double[] range)
Parameters
range double[]
 Clear()
public virtual void Clear()
 Contains(double)
public virtual bool Contains(double value)
Parameters
value double
Returns
bool
 CopyTo(double[], int)
public virtual void CopyTo(double[] array, int index)
Parameters
array double[]
index int
 GetEnumerator()
public virtual DoubleCollectionEnumerator GetEnumerator()
Returns
DoubleCollectionEnumerator
 IndexOf(double)
public virtual int IndexOf(double value)
Parameters
value double
Returns
int
 Insert(int, double)
public virtual void Insert(int index, double value)
Parameters
index int
value double
 Remove(double)
public virtual void Remove(double value)
Parameters
value double
 RemoveAt(int)
public virtual void RemoveAt(int index)
Parameters
index int
 ToArray()
public virtual double[] ToArray()
Returns
double[]
 TrimToSize()
public virtual void TrimToSize()