Table of Contents
 Enum SectionGeometry
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbSectionSettings::Geometry")]
[Flags]
public enum SectionGeometry
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BackgroundGeometry = 4
CurveTangencyLines = 16
ForegroundGeometry = 8
IntersectionBoundary = 1
IntersectionFill = 2