Table of Contents
 Enum Assoc2dConstraintGroup.SolutionStatusType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum Assoc2dConstraintGroup.SolutionStatusType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Inconsistent = 3
NotAvailable = 5
NotEvaluated = 4
OverConstrained = 2
RejectedByClient = 6
UnderConstrained = 1
WellDefined = 0