Table of Contents
 Class LineSegment2d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeLineSeg2d")]
public sealed class LineSegment2d : LinearEntity2d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity2d
Curve2d
LinearEntity2d
LineSegment2d
Implements
IDisposable
ICloneable
Inherited Members
 LinearEntity2d.IntersectWith(LinearEntity2d)
 LinearEntity2d.IntersectWith(LinearEntity2d, Tolerance)
 LinearEntity2d.Overlap(LinearEntity2d)
 LinearEntity2d.Overlap(LinearEntity2d, Tolerance)
 LinearEntity2d.IsParallelTo(LinearEntity2d)
 LinearEntity2d.IsParallelTo(LinearEntity2d, Tolerance)
 LinearEntity2d.IsPerpendicularTo(LinearEntity2d)
 LinearEntity2d.IsPerpendicularTo(LinearEntity2d, Tolerance)
 LinearEntity2d.IsColinearTo(LinearEntity2d)
 LinearEntity2d.IsColinearTo(LinearEntity2d, Tolerance)
 LinearEntity2d.GetPerpendicularLine(Point2d)
 LinearEntity2d.GetLine()
 LinearEntity2d.Direction
 LinearEntity2d.PointOnLine
 Curve2d.GetInterval()
 Curve2d.SetInterval(Interval)
 Curve2d.GetReverseParameterCurve()
 Curve2d.GetDistanceTo(Curve2d)
 Curve2d.GetDistanceTo(Curve2d, Tolerance)
 Curve2d.GetDistanceTo(Point2d)
 Curve2d.GetDistanceTo(Point2d, Tolerance)
 Curve2d.GetClosestPointTo(Curve2d)
 Curve2d.GetClosestPointTo(Curve2d, Tolerance)
 Curve2d.GetClosestPointTo(Point2d)
 Curve2d.GetClosestPointTo(Point2d, Tolerance)
 Curve2d.GetNormalPoint(Point2d)
 Curve2d.GetNormalPoint(Point2d, Tolerance)
 Curve2d.IsOn(double)
 Curve2d.IsOn(double, Tolerance)
 Curve2d.IsOn(Point2d, out double)
 Curve2d.IsOn(Point2d, out double, Tolerance)
 Curve2d.IsOn(Point2d)
 Curve2d.IsOn(Point2d, Tolerance)
 Curve2d.GetParameterOf(Point2d)
 Curve2d.GetParameterOf(Point2d, Tolerance)
 Curve2d.GetTrimmedOffset(double, OffsetCurveExtensionType)
 Curve2d.GetTrimmedOffset(double, OffsetCurveExtensionType, Tolerance)
 Curve2d.IsClosed()
 Curve2d.IsClosed(Tolerance)
 Curve2d.IsPeriodic(out double)
 Curve2d.IsLinear(out Line2d)
 Curve2d.IsLinear(out Line2d, Tolerance)
 Curve2d.GetLength(double, double)
 Curve2d.GetLength(double, double, Tolerance)
 Curve2d.GetParameterAtLength(double, double, bool)
 Curve2d.GetParameterAtLength(double, double, bool, Tolerance)
 Curve2d.GetArea(double, double)
 Curve2d.GetArea(double, double, Tolerance)
 Curve2d.IsDegenerate(out Entity2d)
 Curve2d.IsDegenerate(out Entity2d, Tolerance)
 Curve2d.GetSplitCurves(double)
 Curve2d.Explode(Interval)
 Curve2d.GetBoundBlockOf(Interval)
 Curve2d.GetOrthoBoundBlockOf(Interval)
 Curve2d.EvaluatePoint(double)
 Curve2d.GetSamplePoints(int)
 Curve2d.GetSamplePoints(double, double, double)
 Curve2d.HasEndPoint
 Curve2d.HasStartPoint
 Curve2d.OrthoBoundBlock
 Curve2d.BoundBlock
 Entity2d.Clone()
 Entity2d.IsEqualTo(Entity2d)
 Entity2d.IsEqualTo(Entity2d, Tolerance)
 Entity2d.TransformBy(Matrix2d)
 Entity2d.TranslateBy(Vector2d)
 Entity2d.RotateBy(double, Point2d)
 Entity2d.Mirror(Line2d)
 Entity2d.ScaleBy(double, Point2d)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 LineSegment2d()
public LineSegment2d()
 LineSegment2d(Point2d, Point2d)
public LineSegment2d(Point2d point1, Point2d point2)
Parameters
point1 Point2d
point2 Point2d
 LineSegment2d(Point2d, Vector2d)
public LineSegment2d(Point2d point, Vector2d vector)
Parameters
point Point2d
vector Vector2d
Properties
 EndPoint
public Point2d EndPoint { get; }
Property Value
Point2d
 Length
public double Length { get; }
Property Value
double
 MidPoint
public Point2d MidPoint { get; }
Property Value
Point2d
 StartPoint
public Point2d StartPoint { get; }
Property Value
Point2d
Methods
 BaryComb(double)
public Point2d BaryComb(double blendCoefficient)
Parameters
blendCoefficient double
Returns
Point2d
 Create(IntPtr, bool)
public static LineSegment2d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
LineSegment2d
 GetBisector()
public Line2d GetBisector()
Returns
Line2d
 GetSegmentLength(double, double)
public double GetSegmentLength(double fromParameter, double toParameter)
Parameters
fromParameter double
toParameter double
Returns
double
 GetSegmentLength(double, double, Tolerance)
public double GetSegmentLength(double fromParameter, double toParameter, Tolerance tolerance)
Parameters
fromParameter double
toParameter double
tolerance Tolerance
Returns
double
 Set(Curve2d, Curve2d, double, double)
public void Set(Curve2d curve1, Curve2d curve2, double parameter1, double parameter2)
Parameters
curve1 Curve2d
curve2 Curve2d
parameter1 double
parameter2 double
 Set(Curve2d, Point2d, double)
public void Set(Curve2d curve, Point2d point, double parameter)
Parameters
curve Curve2d
point Point2d
parameter double
 Set(Point2d, Point2d)
public void Set(Point2d point1, Point2d point2)
Parameters
point1 Point2d
point2 Point2d
 Set(Point2d, Vector2d)
public void Set(Point2d point, Vector2d vector)
Parameters
point Point2d
vector Vector2d