Table of Contents
 Struct DataTypeParameter
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::AcDataType")]
public struct DataTypeParameter
Inherited Members
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 DataTypeParameter(DataType, UnitType)
public DataTypeParameter(DataType dataType, UnitType unitType)
Parameters
dataType DataType
unitType UnitType
Properties
 DataType
public DataType DataType { get; set; }
Property Value
DataType
 UnitType
public UnitType UnitType { get; set; }
Property Value
UnitType
Methods
 Equals(object)
public override sealed bool Equals(object other)
Parameters
other object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
Operators
 operator ==(DataTypeParameter, DataTypeParameter)
public static bool operator ==(DataTypeParameter t1, DataTypeParameter t2)
Parameters
t1 DataTypeParameter
t2 DataTypeParameter
Returns
bool
 operator !=(DataTypeParameter, DataTypeParameter)
public static bool operator !=(DataTypeParameter t1, DataTypeParameter t2)
Parameters
t1 DataTypeParameter
t2 DataTypeParameter
Returns
bool