Table of Contents
 Class DBObjectReferenceCollection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public sealed class DBObjectReferenceCollection : CollectionBase, IList, ICollection, IEnumerable
Inheritance
object
CollectionBase
DBObjectReferenceCollection
Implements
IList
ICollection
IEnumerable
Inherited Members
 CollectionBase.Clear()
 CollectionBase.RemoveAt(int)
 CollectionBase.GetEnumerator()
 CollectionBase.Capacity
 CollectionBase.Count
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 this[int]
public DBObjectReference this[int index] { get; set; }
Parameters
index int
Property Value
DBObjectReference
Methods
 Add(DBObjectReference)
public int Add(DBObjectReference value)
Parameters
value DBObjectReference
Returns
int
 Contains(DBObjectReference)
public bool Contains(DBObjectReference value)
Parameters
value DBObjectReference
Returns
bool
 CopyTo(DBObjectReference[], int)
public void CopyTo(DBObjectReference[] array, int index)
Parameters
array DBObjectReference[]
index int
 IndexOf(DBObjectReference)
public int IndexOf(DBObjectReference value)
Parameters
value DBObjectReference
Returns
int
 Insert(int, DBObjectReference)
public void Insert(int index, DBObjectReference value)
Parameters
index int
value DBObjectReference
 OnValidate(object)
protected override sealed void OnValidate(object value)
Parameters
value object
 Remove(DBObjectReference)
public void Remove(DBObjectReference value)
Parameters
value DBObjectReference