Table of Contents
 Enum GraphicsMetafileType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbProxyEntity::GraphicsMetafileType")]
public enum GraphicsMetafileType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BoundingBox = 1
FullGraphics = 2
NoMetafile = 0