Table of Contents
 Struct PlanarEquationCoefficients
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public struct PlanarEquationCoefficients
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 PlanarEquationCoefficients(double, double, double, double)
public PlanarEquationCoefficients(double a, double b, double c, double d)
Parameters
a double
b double
c double
d double
Properties
 A
public double A { get; }
Property Value
double
 B
public double B { get; }
Property Value
double
 C
public double C { get; }
Property Value
double
 D
public double D { get; }
Property Value
double