Table of Contents
 Enum Poly3dType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::Poly3dType")]
public enum Poly3dType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CubicSplinePoly = 2
QuadSplinePoly = 1
SimplePoly = 0