Table of Contents
 Enum PointCloudItemType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum PointCloudItemType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
IndividualScan = 2
LegacyPointCloud = 0
PointCloudProject = 1
Region = 4
RegionRootGroup = 6
Scan = 3
ScanRootGroup = 5
UnassignedPoint = 7