Table of Contents
 Struct Matrix2d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeMatrix2d")]
public struct Matrix2d : IFormattable
Implements
IFormattable
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 Matrix2d(double[])
public Matrix2d(double[] data)
Parameters
data double[]
Properties
 CoordinateSystem2d
public CoordinateSystem2d CoordinateSystem2d { get; }
Property Value
CoordinateSystem2d
 this[int, int]
public double this[int row, int column] { get; }
Parameters
row int
column int
Property Value
double
 Translation
public Vector2d Translation { get; }
Property Value
Vector2d
Methods
 AlignCoordinateSystem(Point2d, Vector2d, Vector2d, Point2d, Vector2d, Vector2d)
public static Matrix2d AlignCoordinateSystem(Point2d fromOrigin, Vector2d fromE0, Vector2d fromE1, Point2d toOrigin, Vector2d toE0, Vector2d toE1)
Parameters
fromOrigin Point2d
fromE0 Vector2d
fromE1 Vector2d
toOrigin Point2d
toE0 Vector2d
toE1 Vector2d
Returns
Matrix2d
 Displacement(Vector2d)
public static Matrix2d Displacement(Vector2d vector)
Parameters
vector Vector2d
Returns
Matrix2d
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetDeterminant()
public double GetDeterminant()
Returns
double
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 GetScale()
public double GetScale()
Returns
double
 Inverse()
public Matrix2d Inverse()
Returns
Matrix2d
 IsConformal(Matrix2dInfo)
public bool IsConformal(Matrix2dInfo info)
Parameters
info Matrix2dInfo
Returns
bool
 IsEqualTo(Matrix2d)
public bool IsEqualTo(Matrix2d a)
Parameters
a Matrix2d
Returns
bool
 IsEqualTo(Matrix2d, Tolerance)
public bool IsEqualTo(Matrix2d a, Tolerance tolerance)
Parameters
a Matrix2d
tolerance Tolerance
Returns
bool
 IsScaledOrtho()
public bool IsScaledOrtho()
Returns
bool
 IsScaledOrtho(Tolerance)
public bool IsScaledOrtho(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 IsSingular()
public bool IsSingular()
Returns
bool
 IsSingular(Tolerance)
public bool IsSingular(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 IsUniscaledOrtho()
public bool IsUniscaledOrtho()
Returns
bool
 IsUniscaledOrtho(Tolerance)
public bool IsUniscaledOrtho(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 Mirroring(Line2d)
public static Matrix2d Mirroring(Line2d line)
Parameters
line Line2d
Returns
Matrix2d
 Mirroring(Point2d)
public static Matrix2d Mirroring(Point2d point)
Parameters
point Point2d
Returns
Matrix2d
 Multiply(Matrix2d)
public Matrix2d Multiply(Matrix2d matrix)
Parameters
matrix Matrix2d
Returns
Matrix2d
 PostMultiplyBy(Matrix2d)
public Matrix2d PostMultiplyBy(Matrix2d rightSide)
Parameters
rightSide Matrix2d
Returns
Matrix2d
 PreMultiplyBy(Matrix2d)
public Matrix2d PreMultiplyBy(Matrix2d leftSide)
Parameters
leftSide Matrix2d
Returns
Matrix2d
 Rotation(double, Point2d)
public static Matrix2d Rotation(double angle, Point2d center)
Parameters
angle double
center Point2d
Returns
Matrix2d
 Scaling(double, Point2d)
public static Matrix2d Scaling(double scaleAll, Point2d center)
Parameters
scaleAll double
center Point2d
Returns
Matrix2d
 ToArray()
public double[] ToArray()
Returns
double[]
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
 ToString(string, IFormatProvider)
public string ToString(string format, IFormatProvider provider)
Parameters
format string
provider IFormatProvider
Returns
string
 Transpose()
public Matrix2d Transpose()
Returns
Matrix2d
Operators
 operator ==(Matrix2d, Matrix2d)
public static bool operator ==(Matrix2d a, Matrix2d b)
Parameters
a Matrix2d
b Matrix2d
Returns
bool
 operator !=(Matrix2d, Matrix2d)
public static bool operator !=(Matrix2d a, Matrix2d b)
Parameters
a Matrix2d
b Matrix2d
Returns
bool
 operator *(Matrix2d, Matrix2d)
public static Matrix2d operator *(Matrix2d a, Matrix2d b)
Parameters
a Matrix2d
b Matrix2d
Returns
Matrix2d