Table of Contents
 Class SurfaceTrimInfo
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbSurfaceTrimInfo")]
public class SurfaceTrimInfo : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
SurfaceTrimInfo
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 SurfaceTrimInfo()
public SurfaceTrimInfo()
 SurfaceTrimInfo(IntPtr, bool)
protected SurfaceTrimInfo(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 IsCurve
public bool IsCurve { get; }
Property Value
bool
 ProjVector
public Vector3d ProjVector { get; set; }
Property Value
Vector3d
 Relation
public SurfaceTrimInfo.TrimRelation Relation { get; set; }
Property Value
SurfaceTrimInfo.TrimRelation
 ToolBodyId
public CompoundObjectId ToolBodyId { get; set; }
Property Value
CompoundObjectId
Methods
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 SetTrimInfo(CompoundObjectId, TrimRelation, SubentityId)
public void SetTrimInfo(CompoundObjectId surfaceId, SurfaceTrimInfo.TrimRelation relation, SubentityId subEntityId)
Parameters
surfaceId CompoundObjectId
relation SurfaceTrimInfo.TrimRelation
subEntityId SubentityId
 SetTrimInfo(CompoundObjectId, Vector3d, TrimRelation)
public void SetTrimInfo(CompoundObjectId curveId, Vector3d projVector, SurfaceTrimInfo.TrimRelation relation)
Parameters
curveId CompoundObjectId
projVector Vector3d
relation SurfaceTrimInfo.TrimRelation