Table of Contents
 Class BlockPropertiesTableColumn
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class BlockPropertiesTableColumn
Inheritance
object
BlockPropertiesTableColumn
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Constant
public bool Constant { get; set; }
Property Value
bool
 CustomProperties
public ObjectId CustomProperties { get; set; }
Property Value
ObjectId
 DefaultValue
public ResultBuffer DefaultValue { get; set; }
Property Value
ResultBuffer
 Editable
public bool Editable { get; set; }
Property Value
bool
 Format
public string Format { get; set; }
Property Value
string
 Parameter
public IParameter Parameter { get; }
Property Value
IParameter
 Removable
public bool Removable { get; set; }
Property Value
bool
 Table
public BlockPropertiesTable Table { get; }
Property Value
BlockPropertiesTable
 UnmatchedValue
public ResultBuffer UnmatchedValue { get; set; }
Property Value
ResultBuffer