Table of Contents
 Struct Extents2d
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbExtents2d")]
public struct Extents2d : IFormattable
Implements
IFormattable
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 Extents2d(Point2d, Point2d)
public Extents2d(Point2d minimum, Point2d maximum)
Parameters
minimum Point2d
maximum Point2d
 Extents2d(double, double, double, double)
public Extents2d(double minX, double minY, double maxX, double maxY)
Parameters
minX double
minY double
maxX double
maxY double
Properties
 MaxPoint
public Point2d MaxPoint { get; }
Property Value
Point2d
 MinPoint
public Point2d MinPoint { get; }
Property Value
Point2d
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 IsEqualTo(Extents2d)
public bool IsEqualTo(Extents2d a)
Parameters
a Extents2d
Returns
bool
 IsEqualTo(Extents2d, Tolerance)
public bool IsEqualTo(Extents2d a, Tolerance tolerance)
Parameters
a Extents2d
tolerance Tolerance
Returns
bool
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
 ToString(string, IFormatProvider)
public string ToString(string format, IFormatProvider provider)
Parameters
format string
provider IFormatProvider
Returns
string
Operators
 operator ==(Extents2d, Extents2d)
public static bool operator ==(Extents2d a, Extents2d b)
Parameters
a Extents2d
b Extents2d
Returns
bool
 operator !=(Extents2d, Extents2d)
public static bool operator !=(Extents2d a, Extents2d b)
Parameters
a Extents2d
b Extents2d
Returns
bool