Table of Contents
 Class AssocArrayPathParameters
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocArrayPathParameters")]
public class AssocArrayPathParameters : AssocArrayCommonParameters, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
AssocArrayParameters
AssocArrayCommonParameters
AssocArrayPathParameters
Implements
IDisposable
ICloneable
Inherited Members
 AssocArrayCommonParameters.GetRowCount(out string, out string)
 AssocArrayCommonParameters.SetRowCount(int, string, string)
 AssocArrayCommonParameters.GetRowSpacing(out string, out string)
 AssocArrayCommonParameters.SetRowSpacing(double, string, string)
 AssocArrayCommonParameters.GetRowElevation(out string, out string)
 AssocArrayCommonParameters.SetRowElevation(double, string, string)
 AssocArrayCommonParameters.GetLevelCount(out string, out string)
 AssocArrayCommonParameters.SetLevelCount(int, string, string)
 AssocArrayCommonParameters.GetLevelSpacing(out string, out string)
 AssocArrayCommonParameters.SetLevelSpacing(double, string, string)
 AssocArrayCommonParameters.BasePoint
 AssocArrayCommonParameters.BaseNormal
 AssocArrayCommonParameters.BasePlane
 AssocArrayCommonParameters.LevelSpacing
 AssocArrayCommonParameters.LevelCount
 AssocArrayCommonParameters.RowElevation
 AssocArrayCommonParameters.RowSpacing
 AssocArrayCommonParameters.RowCount
 AssocArrayParameters.Commit()
 AssocArrayParameters.Owner
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocArrayPathParameters()
public AssocArrayPathParameters()
 AssocArrayPathParameters(double, double, double, int, int, int, double)
public AssocArrayPathParameters(double itemSpacing, double rowSpacing, double levelSpacing, int itemCount, int rowCount, int levelCount, double rowElevation)
Parameters
itemSpacing double
rowSpacing double
levelSpacing double
itemCount int
rowCount int
levelCount int
rowElevation double
 AssocArrayPathParameters(IntPtr, bool)
protected AssocArrayPathParameters(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 AlignItems
public bool AlignItems { get; set; }
Property Value
bool
 EndOffset
public double EndOffset { get; set; }
Property Value
double
 ItemCount
public int ItemCount { get; set; }
Property Value
int
 ItemSpacing
public double ItemSpacing { get; set; }
Property Value
double
 Method
public AssocArrayPathParameters.MethodType Method { get; set; }
Property Value
AssocArrayPathParameters.MethodType
 Path
public EdgeRef Path { get; set; }
Property Value
EdgeRef
 PathDirection
public bool PathDirection { set; }
Property Value
bool
 StartOffset
public double StartOffset { get; set; }
Property Value
double
Methods
 GetEndOffset(out string, out string)
public double GetEndOffset(out string expression, out string evaluatorId)
Parameters
expression string
evaluatorId string
Returns
double
 GetItemCount(out string, out string)
public int GetItemCount(out string expression, out string evaluatorId)
Parameters
expression string
evaluatorId string
Returns
int
 GetItemSpacing(out string, out string)
public double GetItemSpacing(out string expression, out string evaluatorId)
Parameters
expression string
evaluatorId string
Returns
double
 GetStartOffset(out string, out string)
public double GetStartOffset(out string expression, out string evaluatorId)
Parameters
expression string
evaluatorId string
Returns
double
 SetEndOffset(double, string, string)
public void SetEndOffset(double offset, string expression, string evaluatorId)
Parameters
offset double
expression string
evaluatorId string
 SetItemCount(int, string, string)
public void SetItemCount(int count, string expression, string evaluatorId)
Parameters
count int
expression string
evaluatorId string
 SetItemSpacing(double, string, string)
public void SetItemSpacing(double spacing, string expression, string evaluatorId)
Parameters
spacing double
expression string
evaluatorId string
 SetStartOffset(double, string, string)
public void SetStartOffset(double offset, string expression, string evaluatorId)
Parameters
offset double
expression string
evaluatorId string