Table of Contents
 Class Column
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public sealed class Column : CellRange, ISubObject, IEnumerable<CellReference>, IEnumerable
Inheritance
object
CellRange
Column
Implements
ISubObject
IEnumerable<CellReference>
IEnumerable
Inherited Members
 CellRange.Create(Table, int, int, int, int)
 CellRange.Equals(object)
 CellRange.GetHashCode()
 CellRange.GetEnumerator()
 CellRange.IEnumerableGetEnumerator()
 CellRange.GetStyleOverrides()
 CellRange.ClearStyleOverrides()
 CellRange.GetCustomData(string)
 CellRange.SetCustomData(string, object)
 CellRange.DeleteContent()
 CellRange.GetDataLink()
 CellRange.SetDataLink(ObjectId, bool)
 CellRange.IsMerged
 CellRange.IsSingleCell
 CellRange.this[int, int]
 CellRange.Borders
 CellRange.CanInsertColumn
 CellRange.CanInsertRow
 CellRange.CanDeleteColumns
 CellRange.CanDeleteRows
 CellRange.IsEmpty
 CellRange.IsFormatEditable
 CellRange.IsContentEditable
 CellRange.IsLinked
 CellRange.TextStyleId
 CellRange.TextHeight
 CellRange.IsMergeAllEnabled
 CellRange.DataType
 CellRange.DataFormat
 CellRange.ContentLayout
 CellRange.State
 CellRange.ContentColor
 CellRange.BackgroundColor
 CellRange.IsBackgroundColorNone
 CellRange.Alignment
 CellRange.Style
 CellRange.BottomRightPlusOne
 CellRange.BottomRight
 CellRange.TopLeft
 CellRange.RightColumn
 CellRange.BottomRow
 CellRange.LeftColumn
 CellRange.TopRow
 CellRange.IsNull
 CellRange.ParentTable
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 MinimumWidth
public double MinimumWidth { get; }
Property Value
double
 Name
public string Name { get; set; }
Property Value
string
 Width
[UnitType(UnitType.Distance)]
public double Width { get; set; }
Property Value
double