Table of Contents
 Struct AssocActionBody.ValueParam
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct AssocActionBody.ValueParam
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 ValueParam(string, string, ResultBuffer)
public ValueParam(string expression, string evaluatorId, ResultBuffer value)
Parameters
expression string
evaluatorId string
value ResultBuffer
Fields
 m_evaluatorId
protected string m_evaluatorId
Field Value
string
 m_expression
protected string m_expression
Field Value
string
 m_value
protected ResultBuffer m_value
Field Value
ResultBuffer
Properties
 EvaluatorId
public string EvaluatorId { get; set; }
Property Value
string
 Expression
public string Expression { get; set; }
Property Value
string
 Value
public ResultBuffer Value { get; set; }
Property Value
ResultBuffer