Table of Contents
 Enum FieldEvaluationContext
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum FieldEvaluationContext
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Demand = 32
Etransmit = 8
Open = 1
Plot = 4
Preview = 64
Regen = 16
Save = 2