Table of Contents
 Enum SweepOptionsAlignOption
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbSweepOptions::AlignOption")]
public enum SweepOptionsAlignOption
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AlignSweepEntityToPath = 1
NoAlignment = 0
TranslatePathToSweepEntity = 3
TranslateSweepEntityToPath = 2