Table of Contents
 Class BlockInsertionPointsEventArgs
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class BlockInsertionPointsEventArgs : EventArgs
Inheritance
object
EventArgs
BlockInsertionPointsEventArgs
Inherited Members
 EventArgs.Empty
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 BlockInsertionPointsEventArgs(BlockTableRecord, Point3dCollection, Vector3dCollection)
public BlockInsertionPointsEventArgs(BlockTableRecord blockTableRecord, Point3dCollection points, Vector3dCollection alignmentVectors)
Parameters
blockTableRecord BlockTableRecord
points Point3dCollection
alignmentVectors Vector3dCollection
Properties
 AlignmentVectors
public Vector3dCollection AlignmentVectors { get; }
Property Value
Vector3dCollection
 BlockTableRecord
public BlockTableRecord BlockTableRecord { get; }
Property Value
BlockTableRecord
 InsertionPoints
public Point3dCollection InsertionPoints { get; }
Property Value
Point3dCollection