Table of Contents
 Enum LightingUnits
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::LightingUnits")]
public enum LightingUnits
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
LightingUnitsAmerican = 1
LightingUnitsGeneric = 0
LightingUnitsInternational = 2