Table of Contents
 Enum GeoCSUnit
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbGeoCoordinateSystem::Unit")]
public enum GeoCSUnit
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BenoitChain = 26
BenoitLink = 30
Brealey = 38
CaGrid = 23
CapeRood = 37
Centimeter = 7
Centisec = 1010
ClarkeChain = 24
ClarkeFoot = 5
ClarkeLink = 28
Decameter = 48
Decimeter = 18
Decisec = 1009
Degree = 1001
Dekameter = 20
Foot = 2
Furlong = 35
GermanMeter = 22
GoldCoastFoot = 40
Grad = 1002
Grade = 1003
GunterChain = 25
GunterLink = 29
Hectometer = 21
IFoot = 4
IInch = 6
IMile = 13
IYard = 12
Inch = 3
IndianFoot = 43
IndianFt37 = 44
IndianFt62 = 45
IndianFt75 = 46
IndianYard = 42
IndianYd37 = 47
InternationalChain = 49
InternationalLink = 50
Kilometer = 8
Knot = 14
Lat66 = 16
Lat83 = 17
MapInfo = 1004
Meter = 1
MicroInch = 41
Mil = 1005
Mile = 11
Millimeter = 19
Millisec = 1011
Minute = 1006
NautM = 15
Perch = 33
Pole = 34
Radian = 1007
Rod = 32
Rood = 36
SearsChain = 27
SearsFoot = 39
SearsLink = 31
SearsYard = 10
Second = 1008
Unknown = 0
Yard = 9