Table of Contents
 Enum FilletTrimMode
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::FilletTrimMode")]
public enum FilletTrimMode
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
TrimBoth = 3
TrimNone = 0
TrimSecond = 2
TrimStart = 1