Table of Contents
 Class Dimension
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDimension")]
public abstract class Dimension : Entity, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
Entity
Dimension
Implements
IDisposable
ICloneable
Derived
AlignedDimension
ArcDimension
DiametricDimension
LineAngularDimension2
OrdinateDimension
Point3AngularDimension
RadialDimension
RadialDimensionLarge
RotatedDimension
Inherited Members
 Entity.SetLayerId(ObjectId, bool)
 Entity.SetPropertiesFrom(Entity)
 Entity.GetPlane()
 Entity.AddSubentityPaths(FullSubentityPath[])
 Entity.DeleteSubentityPaths(FullSubentityPath[])
 Entity.TransformSubentityPathsBy(FullSubentityPath[], Matrix3d)
 Entity.GetGripPointsAtSubentityPath(FullSubentityPath, GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.MoveGripPointsAtSubentityPaths(FullSubentityPath[], IntPtr[], Vector3d, MoveGripPointsFlags)
 Entity.GetSubentityGeometricExtents(FullSubentityPath)
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, IntPtr, Point3d, Matrix3d, ObjectId[])
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, long, Point3d, Matrix3d, int, ObjectId[])
 Entity.GetGraphicsMarkersAtSubentityPathIntPtr(FullSubentityPath)
 Entity.Highlight(FullSubentityPath, bool)
 Entity.Highlight()
 Entity.Unhighlight(FullSubentityPath, bool)
 Entity.Unhighlight()
 Entity.PushHighlight(FullSubentityPath, HighlightStyle)
 Entity.PopHighlight(FullSubentityPath)
 Entity.HighlightState(FullSubentityPath)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection, Matrix3d)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection)
 Entity.IsContentSnappable()
 Entity.GetGripPoints(GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.GetGripPoints(Point3dCollection, IntegerCollection, IntegerCollection)
 Entity.MoveGripPointsAt(GripDataCollection, Vector3d, MoveGripPointsFlags)
 Entity.MoveGripPointsAt(IntegerCollection, Vector3d)
 Entity.GetStretchPoints(Point3dCollection)
 Entity.MoveStretchPointsAt(IntegerCollection, Vector3d)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.List()
 Entity.TransformBy(Matrix3d)
 Entity.GetTransformedCopy(Matrix3d)
 Entity.GetSubentity(FullSubentityPath)
 Entity.Explode(DBObjectCollection)
 Entity.RecordGraphicsModified(bool)
 Entity.Draw()
 Entity.SaveAs(WorldDraw, SaveType)
 Entity.SetDatabaseDefaults(Database)
 Entity.SetDatabaseDefaults()
 Entity.SetDragStatus(DragStatus)
 Entity.SetGripStatus(GripStatus)
 Entity.SetSubentityGripStatus(GripStatus, FullSubentityPath)
 Entity.JoinEntity(Entity)
 Entity.JoinEntities(Entity[])
 Entity.EdgeStyleId
 Entity.FaceStyleId
 Entity.VisualStyleId
 Entity.ForceAnnoAllVisible
 Entity.BlockName
 Entity.MaterialMapper
 Entity.MaterialId
 Entity.Material
 Entity.ReceiveShadows
 Entity.CastShadows
 Entity.Hyperlinks
 Entity.CloneMeForDragging
 Entity.CompoundObjectTransform
 Entity.GeometricExtents
 Entity.Ecs
 Entity.IsPlanar
 Entity.CollisionType
 Entity.LineWeight
 Entity.Visible
 Entity.LinetypeScale
 Entity.LinetypeId
 Entity.Linetype
 Entity.LayerId
 Entity.Layer
 Entity.PlotStyleNameId
 Entity.PlotStyleName
 Entity.Transparency
 Entity.EntityColor
 Entity.ColorIndex
 Entity.Color
 Entity.BlockId
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Dimension(IntPtr, bool)
protected Dimension(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 AltSuppressLeadingZeros
public virtual bool AltSuppressLeadingZeros { get; set; }
Property Value
bool
 AltSuppressTrailingZeros
public virtual bool AltSuppressTrailingZeros { get; set; }
Property Value
bool
 AltSuppressZeroFeet
public virtual bool AltSuppressZeroFeet { get; set; }
Property Value
bool
 AltSuppressZeroInches
public virtual bool AltSuppressZeroInches { get; set; }
Property Value
bool
 AltToleranceSuppressLeadingZeros
public virtual bool AltToleranceSuppressLeadingZeros { get; set; }
Property Value
bool
 AltToleranceSuppressTrailingZeros
public virtual bool AltToleranceSuppressTrailingZeros { get; set; }
Property Value
bool
 AltToleranceSuppressZeroFeet
public virtual bool AltToleranceSuppressZeroFeet { get; set; }
Property Value
bool
 AltToleranceSuppressZeroInches
public virtual bool AltToleranceSuppressZeroInches { get; set; }
Property Value
bool
 AlternatePrefix
public virtual string AlternatePrefix { get; set; }
Property Value
string
 AlternateSuffix
public virtual string AlternateSuffix { get; set; }
Property Value
string
 CenterMarkSize
[UnitType(UnitType.Unitless)]
public virtual double CenterMarkSize { get; }
Property Value
double
 CenterMarkType
public virtual DimensionCenterMarkType CenterMarkType { get; }
Property Value
DimensionCenterMarkType
 DimBlockId
public ObjectId DimBlockId { get; set; }
Property Value
ObjectId
 DimBlockPosition
public Point3d DimBlockPosition { get; }
Property Value
Point3d
 Dimadec
public virtual int Dimadec { get; set; }
Property Value
int
 Dimalt
public virtual bool Dimalt { get; set; }
Property Value
bool
 Dimaltd
public virtual int Dimaltd { get; set; }
Property Value
int
 Dimaltf
[UnitType(UnitType.Unitless)]
public virtual double Dimaltf { get; set; }
Property Value
double
 Dimaltmzf
[UnitType(UnitType.Unitless)]
public virtual double Dimaltmzf { get; set; }
Property Value
double
 Dimaltmzs
public virtual string Dimaltmzs { get; set; }
Property Value
string
 Dimaltrnd
[UnitType(UnitType.Distance)]
public virtual double Dimaltrnd { get; set; }
Property Value
double
 Dimalttd
public virtual int Dimalttd { get; set; }
Property Value
int
 Dimalttz
public virtual int Dimalttz { get; set; }
Property Value
int
 Dimaltu
public virtual int Dimaltu { get; set; }
Property Value
int
 Dimaltz
public virtual int Dimaltz { get; set; }
Property Value
int
 Dimapost
public virtual string Dimapost { get; set; }
Property Value
string
 Dimarcsym
public virtual int Dimarcsym { get; set; }
Property Value
int
 Dimasz
[UnitType(UnitType.Distance)]
public virtual double Dimasz { get; set; }
Property Value
double
 Dimatfit
public virtual int Dimatfit { get; set; }
Property Value
int
 Dimaunit
public virtual int Dimaunit { get; set; }
Property Value
int
 Dimazin
public virtual int Dimazin { get; set; }
Property Value
int
 Dimblk
public virtual ObjectId Dimblk { get; set; }
Property Value
ObjectId
 Dimblk1
public virtual ObjectId Dimblk1 { get; set; }
Property Value
ObjectId
 Dimblk2
public virtual ObjectId Dimblk2 { get; set; }
Property Value
ObjectId
 Dimcen
[UnitType(UnitType.Distance)]
public virtual double Dimcen { get; set; }
Property Value
double
 Dimclrd
public virtual Color Dimclrd { get; set; }
Property Value
Color
 Dimclre
public virtual Color Dimclre { get; set; }
Property Value
Color
 Dimclrt
public virtual Color Dimclrt { get; set; }
Property Value
Color
 Dimdec
public virtual int Dimdec { get; set; }
Property Value
int
 Dimdle
[UnitType(UnitType.Distance)]
public virtual double Dimdle { get; set; }
Property Value
double
 Dimdli
[UnitType(UnitType.Distance)]
public virtual double Dimdli { get; set; }
Property Value
double
 Dimdsep
public virtual char Dimdsep { get; set; }
Property Value
char
 DimensionStyle
public ObjectId DimensionStyle { get; set; }
Property Value
ObjectId
 DimensionStyleName
public virtual string DimensionStyleName { get; set; }
Property Value
string
 DimensionText
public string DimensionText { get; set; }
Property Value
string
 Dimexe
[UnitType(UnitType.Distance)]
public virtual double Dimexe { get; set; }
Property Value
double
 Dimexo
[UnitType(UnitType.Distance)]
public virtual double Dimexo { get; set; }
Property Value
double
 Dimfrac
public virtual int Dimfrac { get; set; }
Property Value
int
 Dimfxlen
[UnitType(UnitType.Distance)]
public virtual double Dimfxlen { get; set; }
Property Value
double
 DimfxlenOn
public virtual bool DimfxlenOn { get; set; }
Property Value
bool
 Dimgap
[UnitType(UnitType.Distance)]
public virtual double Dimgap { get; set; }
Property Value
double
 Dimjogang
[UnitType(UnitType.AngleNotTransformed)]
public virtual double Dimjogang { get; set; }
Property Value
double
 Dimjust
public virtual int Dimjust { get; set; }
Property Value
int
 Dimldrblk
public virtual ObjectId Dimldrblk { get; set; }
Property Value
ObjectId
 Dimlfac
[UnitType(UnitType.Unitless)]
public virtual double Dimlfac { get; set; }
Property Value
double
 Dimlim
public virtual bool Dimlim { get; set; }
Property Value
bool
 Dimltex1
public virtual ObjectId Dimltex1 { get; set; }
Property Value
ObjectId
 Dimltex2
public virtual ObjectId Dimltex2 { get; set; }
Property Value
ObjectId
 Dimltype
public virtual ObjectId Dimltype { get; set; }
Property Value
ObjectId
 Dimlunit
public virtual int Dimlunit { get; set; }
Property Value
int
 Dimlwd
public virtual LineWeight Dimlwd { get; set; }
Property Value
LineWeight
 Dimlwe
public virtual LineWeight Dimlwe { get; set; }
Property Value
LineWeight
 Dimmzf
[UnitType(UnitType.Unitless)]
public virtual double Dimmzf { get; set; }
Property Value
double
 Dimmzs
public virtual string Dimmzs { get; set; }
Property Value
string
 Dimpost
public virtual string Dimpost { get; set; }
Property Value
string
 Dimrnd
[UnitType(UnitType.Distance)]
public virtual double Dimrnd { get; set; }
Property Value
double
 Dimsah
public virtual bool Dimsah { get; set; }
Property Value
bool
 Dimscale
[UnitType(UnitType.Unitless)]
public virtual double Dimscale { get; set; }
Property Value
double
 Dimsd1
public virtual bool Dimsd1 { get; set; }
Property Value
bool
 Dimsd2
public virtual bool Dimsd2 { get; set; }
Property Value
bool
 Dimse1
public virtual bool Dimse1 { get; set; }
Property Value
bool
 Dimse2
public virtual bool Dimse2 { get; set; }
Property Value
bool
 Dimsoxd
public virtual bool Dimsoxd { get; set; }
Property Value
bool
 Dimtad
public virtual int Dimtad { get; set; }
Property Value
int
 Dimtdec
public virtual int Dimtdec { get; set; }
Property Value
int
 Dimtfac
[UnitType(UnitType.Unitless)]
public virtual double Dimtfac { get; set; }
Property Value
double
 Dimtfill
public virtual int Dimtfill { get; set; }
Property Value
int
 Dimtfillclr
public virtual Color Dimtfillclr { get; set; }
Property Value
Color
 Dimtih
public virtual bool Dimtih { get; set; }
Property Value
bool
 Dimtix
public virtual bool Dimtix { get; set; }
Property Value
bool
 Dimtm
[UnitType(UnitType.Unitless)]
public virtual double Dimtm { get; set; }
Property Value
double
 Dimtmove
public virtual int Dimtmove { get; set; }
Property Value
int
 Dimtofl
public virtual bool Dimtofl { get; set; }
Property Value
bool
 Dimtoh
public virtual bool Dimtoh { get; set; }
Property Value
bool
 Dimtol
public virtual bool Dimtol { get; set; }
Property Value
bool
 Dimtolj
public virtual int Dimtolj { get; set; }
Property Value
int
 Dimtp
[UnitType(UnitType.Unitless)]
public virtual double Dimtp { get; set; }
Property Value
double
 Dimtsz
[UnitType(UnitType.Distance)]
public virtual double Dimtsz { get; set; }
Property Value
double
 Dimtvp
[UnitType(UnitType.Unitless)]
public virtual double Dimtvp { get; set; }
Property Value
double
 Dimtxt
[UnitType(UnitType.Distance)]
public virtual double Dimtxt { get; set; }
Property Value
double
 Dimtxtdirection
public virtual bool Dimtxtdirection { get; set; }
Property Value
bool
 Dimtzin
public virtual int Dimtzin { get; set; }
Property Value
int
 Dimupt
public virtual bool Dimupt { get; set; }
Property Value
bool
 Dimzin
public virtual int Dimzin { get; set; }
Property Value
int
 DynamicDimension
public bool DynamicDimension { get; set; }
Property Value
bool
 Elevation
[UnitType(UnitType.Distance)]
public double Elevation { get; set; }
Property Value
double
 HorizontalRotation
[UnitType(UnitType.AngleNotTransformed)]
public double HorizontalRotation { get; set; }
Property Value
double
 Measurement
[UnitType(UnitType.Distance)]
public double Measurement { get; }
Property Value
double
 Normal
public Vector3d Normal { get; set; }
Property Value
Vector3d
 Prefix
public virtual string Prefix { get; set; }
Property Value
string
 Suffix
public virtual string Suffix { get; set; }
Property Value
string
 SuppressAngularLeadingZeros
public virtual bool SuppressAngularLeadingZeros { get; set; }
Property Value
bool
 SuppressAngularTrailingZeros
public virtual bool SuppressAngularTrailingZeros { get; set; }
Property Value
bool
 SuppressLeadingZeros
public virtual bool SuppressLeadingZeros { get; set; }
Property Value
bool
 SuppressTrailingZeros
public virtual bool SuppressTrailingZeros { get; set; }
Property Value
bool
 SuppressZeroFeet
public virtual bool SuppressZeroFeet { get; set; }
Property Value
bool
 SuppressZeroInches
public virtual bool SuppressZeroInches { get; set; }
Property Value
bool
 TextAttachment
public AttachmentPoint TextAttachment { get; set; }
Property Value
AttachmentPoint
 TextDefinedSize
public Vector2d TextDefinedSize { get; set; }
Property Value
Vector2d
 TextLineSpacingFactor
[UnitType(UnitType.Unitless)]
public double TextLineSpacingFactor { get; set; }
Property Value
double
 TextLineSpacingStyle
public LineSpacingStyle TextLineSpacingStyle { get; set; }
Property Value
LineSpacingStyle
 TextPosition
public Point3d TextPosition { get; set; }
Property Value
Point3d
 TextRotation
[UnitType(UnitType.AngleNotTransformed)]
public double TextRotation { get; set; }
Property Value
double
 TextStyleId
public virtual ObjectId TextStyleId { get; set; }
Property Value
ObjectId
 ToleranceSuppressLeadingZeros
public virtual bool ToleranceSuppressLeadingZeros { get; set; }
Property Value
bool
 ToleranceSuppressTrailingZeros
public virtual bool ToleranceSuppressTrailingZeros { get; set; }
Property Value
bool
 ToleranceSuppressZeroFeet
public virtual bool ToleranceSuppressZeroFeet { get; set; }
Property Value
bool
 ToleranceSuppressZeroInches
public virtual bool ToleranceSuppressZeroInches { get; set; }
Property Value
bool
 UsingDefaultTextPosition
public bool UsingDefaultTextPosition { get; set; }
Property Value
bool
Methods
 FieldFromMText(MText)
public void FieldFromMText(MText dimMText)
Parameters
dimMText MText
 FieldToMText(MText)
public void FieldToMText(MText dimMText)
Parameters
dimMText MText
 FormatMeasurement(double, string)
public string FormatMeasurement(double measurement, string dimensionText)
Parameters
measurement double
dimensionText string
Returns
string
 GenerateLayout()
public void GenerateLayout()
 GetDimstyleData()
public DimStyleTableRecord GetDimstyleData()
Returns
DimStyleTableRecord
 RecomputeDimensionBlock(bool)
public void RecomputeDimensionBlock(bool forceUpdate)
Parameters
forceUpdate bool
 RemoveTextField()
public void RemoveTextField()
 ResetTextDefinedSize()
public void ResetTextDefinedSize()
 SetDimstyleData(DimStyleTableRecord)
public void SetDimstyleData(DimStyleTableRecord style)
Parameters
style DimStyleTableRecord