Table of Contents
 Enum DeepCloneType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::DeepCloneType")]
public enum DeepCloneType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Block = 2
Copy = 0
Explode = 1
Insert = 6
InsertCopy = 10
Objects = 8
SymbolTableMerge = 4
Wblock = 7
WblockObjects = 11
XrefBind = 3
XrefInsert = 9