Table of Contents
 Enum Variable.StorageType
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public enum Variable.StorageType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
PerDatabase = 3
PerProfile = 2
PerSession = 0
PerUser = 1
PerViewport = 4