Table of Contents
 Enum TextAngleType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMLeaderStyle::TextAngleType")]
public enum TextAngleType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AlwaysRightReadingAngle = 2
HorizontalAngle = 1
InsertAngle = 0