Table of Contents
 Delegate BeginWblockEntireDatabaseEventHandler
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public delegate void BeginWblockEntireDatabaseEventHandler(object sender, BeginWblockEntireDatabaseEventArgs e)
Parameters
sender object
e BeginWblockEntireDatabaseEventArgs
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 BeginWblockEntireDatabaseEventHandler(object, IntPtr)
public BeginWblockEntireDatabaseEventHandler(object A_0, IntPtr A_1)
Parameters
A_0 object
A_1 IntPtr
Methods
 BeginInvoke(object, BeginWblockEntireDatabaseEventArgs, AsyncCallback, object)
public IAsyncResult BeginInvoke(object sender, BeginWblockEntireDatabaseEventArgs e, AsyncCallback callback, object obj)
Parameters
sender object
e BeginWblockEntireDatabaseEventArgs
callback AsyncCallback
obj object
Returns
IAsyncResult
 EndInvoke(IAsyncResult)
public void EndInvoke(IAsyncResult result)
Parameters
result IAsyncResult
 Invoke(object, BeginWblockEntireDatabaseEventArgs)
public void Invoke(object sender, BeginWblockEntireDatabaseEventArgs e)
Parameters
sender object
e BeginWblockEntireDatabaseEventArgs