Table of Contents
 Enum AnnotationType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbLeader::AnnoType")]
public enum AnnotationType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BlockRef = 2
FeatureControlFrame = 1
MText = 0
NoAnnotation = 3