Table of Contents
 Enum Planarity
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::Planarity")]
public enum Planarity
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Linear = 2
NonPlanar = 0
Planar = 1