Table of Contents
 Class Viewport
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbViewport")]
public class Viewport : Entity, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
Entity
Viewport
Implements
IDisposable
ICloneable
Inherited Members
 Entity.SetLayerId(ObjectId, bool)
 Entity.SetPropertiesFrom(Entity)
 Entity.GetPlane()
 Entity.AddSubentityPaths(FullSubentityPath[])
 Entity.DeleteSubentityPaths(FullSubentityPath[])
 Entity.TransformSubentityPathsBy(FullSubentityPath[], Matrix3d)
 Entity.GetGripPointsAtSubentityPath(FullSubentityPath, GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.MoveGripPointsAtSubentityPaths(FullSubentityPath[], IntPtr[], Vector3d, MoveGripPointsFlags)
 Entity.GetSubentityGeometricExtents(FullSubentityPath)
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, IntPtr, Point3d, Matrix3d, ObjectId[])
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, long, Point3d, Matrix3d, int, ObjectId[])
 Entity.GetGraphicsMarkersAtSubentityPathIntPtr(FullSubentityPath)
 Entity.Highlight(FullSubentityPath, bool)
 Entity.Highlight()
 Entity.Unhighlight(FullSubentityPath, bool)
 Entity.Unhighlight()
 Entity.PushHighlight(FullSubentityPath, HighlightStyle)
 Entity.PopHighlight(FullSubentityPath)
 Entity.HighlightState(FullSubentityPath)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection, Matrix3d)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection)
 Entity.IsContentSnappable()
 Entity.GetGripPoints(GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.GetGripPoints(Point3dCollection, IntegerCollection, IntegerCollection)
 Entity.MoveGripPointsAt(GripDataCollection, Vector3d, MoveGripPointsFlags)
 Entity.MoveGripPointsAt(IntegerCollection, Vector3d)
 Entity.GetStretchPoints(Point3dCollection)
 Entity.MoveStretchPointsAt(IntegerCollection, Vector3d)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.List()
 Entity.TransformBy(Matrix3d)
 Entity.GetTransformedCopy(Matrix3d)
 Entity.GetSubentity(FullSubentityPath)
 Entity.Explode(DBObjectCollection)
 Entity.RecordGraphicsModified(bool)
 Entity.Draw()
 Entity.SaveAs(WorldDraw, SaveType)
 Entity.SetDatabaseDefaults(Database)
 Entity.SetDatabaseDefaults()
 Entity.SetDragStatus(DragStatus)
 Entity.SetGripStatus(GripStatus)
 Entity.SetSubentityGripStatus(GripStatus, FullSubentityPath)
 Entity.JoinEntity(Entity)
 Entity.JoinEntities(Entity[])
 Entity.EdgeStyleId
 Entity.FaceStyleId
 Entity.ForceAnnoAllVisible
 Entity.BlockName
 Entity.MaterialMapper
 Entity.MaterialId
 Entity.Material
 Entity.ReceiveShadows
 Entity.CastShadows
 Entity.Hyperlinks
 Entity.CloneMeForDragging
 Entity.CompoundObjectTransform
 Entity.GeometricExtents
 Entity.Ecs
 Entity.IsPlanar
 Entity.CollisionType
 Entity.LineWeight
 Entity.Visible
 Entity.LinetypeScale
 Entity.LinetypeId
 Entity.Linetype
 Entity.LayerId
 Entity.Layer
 Entity.PlotStyleNameId
 Entity.PlotStyleName
 Entity.Transparency
 Entity.EntityColor
 Entity.ColorIndex
 Entity.Color
 Entity.BlockId
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Viewport()
public Viewport()
 Viewport(IntPtr, bool)
protected Viewport(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 AmbientLightColor
public Color AmbientLightColor { get; set; }
Property Value
Color
 AnnotationScale
public AnnotationScale AnnotationScale { get; set; }
Property Value
AnnotationScale
 BackClipDistance
[UnitType(UnitType.Distance)]
public double BackClipDistance { get; set; }
Property Value
double
 BackClipOn
public bool BackClipOn { get; set; }
Property Value
bool
 Background
public ObjectId Background { get; set; }
Property Value
ObjectId
 Brightness
[UnitType(UnitType.Unitless)]
public double Brightness { get; set; }
Property Value
double
 CenterPoint
public Point3d CenterPoint { get; set; }
Property Value
Point3d
 CircleSides
public int CircleSides { get; set; }
Property Value
int
 Contrast
[UnitType(UnitType.Unitless)]
public double Contrast { get; set; }
Property Value
double
 CustomScale
[UnitType(UnitType.Unitless)]
public double CustomScale { get; set; }
Property Value
double
 DefaultLightingOn
public bool DefaultLightingOn { get; set; }
Property Value
bool
 DefaultLightingType
public DefaultLightingType DefaultLightingType { get; set; }
Property Value
DefaultLightingType
 EffectivePlotStyleSheet
public string EffectivePlotStyleSheet { get; }
Property Value
string
 Elevation
[UnitType(UnitType.Distance)]
public double Elevation { get; set; }
Property Value
double
 FastZoomOn
public bool FastZoomOn { get; set; }
Property Value
bool
 FrontClipAtEyeOn
public bool FrontClipAtEyeOn { get; set; }
Property Value
bool
 FrontClipDistance
[UnitType(UnitType.Distance)]
public double FrontClipDistance { get; set; }
Property Value
double
 FrontClipOn
public bool FrontClipOn { get; set; }
Property Value
bool
 GridAdaptive
public bool GridAdaptive { get; set; }
Property Value
bool
 GridBoundToLimits
public bool GridBoundToLimits { get; set; }
Property Value
bool
 GridFollow
public bool GridFollow { get; set; }
Property Value
bool
 GridIncrement
public Vector2d GridIncrement { get; set; }
Property Value
Vector2d
 GridMajor
public short GridMajor { get; set; }
Property Value
short
 GridOn
public bool GridOn { get; set; }
Property Value
bool
 GridSubdivisionRestricted
public bool GridSubdivisionRestricted { get; set; }
Property Value
bool
 Height
[UnitType(UnitType.Distance)]
public double Height { get; set; }
Property Value
double
 HiddenLinesRemoved
public bool HiddenLinesRemoved { get; set; }
Property Value
bool
 LensLength
[UnitType(UnitType.Distance)]
public double LensLength { get; set; }
Property Value
double
 LinkedToSheetView
public bool LinkedToSheetView { get; }
Property Value
bool
 Locked
public bool Locked { get; set; }
Property Value
bool
 NonRectClipEntityId
public ObjectId NonRectClipEntityId { get; set; }
Property Value
ObjectId
 NonRectClipOn
public bool NonRectClipOn { get; set; }
Property Value
bool
 Number
public int Number { get; }
Property Value
int
 On
public bool On { get; set; }
Property Value
bool
 PerspectiveOn
public bool PerspectiveOn { get; set; }
Property Value
bool
 PlotAsRaster
public bool PlotAsRaster { get; }
Property Value
bool
 PlotStyleSheet
public string PlotStyleSheet { get; set; }
Property Value
string
 PlotWireframe
public bool PlotWireframe { get; }
Property Value
bool
 ShadePlot
public ShadePlotType ShadePlot { get; set; }
Property Value
ShadePlotType
 ShadePlotId
public ObjectId ShadePlotId { get; }
Property Value
ObjectId
 SnapAngle
[UnitType(UnitType.AngleNotTransformed)]
public double SnapAngle { get; set; }
Property Value
double
 SnapBasePoint
public Point2d SnapBasePoint { get; set; }
Property Value
Point2d
 SnapIncrement
public Vector2d SnapIncrement { get; set; }
Property Value
Vector2d
 SnapIsoPair
public int SnapIsoPair { get; set; }
Property Value
int
 SnapIsometric
public bool SnapIsometric { get; set; }
Property Value
bool
 SnapOn
public bool SnapOn { get; set; }
Property Value
bool
 StandardScale
public StandardScaleType StandardScale { get; set; }
Property Value
StandardScaleType
 SunId
public ObjectId SunId { get; }
Property Value
ObjectId
 Thumbnail
public Bitmap Thumbnail { get; set; }
Property Value
Bitmap
 ToneOperatorParameters
public ToneOperatorParameters ToneOperatorParameters { get; set; }
Property Value
ToneOperatorParameters
 Transparent
public bool Transparent { get; set; }
Property Value
bool
 TwistAngle
[UnitType(UnitType.AngleNotTransformed)]
public double TwistAngle { get; set; }
Property Value
double
 UcsFollowModeOn
public bool UcsFollowModeOn { get; set; }
Property Value
bool
 UcsIconAtOrigin
public bool UcsIconAtOrigin { get; set; }
Property Value
bool
 UcsIconVisible
public bool UcsIconVisible { get; set; }
Property Value
bool
 UcsName
public ObjectId UcsName { get; }
Property Value
ObjectId
 UcsOrthographic
public OrthographicView UcsOrthographic { get; }
Property Value
OrthographicView
 UcsPerViewport
public bool UcsPerViewport { get; set; }
Property Value
bool
 ViewCenter
public Point2d ViewCenter { get; set; }
Property Value
Point2d
 ViewDirection
public Vector3d ViewDirection { get; set; }
Property Value
Vector3d
 ViewHeight
[UnitType(UnitType.Distance)]
public double ViewHeight { get; set; }
Property Value
double
 ViewOrthographic
public OrthographicView ViewOrthographic { get; }
Property Value
OrthographicView
 ViewTarget
public Point3d ViewTarget { get; set; }
Property Value
Point3d
 VisualStyleId
public ObjectId VisualStyleId { get; set; }
Property Value
ObjectId
 Width
[UnitType(UnitType.Distance)]
public double Width { get; set; }
Property Value
double
Methods
 FreezeLayersInViewport(IEnumerator)
public void FreezeLayersInViewport(IEnumerator layerIds)
Parameters
layerIds IEnumerator
 GetFrozenLayers()
public ObjectIdCollection GetFrozenLayers()
Returns
ObjectIdCollection
 GetPreviousBackground(DrawableType)
public ObjectId GetPreviousBackground(DrawableType type)
Parameters
type DrawableType
Returns
ObjectId
 GetUcs(Point3d, Vector3d, Vector3d)
public void GetUcs(Point3d origin, Vector3d x, Vector3d y)
Parameters
origin Point3d
x Vector3d
y Vector3d
 IsLayerFrozenInViewport(ObjectId)
public bool IsLayerFrozenInViewport(ObjectId layerId)
Parameters
layerId ObjectId
Returns
bool
 SetPreviousBackground(ObjectId, DrawableType)
public void SetPreviousBackground(ObjectId value, DrawableType type)
Parameters
value ObjectId
type DrawableType
 SetShadePlot(ShadePlotType, ObjectId)
public void SetShadePlot(ShadePlotType type, ObjectId shadePlotId)
Parameters
type ShadePlotType
shadePlotId ObjectId
 SetSun(DBObject)
public ObjectId SetSun(DBObject sun)
Parameters
sun DBObject
Returns
ObjectId
 SetUcs(ObjectId)
public void SetUcs(ObjectId userCoordinateSystemId)
Parameters
userCoordinateSystemId ObjectId
 SetUcs(OrthographicView)
public void SetUcs(OrthographicView view)
Parameters
view OrthographicView
 SetUcs(Point3d, Vector3d, Vector3d)
public void SetUcs(Point3d origin, Vector3d x, Vector3d y)
Parameters
origin Point3d
x Vector3d
y Vector3d
 SetUcsToWorld()
public void SetUcsToWorld()
 SetViewDirection(OrthographicView)
public void SetViewDirection(OrthographicView view)
Parameters
view OrthographicView
 ThawAllLayersInViewport()
public void ThawAllLayersInViewport()
 ThawLayersInViewport(IEnumerator)
public void ThawLayersInViewport(IEnumerator layerIds)
Parameters
layerIds IEnumerator
 UpdateDisplay()
public void UpdateDisplay()