Table of Contents
 Class SurfaceSurfaceIntersector
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeSurfSurfInt")]
public sealed class SurfaceSurfaceIntersector : Entity3d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
SurfaceSurfaceIntersector
Implements
IDisposable
ICloneable
Inherited Members
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.IsOn(Point3d)
 Entity3d.IsOn(Point3d, Tolerance)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 SurfaceSurfaceIntersector()
public SurfaceSurfaceIntersector()
 SurfaceSurfaceIntersector(Surface, Surface)
public SurfaceSurfaceIntersector(Surface surface2, Surface surface1)
Parameters
surface2 Surface
surface1 Surface
 SurfaceSurfaceIntersector(Surface, Surface, Tolerance)
public SurfaceSurfaceIntersector(Surface surface2, Surface surface1, Tolerance tolerance)
Parameters
surface2 Surface
surface1 Surface
tolerance Tolerance
Properties
 NumResults
public int NumResults { get; }
Property Value
int
 Surface1
public Surface Surface1 { get; }
Property Value
Surface
 Surface2
public Surface Surface2 { get; }
Property Value
Surface
 Tolerance
public Tolerance Tolerance { get; }
Property Value
Tolerance
Methods
 Create(IntPtr, bool)
public static SurfaceSurfaceIntersector Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
SurfaceSurfaceIntersector
 GetDimension(int)
public int GetDimension(int number)
Parameters
number int
Returns
int
 GetIntersectPointParameters(int)
public Point2d[] GetIntersectPointParameters(int number)
Parameters
number int
Returns
Point2d[]
 GetIntersectionConfigurations(int)
public SurfaceSurfaceIntersectorConfigurations GetIntersectionConfigurations(int number)
Parameters
number int
Returns
SurfaceSurfaceIntersectorConfigurations
 GetType(int)
public SurfaceSurfaceIntersectorType GetType(int number)
Parameters
number int
Returns
SurfaceSurfaceIntersectorType
 IntersectCurve(int, bool)
public Curve3d IntersectCurve(int number, bool isExternal)
Parameters
number int
isExternal bool
Returns
Curve3d
 IntersectParameterCurve(int, bool, bool)
public Curve2d IntersectParameterCurve(int number, bool isExternal, bool isFirst)
Parameters
number int
isExternal bool
isFirst bool
Returns
Curve2d
 IntersectPoint(int)
public Point3d IntersectPoint(int number)
Parameters
number int
Returns
Point3d
 Set(Surface, Surface)
public void Set(Surface surface1, Surface surface2)
Parameters
surface1 Surface
surface2 Surface
 Set(Surface, Surface, Tolerance)
public void Set(Surface surface1, Surface surface2, Tolerance tolerance)
Parameters
surface1 Surface
surface2 Surface
tolerance Tolerance