Table of Contents
 Enum ModelerFlavor
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbHostApplicationServices::ModelerFlavor")]
public enum ModelerFlavor
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Full = 0
ObjectsOnly = 2
RegionsOnly = 1