Table of Contents
 Class DrawableTraits
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiDrawableTraits")]
public abstract class DrawableTraits : SubEntityTraits, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
SubEntityTraits
DrawableTraits
Implements
IDisposable
ICloneable
Derived
NonEntityTraits
ViewportTraits
VisualStyleTraits
Inherited Members
 SubEntityTraits.SetSelectionMarker(IntPtr)
 SubEntityTraits.Fill
 SubEntityTraits.LineType
 SubEntityTraits.Layer
 SubEntityTraits.Transparency
 SubEntityTraits.TrueColor
 SubEntityTraits.Color
 SubEntityTraits.SelectionOnlyGeometry
 SubEntityTraits.ShadowFlags
 SubEntityTraits.DrawFlags
 SubEntityTraits.VisualStyle
 SubEntityTraits.Sectionable
 SubEntityTraits.Mapper
 SubEntityTraits.Material
 SubEntityTraits.PlotStyleDescriptor
 SubEntityTraits.Thickness
 SubEntityTraits.LineTypeScale
 SubEntityTraits.LineWeight
 SubEntityTraits.FillType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DrawableTraits()
protected DrawableTraits()
Properties
 LinePattern
public abstract Linetype LinePattern { get; set; }
Property Value
Linetype
 SelectionFlags
public abstract SelectionFlags SelectionFlags { get; set; }
Property Value
SelectionFlags
Methods
 AddLight(ObjectId)
public abstract void AddLight(ObjectId lightId)
Parameters
lightId ObjectId
 GetHighlightProperty(HighlightProperty)
public abstract object GetHighlightProperty(DrawableTraits.HighlightProperty propertyType)
Parameters
propertyType DrawableTraits.HighlightProperty
Returns
object
 SetHighlightProperty(HighlightProperty, object)
public abstract void SetHighlightProperty(DrawableTraits.HighlightProperty propertyType, object value)
Parameters
propertyType DrawableTraits.HighlightProperty
value object
 SetLayerFlags(LayerFlags)
protected abstract void SetLayerFlags(DrawableTraits.LayerFlags flags)
Parameters
flags DrawableTraits.LayerFlags
 SetupForEntity(Entity)
public virtual void SetupForEntity(Entity entity)
Parameters
entity Entity