Table of Contents
 Enum AssocStatus
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocStatus")]
public enum AssocStatus
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ChangedDirectlyAssocStatus = 1
ChangedNoDifferenceAssocStatus = 3
ChangedTransitivelyAssocStatus = 2
ErasedAssocStatus = 5
FailedToEvaluateAssocStatus = 4
IsUpToDateAssocStatus = 0
SuppressedAssocStatus = 6