Table of Contents
 Struct FieldEvaluationStatusResult
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct FieldEvaluationStatusResult
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 FieldEvaluationStatusResult(FieldEvaluationStatus, int, string)
public FieldEvaluationStatusResult(FieldEvaluationStatus s, int e, string m)
Parameters
s FieldEvaluationStatus
e int
m string
Properties
 ErrorCode
public int ErrorCode { get; }
Property Value
int
 ErrorMessage
public string ErrorMessage { get; }
Property Value
string
 Status
public FieldEvaluationStatus Status { get; }
Property Value
FieldEvaluationStatus