Table of Contents
 Struct NurbsData
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct NurbsData
Inherited Members
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Properties
 Closed
public bool Closed { get; }
Property Value
bool
 ControlPointTolerance
[UnitType(UnitType.Distance)]
public double ControlPointTolerance { get; }
Property Value
double
 Degree
public int Degree { get; }
Property Value
int
 KnotTolerance
[UnitType(UnitType.Distance)]
public double KnotTolerance { get; }
Property Value
double
 Periodic
public bool Periodic { get; }
Property Value
bool
 Rational
public bool Rational { get; }
Property Value
bool
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetControlPoints()
public Point3dCollection GetControlPoints()
Returns
Point3dCollection
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 GetKnots()
public DoubleCollection GetKnots()
Returns
DoubleCollection
 GetWeights()
public DoubleCollection GetWeights()
Returns
DoubleCollection
 IsEqualTo(NurbsData)
public bool IsEqualTo(NurbsData other)
Parameters
other NurbsData
Returns
bool
 IsEqualTo(NurbsData, Tolerance)
public bool IsEqualTo(NurbsData other, Tolerance tolerance)
Parameters
other NurbsData
tolerance Tolerance
Returns
bool
Operators
 operator ==(NurbsData, NurbsData)
public static bool operator ==(NurbsData a, NurbsData b)
Parameters
a NurbsData
b NurbsData
Returns
bool
 operator !=(NurbsData, NurbsData)
public static bool operator !=(NurbsData a, NurbsData b)
Parameters
a NurbsData
b NurbsData
Returns
bool