Table of Contents
 Struct RenderEnvironment.DoubleRangeParameter
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct RenderEnvironment.DoubleRangeParameter
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 DoubleRangeParameter(double, double)
public DoubleRangeParameter(double n, double f)
Parameters
n double
f double
Properties
 Far
[UnitType(UnitType.Distance)]
public double Far { get; }
Property Value
double
 Near
[UnitType(UnitType.Distance)]
public double Near { get; }
Property Value
double