Table of Contents
 Enum StandardScaleType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbViewport::StandardScaleType")]
public enum StandardScaleType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CustomScale = 1
Scale100To1 = 18
Scale10To1 = 17
Scale1To1 = 2
Scale1To10 = 7
Scale1To100 = 13
Scale1To128inAnd1ft = 19
Scale1To16 = 8
Scale1To16inchAnd1ft = 22
Scale1To2 = 3
Scale1To20 = 9
Scale1To2inchAnd1ft = 28
Scale1To30 = 10
Scale1To32inchAnd1ft = 21
Scale1To4 = 4
Scale1To40 = 11
Scale1To4inchAnd1ft = 26
Scale1To5 = 5
Scale1To50 = 12
Scale1To64inchAnd1ft = 20
Scale1To8 = 6
Scale1To8inchAnd1ft = 24
Scale1ftAnd1ft = 34
Scale1inAnd1ft = 30
Scale2To1 = 14
Scale3To16inchAnd1ft = 25
Scale3To32inchAnd1ft = 23
Scale3To4inchAnd1ft = 29
Scale3To8inchAnd1ft = 27
Scale3inAnd1ft = 32
Scale4To1 = 15
Scale6inAnd1ft = 33
Scale8To1 = 16
ScaleToFit = 0