Table of Contents
 Class AssocArrayCommonParameters
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocArrayCommonParameters")]
public abstract class AssocArrayCommonParameters : AssocArrayParameters, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
AssocArrayParameters
AssocArrayCommonParameters
Implements
IDisposable
ICloneable
Derived
AssocArrayPathParameters
AssocArrayPolarParameters
AssocArrayRectangularParameters
Inherited Members
 AssocArrayParameters.Commit()
 AssocArrayParameters.Owner
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocArrayCommonParameters(IntPtr, bool)
protected AssocArrayCommonParameters(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 BaseNormal
public Vector3d BaseNormal { get; set; }
Property Value
Vector3d
 BasePlane
public FaceRef BasePlane { get; set; }
Property Value
FaceRef
 BasePoint
public VertexRef BasePoint { get; set; }
Property Value
VertexRef
 LevelCount
public int LevelCount { get; set; }
Property Value
int
 LevelSpacing
public double LevelSpacing { get; set; }
Property Value
double
 RowCount
public int RowCount { get; set; }
Property Value
int
 RowElevation
public double RowElevation { get; set; }
Property Value
double
 RowSpacing
public double RowSpacing { get; set; }
Property Value
double
Methods
 GetLevelCount(out string, out string)
public int GetLevelCount(out string expression, out string evaluatorId)
Parameters
expression string
evaluatorId string
Returns
int
 GetLevelSpacing(out string, out string)
public double GetLevelSpacing(out string expression, out string evaluatorId)
Parameters
expression string
evaluatorId string
Returns
double
 GetRowCount(out string, out string)
public int GetRowCount(out string expression, out string evaluatorId)
Parameters
expression string
evaluatorId string
Returns
int
 GetRowElevation(out string, out string)
public double GetRowElevation(out string expression, out string evaluatorId)
Parameters
expression string
evaluatorId string
Returns
double
 GetRowSpacing(out string, out string)
public double GetRowSpacing(out string expression, out string evaluatorId)
Parameters
expression string
evaluatorId string
Returns
double
 SetLevelCount(int, string, string)
public void SetLevelCount(int count, string expression, string evaluatorId)
Parameters
count int
expression string
evaluatorId string
 SetLevelSpacing(double, string, string)
public void SetLevelSpacing(double spacing, string expression, string evaluatorId)
Parameters
spacing double
expression string
evaluatorId string
 SetRowCount(int, string, string)
public void SetRowCount(int count, string expression, string evaluatorId)
Parameters
count int
expression string
evaluatorId string
 SetRowElevation(double, string, string)
public void SetRowElevation(double value, string expression, string evaluatorId)
Parameters
value double
expression string
evaluatorId string
 SetRowSpacing(double, string, string)
public void SetRowSpacing(double spacing, string expression, string evaluatorId)
Parameters
spacing double
expression string
evaluatorId string