Table of Contents
 Class CellContentsCollection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public sealed class CellContentsCollection : IEnumerable<CellContent>, IEnumerable
Inheritance
object
CellContentsCollection
Implements
IEnumerable<CellContent>
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Count
public virtual int Count { get; }
Property Value
int
 this[int]
public CellContent this[int i] { get; }
Parameters
i int
Property Value
CellContent
Methods
 Add()
public void Add()
 Clear()
public void Clear()
 GetEnumerator()
public IEnumerator<CellContent> GetEnumerator()
Returns
IEnumerator<CellContent>
 InsertAt(int)
public void InsertAt(int index)
Parameters
index int
 Move(int, int)
public void Move(int fromIndex, int toIndex)
Parameters
fromIndex int
toIndex int
 RemoveAt(int)
public void RemoveAt(int index)
Parameters
index int