Table of Contents
 Enum ErrorStatus
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
[Wrapper("Acad::ErrorStatus")]
public enum ErrorStatus
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AlreadyActive = 20051
AlreadyInDB = 26
AlreadyInGroup = 260
AlreadyInactive = 20052
AmbiguousInput = 4
AmbiguousOutput = 5
AnonymousEntry = 38
AtMaxReaders = 90
BackgroundPlotInProgress = 527
BadColor = 208
BadColorIndex = 202
BadDwgHeader = 314
BadDxfFile = 368
BadDxfSequence = 52
BadLayerName = 200
BadLineWeightValue = 207
BadLinetypeName = 203
BadLinetypeScale = 204
BadPaperspaceView = 169
BadPlotStyleName = 384
BadPlotStyleNameHandle = 387
BadPlotStyleType = 386
BadUcs = 168
BadVisibilityValue = 205
BadlyNestedAppData = 378
BinaryDataSizeExceeded = 391
BlockDefInEntitySection = 381
BrokenHandle = 12
BufferTooSmall = 7
CannotBeErasedByCaller = 105
CannotBeResurrected = 106
CannotChangeActiveViewport = 140
CannotChangeColumnType = 441
CannotExplodeEntity = 159
CannotNestBlockDefinitions = 59
CannotPlotToFile = 524
CannotRestoreFromAcisFile = 300
CannotScaleNonUniformly = 136
CantOpenFile = 364
CloseFailObjectDamaged = 104
CloseModifyAborted = 102
ClosePartialFailure = 103
CloseWasNotifying = 101
CommandWasInProgress = 142
ContainerNotEmpty = 18
CopyDoesNotExist = 354
CopyFailed = 356
CopyInvalidName = 357
CopyIsModelSpace = 355
CopyNameExists = 358
CreateFailed = 337
CreateInvalidName = 338
CustomSizeNotPossible = 514
DataLinkAdapterNotFound = 650
DataLinkBadConnectionString = 653
DataLinkConnectionFailed = 656
DataLinkInvalidAdapterId = 651
DataLinkNotFound = 652
DataLinkNotUpdatedYet = 654
DataLinkOtherError = 660
DataLinkSourceIsWriteProtected = 658
DataLinkSourceNotFound = 655
DatabaseObjectsOpen = 322
DegenerateGeometry = 153
DelDoesNotExist = 342
DelIsModelSpace = 343
DelLastLayout = 344
DelUnableToFind = 346
DelUnableToSetCurrent = 345
DeleteEntity = 191
DeletedEntry = 28
DeviceNotFound = 504
DocumentSwitchDisabled = 334
DuplicateBlockDefinition = 389
DuplicateBlockName = 385
DuplicateDxfField = 49
DuplicateIndex = 25
DuplicateKey = 23
DuplicateLayerName = 383
DuplicateRecordName = 95
DwgCrcDoesNotMatch = 65
DwgNeedsAFullSave = 69
DwgNeedsRecovery = 190
DwgNotRecoverable = 61
DwgObjectImproperlyRead = 67
DwgRecoveredOK = 60
DwgSentinelDoesNotMatch = 66
DwgShareDemandLoad = 500
DwgShareReadAccess = 501
DwgShareWriteAccess = 502
DwkLockFileFound = 77
DxbPartiallyRead = 64
DxbReadAborted = 70
DxfPartiallyRead = 62
DxfReadAborted = 63
EndOfFile = 41
EndOfObject = 40
EntityInInactiveLayout = 9
ExcessiveItemCount = 166
ExplodeBeforeTransform = 135
ExternalDataSizeExceeded = 125
FileAccessErr = 72
FileExists = 362
FileInternalErr = 74
FileLockedByAutoCAD = 71
FileMissingSections = 436
FileNotFound = 76
FileSharingViolation = 433
FileSystemErr = 73
FileTooManyOpen = 75
FilerError = 53
FiniteStateMachineError = 193
FixedAllErrors = 120
GeneralModelingFailure = 150
GraphicsNotGenerated = 523
GuidNoAddress = 394
HadMultipleReaders = 94
HandleExists = 10
HandleInUse = 14
HatchTooDense = 420
IgnoredLinetypeRedefinition = 167
IllegalEntityType = 21
IllegalReplacement = 39
InProcessOfCommitting = 253
IncompatiblePlotSettings = 508
IncompleteBlockDefinition = 379
IncompleteComplexObject = 380
InsertAfter = 110
InternetBadPath = 20003
InternetBase = 20000
InternetCreateInternetSessionFailed = 20019
InternetDirectoryFull = 20007
InternetDiskFull = 20010
InternetFileAccessDenied = 20005
InternetFileGenericError = 20011
InternetFileNotFound = 20002
InternetFileOpenFailed = 20023
InternetGenericException = 20049
InternetHardwareError = 20008
InternetHttpAccessDenied = 20027
InternetHttpBadGateway = 20044
InternetHttpBadMethod = 20031
InternetHttpBadRequest = 20026
InternetHttpConflict = 20035
InternetHttpGatewayTimeout = 20046
InternetHttpLengthRequired = 20037
InternetHttpNoAcceptableResponse = 20032
InternetHttpNotSupported = 20043
InternetHttpObjectNotFound = 20030
InternetHttpOpenRequestFailed = 20024
InternetHttpPaymentRequired = 20028
InternetHttpPreconditionFailure = 20038
InternetHttpProxyAuthorizationRequired = 20033
InternetHttpRequestForbidden = 20029
InternetHttpRequestTooLarge = 20039
InternetHttpResourceGone = 20036
InternetHttpServerError = 20042
InternetHttpServiceUnavailable = 20045
InternetHttpTimedOut = 20034
InternetHttpUnsupportedMedia = 20041
InternetHttpUriTooLong = 20040
InternetHttpVersionNotSupported = 20047
InternetInCache = 20001
InternetInternetError = 20048
InternetInternetSessionConnectFailed = 20020
InternetInternetSessionOpenFailed = 20021
InternetInvalidAccessType = 20022
InternetInvalidFileHandle = 20006
InternetNoInternetSupport = 20016
InternetNoWinInternet = 20014
InternetNotAnUrl = 20013
InternetNotImplemented = 20017
InternetOK = 20000
InternetOldWinInternet = 20015
InternetProtocolNotSupported = 20018
InternetSharingViolation = 20009
InternetTooManyOpenFiles = 20004
InternetUnknownError = 20050
InternetUserCancelledTransfer = 20025
InternetValidUrl = 20012
InvalidAdsName = 31
InvalidAxis = 154
InvalidBlockName = 47
InvalidContext = 335
InvalidDimStyle = 172
InvalidDwgVersion = 37
InvalidDxf2dPoint = 375
InvalidDxf3dPoint = 376
InvalidDxfCode = 50
InvalidDxfSectionName = 371
InvalidEngineState = 517
InvalidExtents = 30
InvalidFaceVertexIndex = 55
InvalidFileExtension = 360
InvalidFix = 192
InvalidIdMap = 220
InvalidIndex = 24
InvalidInput = 3
InvalidInterfaceId = 290
InvalidKey = 33
InvalidLayer = 173
InvalidMeshVertexIndex = 56
InvalidNormal = 291
InvalidObjectId = 600
InvalidOffset = 157
InvalidOpenState = 8
InvalidOwnerObject = 221
InvalidPlotArea = 513
InvalidPlotInfo = 520
InvalidProfileName = 361
InvalidResultBuffer = 51
InvalidStyle = 292
InvalidSymTableFlag = 161
InvalidSymbolTableName = 32
InvalidTextStyle = 163
InvalidView = 511
InvalidWindowArea = 512
InvalidXrefObjectId = 601
IsAnEntity = 139
IsReading = 42
IsWriteProtected = 91
IsWriting = 43
IsXRefObject = 92
IteratorDone = 129
KeyNotFound = 22
LayerGroupCodeMissing = 201
LayoutNotCurrent = 522
LeftErrorsUnfixed = 122
LispActive = 332
LoadFailed = 503
LockChangeInProgress = 323
LockConflict = 321
LockViolation = 320
LongTransReferenceError = 255
MakeMeProxy = 301
MakeMeProxyAndResurrect = 432
MaxLayouts = 408
MissingBlockName = 390
MissingDxfField = 48
MissingDxfSection = 370
MissingSymbolTable = 98
MissingSymbolTableRecord = 99
MustBe0to2 = 395
MustBe0to3 = 396
MustBe0to4 = 397
MustBe0to5 = 398
MustBe0to8 = 399
MustBe1to15 = 401
MustBe1to6 = 405
MustBe1to8 = 400
MustBeNonNegative = 403
MustBeNonZero = 404
MustBePositive = 402
MustFirstAddBlockToDB = 58
MustOpenThruOwner = 88
MustPlotToFile = 525
NegativeValueNotAllowed = 29
NlsFileNotAvailable = 302
NoActiveTransactions = 250
NoBlockBegin = 382
NoClassId = 409
NoCurrentConfig = 505
NoDatabase = 124
NoDocument = 330
NoErrorHandler = 519
NoFileName = 365
NoInputFiler = 68
NoInternalSpace = 171
NoLabelBlock = 603
NoLayout = 507
NoMatchingMedia = 510
NoPlotStyleTranslationTable = 406
NoThumbnailBitmap = 393
NoViewAssociation = 602
NoWorkSet = 256
NonCoplanarGeometry = 152
NonPlanarEntity = 158
NonePlotDevice = 509
NotAllowedForThisProxy = 303
NotAnEntity = 93
NotApplicable = 2
NotCurrentDatabase = 138
NotDxfHeaderGroupCode = 372
NotFromThisDocument = 331
NotHandled = 431
NotImplementedYet = 1
NotInBlock = 131
NotInDatabase = 137
NotInGroup = 261
NotInPaperspace = 141
NotInitializedYet = 374
NotMultiPageCapable = 526
NotNewlyCreated = 254
NotOpenForRead = 44
NotOpenForWrite = 45
NotSupportedInDwgApi = 310
NotThatKindOfClass = 46
NotTopTransaction = 251
NullBlockName = 17
NullEntityPointer = 20
NullExtents = 312
NullHandle = 11
NullIterator = 130
NullObjectId = 16
NullObjectPointer = 15
NullPtr = 506
NumberOfCopiesNotSupported = 521
OK = 0
ObjectIsReferenced = 392
ObjectToBeDeleted = 36
ObsoleteFileFormat = 435
OnLockedLayer = 87
OpenFileCancelled = 430
OtherObjectsBusy = 57
OutOfDisk = 27
OutOfMemory = 6
OutOfPagerMemory = 211
OutOfRange = 151
OwnerNotInDatabase = 132
OwnerNotOpenForRead = 133
OwnerNotOpenForWrite = 134
OwnerNotSet = 222
PageCancelled = 515
PagerError = 210
PagerWriteError = 212
PermanentlyErased = 81
PlotAlreadyStarted = 518
PlotCancelled = 516
PlotStyleInColorDependentMode = 407
PointNotOnEntity = 155
PolyWidthLost = 311
ProfileDoesNotExist = 359
ProfileIsInUse = 363
ProperClassSeparatorExpected = 206
RecordNotInTable = 128
RegisteredApplicationIdNotFound = 126
RegistryAccessError = 366
RegistryCreateError = 367
RenameDoesNotExist = 348
RenameInvalidLayoutName = 350
RenameInvalidName = 352
RenameIsModelSpace = 349
RenameLayoutAlreadyExists = 351
RepeatEntity = 127
RepeatedDwgRead = 437
RowsMustMatchColumns = 442
SecErrorCipherNotSupported = 1202
SecErrorComputingSignature = 1103
SecErrorDecryptingData = 1203
SecErrorEncryptingData = 1201
SecErrorGeneratingTimestamp = 1102
SecErrorReadingFile = 1002
SecErrorWritingFile = 1003
SecErrorWritingSignature = 1104
SecInitializationFailure = 1001
SecInvalidDigitalId = 1101
SelfReference = 97
SetFailed = 340
SingularPoint = 156
SomeInputDataLeftUnread = 170
StringTooLong = 160
SubSelectionSetEmpty = 550
SubentitiesStillOpen = 89
TargetDocNotQuiescent = 333
TooFewLineTypeElements = 164
TooFewVertices = 232
TooManyLineTypeElements = 165
TooManyVertices = 231
TransactionOpenWhileCommandEnded = 252
UnableToGetLabelBlock = 607
UnableToGetViewAssociation = 605
UnableToRemoveAssociation = 608
UnableToSetLabelBlock = 606
UnableToSetViewAssociation = 604
UnableToSyncModelView = 609
UndefineShapeName = 388
UndefinedDxfGroupCode = 373
UndefinedLineType = 162
UndoNoGroupBegin = 411
UndoOperationNotAvailable = 410
UnknownDxfFileFormat = 369
UnknownHandle = 13
UnrecoverableErrors = 123
UnsupportedFileFormat = 434
UserBreak = 180
VertexAfterFace = 54
Vetoed = 325
WasErased = 80
WasNotErased = 107
WasNotForwarding = 213
WasNotOpenForWrite = 100
WasNotifying = 85
WasOpenForNotify = 86
WasOpenForRead = 82
WasOpenForUndo = 84
WasOpenForWrite = 83
WrongCellType = 440
WrongDatabase = 35
WrongObjectType = 34
WrongSubentityType = 230
XRefDependent = 96