Table of Contents
 Class ShadowParameters
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiShadowParameters")]
public class ShadowParameters : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
ShadowParameters
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ShadowParameters()
public ShadowParameters()
 ShadowParameters(IntPtr, bool)
protected ShadowParameters(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 ExtendedLightLength
public double ExtendedLightLength { get; set; }
Property Value
double
 ExtendedLightRadius
public double ExtendedLightRadius { get; set; }
Property Value
double
 ExtendedLightShape
public ExtendedLightShape ExtendedLightShape { get; set; }
Property Value
ExtendedLightShape
 ExtendedLightWidth
public double ExtendedLightWidth { get; set; }
Property Value
double
 ShadowMapSize
public short ShadowMapSize { get; set; }
Property Value
short
 ShadowMapSoftness
public byte ShadowMapSoftness { get; set; }
Property Value
byte
 ShadowSamples
public short ShadowSamples { get; set; }
Property Value
short
 ShadowType
public ShadowType ShadowType { get; set; }
Property Value
ShadowType
 ShadowsOn
public bool ShadowsOn { get; set; }
Property Value
bool
 ShapeVisibility
public bool ShapeVisibility { get; set; }
Property Value
bool
Methods
 Equals(object)
public override bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override int GetHashCode()
Returns
int