Table of Contents
 Enum AttenuationType
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiLightAttenuation::AttenuationType")]
public enum AttenuationType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
InverseLinear = 1
InverseSquare = 2
None = 0