Table of Contents
 Class DbHomeView
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbHomeView")]
public class DbHomeView : DisposableWrapper, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
DbHomeView
Implements
IDisposable
ICloneable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DbHomeView()
public DbHomeView()
 DbHomeView(IntPtr, bool)
public DbHomeView(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 Center
public Point3d Center { get; set; }
Property Value
Point3d
 Eye
public Point3d Eye { get; set; }
Property Value
Point3d
 Height
public double Height { get; set; }
Property Value
double
 Perspective
public bool Perspective { get; set; }
Property Value
bool
 Up
public Vector3d Up { get; set; }
Property Value
Vector3d
 Width
public double Width { get; set; }
Property Value
double
Methods
 Clone()
public virtual object Clone()
Returns
object
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 Equals(object)
public override bool Equals(object obj)
Parameters
obj object
Returns
bool
 ToggleDefaultSettings()
public void ToggleDefaultSettings()
Operators
 operator ==(DbHomeView, DbHomeView)
public static bool operator ==(DbHomeView lhvw, DbHomeView rhvw)
Parameters
lhvw DbHomeView
rhvw DbHomeView
Returns
bool
 operator !=(DbHomeView, DbHomeView)
public static bool operator !=(DbHomeView lhvm, DbHomeView rhvw)
Parameters
lhvm DbHomeView
rhvw DbHomeView
Returns
bool