Table of Contents
 Class PointCloudColorRamp
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbPointCloudColorRamp")]
public class PointCloudColorRamp : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
PointCloudColorRamp
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 PointCloudColorRamp()
public PointCloudColorRamp()
 PointCloudColorRamp(IntPtr, bool)
protected PointCloudColorRamp(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 Name
public virtual string Name { get; set; }
Property Value
string
 NumColors
public virtual int NumColors { get; set; }
Property Value
int
Methods
 Color(int)
public virtual EntityColor Color(int c)
Parameters
c int
Returns
EntityColor
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 SetColor(int, EntityColor)
public virtual void SetColor(int c, EntityColor color)
Parameters
c int
color EntityColor
 SetFrom(PointCloudColorRamp)
public virtual void SetFrom(PointCloudColorRamp source)
Parameters
source PointCloudColorRamp
 SetVisibility(int, bool)
public virtual void SetVisibility(int c, bool bVisible)
Parameters
c int
bVisible bool
 Visibility(int)
public virtual bool Visibility(int c)
Parameters
c int
Returns
bool