Table of Contents
 Class Polyline3d
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb3dPolyline")]
public class Polyline3d : Curve, IDisposable, ICloneable, IEnumerable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
Entity
Curve
Polyline3d
Implements
IDisposable
ICloneable
IEnumerable
Inherited Members
 Curve.GetPointAtParameter(double)
 Curve.GetParameterAtPoint(Point3d)
 Curve.GetDistanceAtParameter(double)
 Curve.GetParameterAtDistance(double)
 Curve.GetDistAtPoint(Point3d)
 Curve.GetPointAtDist(double)
 Curve.GetFirstDerivative(Point3d)
 Curve.GetFirstDerivative(double)
 Curve.GetSecondDerivative(Point3d)
 Curve.GetSecondDerivative(double)
 Curve.GetClosestPointTo(Point3d, Vector3d, bool)
 Curve.GetClosestPointTo(Point3d, bool)
 Curve.GetOrthoProjectedCurve(Plane)
 Curve.GetProjectedCurve(Plane, Vector3d)
 Curve.GetOffsetCurves(double)
 Curve.GetOffsetCurvesGivenPlaneNormal(Vector3d, double)
 Curve.GetSplitCurves(Point3dCollection)
 Curve.GetSplitCurves(DoubleCollection)
 Curve.Extend(bool, Point3d)
 Curve.Extend(double)
 Curve.ReverseCurve()
 Curve.GetGeCurve()
 Curve.GetGeCurve(Tolerance)
 Curve.CreateFromGeCurve(Curve3d)
 Curve.CreateFromGeCurve(Curve3d, Tolerance)
 Curve.CreateFromGeCurve(Curve3d, Vector3d)
 Curve.CreateFromGeCurve(Curve3d, Vector3d, Tolerance)
 Curve.SetFromGeCurve(Curve3d)
 Curve.SetFromGeCurve(Curve3d, Tolerance)
 Curve.SetFromGeCurve(Curve3d, Vector3d)
 Curve.SetFromGeCurve(Curve3d, Vector3d, Tolerance)
 Curve.Area
 Curve.Spline
 Curve.EndPoint
 Curve.StartPoint
 Curve.EndParam
 Curve.StartParam
 Curve.IsPeriodic
 Entity.SetLayerId(ObjectId, bool)
 Entity.SetPropertiesFrom(Entity)
 Entity.GetPlane()
 Entity.AddSubentityPaths(FullSubentityPath[])
 Entity.DeleteSubentityPaths(FullSubentityPath[])
 Entity.TransformSubentityPathsBy(FullSubentityPath[], Matrix3d)
 Entity.GetGripPointsAtSubentityPath(FullSubentityPath, GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.MoveGripPointsAtSubentityPaths(FullSubentityPath[], IntPtr[], Vector3d, MoveGripPointsFlags)
 Entity.GetSubentityGeometricExtents(FullSubentityPath)
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, IntPtr, Point3d, Matrix3d, ObjectId[])
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, long, Point3d, Matrix3d, int, ObjectId[])
 Entity.GetGraphicsMarkersAtSubentityPathIntPtr(FullSubentityPath)
 Entity.Highlight(FullSubentityPath, bool)
 Entity.Highlight()
 Entity.Unhighlight(FullSubentityPath, bool)
 Entity.Unhighlight()
 Entity.PushHighlight(FullSubentityPath, HighlightStyle)
 Entity.PopHighlight(FullSubentityPath)
 Entity.HighlightState(FullSubentityPath)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection, Matrix3d)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection)
 Entity.IsContentSnappable()
 Entity.GetGripPoints(GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.GetGripPoints(Point3dCollection, IntegerCollection, IntegerCollection)
 Entity.MoveGripPointsAt(GripDataCollection, Vector3d, MoveGripPointsFlags)
 Entity.MoveGripPointsAt(IntegerCollection, Vector3d)
 Entity.GetStretchPoints(Point3dCollection)
 Entity.MoveStretchPointsAt(IntegerCollection, Vector3d)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.List()
 Entity.TransformBy(Matrix3d)
 Entity.GetTransformedCopy(Matrix3d)
 Entity.GetSubentity(FullSubentityPath)
 Entity.Explode(DBObjectCollection)
 Entity.RecordGraphicsModified(bool)
 Entity.Draw()
 Entity.SaveAs(WorldDraw, SaveType)
 Entity.SetDatabaseDefaults(Database)
 Entity.SetDatabaseDefaults()
 Entity.SetDragStatus(DragStatus)
 Entity.SetGripStatus(GripStatus)
 Entity.SetSubentityGripStatus(GripStatus, FullSubentityPath)
 Entity.JoinEntity(Entity)
 Entity.JoinEntities(Entity[])
 Entity.EdgeStyleId
 Entity.FaceStyleId
 Entity.VisualStyleId
 Entity.ForceAnnoAllVisible
 Entity.BlockName
 Entity.MaterialMapper
 Entity.MaterialId
 Entity.Material
 Entity.ReceiveShadows
 Entity.CastShadows
 Entity.Hyperlinks
 Entity.CloneMeForDragging
 Entity.CompoundObjectTransform
 Entity.GeometricExtents
 Entity.Ecs
 Entity.IsPlanar
 Entity.CollisionType
 Entity.LineWeight
 Entity.Visible
 Entity.LinetypeScale
 Entity.LinetypeId
 Entity.Linetype
 Entity.LayerId
 Entity.Layer
 Entity.PlotStyleNameId
 Entity.PlotStyleName
 Entity.Transparency
 Entity.EntityColor
 Entity.ColorIndex
 Entity.Color
 Entity.BlockId
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Polyline3d()
public Polyline3d()
 Polyline3d(Poly3dType, Point3dCollection, bool)
public Polyline3d(Poly3dType type, Point3dCollection vertices, bool closed)
Parameters
type Poly3dType
vertices Point3dCollection
closed bool
 Polyline3d(IntPtr, bool)
protected Polyline3d(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 Closed
public bool Closed { get; set; }
Property Value
bool
 Length
[UnitType(UnitType.Distance)]
public double Length { get; }
Property Value
double
 PolyType
public Poly3dType PolyType { get; set; }
Property Value
Poly3dType
Methods
 AppendVertex(PolylineVertex3d)
public ObjectId AppendVertex(PolylineVertex3d vertexToAppend)
Parameters
vertexToAppend PolylineVertex3d
Returns
ObjectId
 ConvertToPolyType(Poly3dType)
public void ConvertToPolyType(Poly3dType newVal)
Parameters
newVal Poly3dType
 GetEnumerator()
public virtual IEnumerator GetEnumerator()
Returns
IEnumerator
 InsertVertexAt(ObjectId, PolylineVertex3d)
public ObjectId InsertVertexAt(ObjectId indexVertexId, PolylineVertex3d newVertex)
Parameters
indexVertexId ObjectId
newVertex PolylineVertex3d
Returns
ObjectId
 InsertVertexAt(PolylineVertex3d, PolylineVertex3d)
public void InsertVertexAt(PolylineVertex3d indexVertex, PolylineVertex3d newVertex)
Parameters
indexVertex PolylineVertex3d
newVertex PolylineVertex3d
 SplineFit()
public void SplineFit()
 SplineFit(Poly3dType, int)
public void SplineFit(Poly3dType value, int segments)
Parameters
value Poly3dType
segments int
 Straighten()
public void Straighten()