Table of Contents
 Enum SectionType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbSectionSettings::SectionType")]
[Flags]
public enum SectionType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
LiveSection = 1
Section2d = 2
Section3d = 4