Table of Contents
 Struct TextEditorStack
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct TextEditorStack
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 TextEditorStack()
public TextEditorStack()
Properties
 Bottom
public string Bottom { get; set; }
Property Value
string
 DecimalChar
public char DecimalChar { get; set; }
Property Value
char
 FlowAlign
public TextEditorSelectionbase.FlowAlign FlowAlign { get; set; }
Property Value
TextEditorSelectionbase.FlowAlign
 MaxStackScale
public static double MaxStackScale { get; }
Property Value
double
 MinStackScale
public static double MinStackScale { get; }
Property Value
double
 Scale
public double Scale { get; set; }
Property Value
double
 Top
public string Top { get; set; }
Property Value
string
 Type
public TextEditorStack.StackType Type { get; set; }
Property Value
TextEditorStack.StackType