Table of Contents
 Class CompoundObjectId
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbCompoundObjectId")]
public class CompoundObjectId : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
CompoundObjectId
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 CompoundObjectId()
public CompoundObjectId()
 CompoundObjectId(CompoundObjectId)
public CompoundObjectId(CompoundObjectId A_0)
Parameters
A_0 CompoundObjectId
 CompoundObjectId(ObjectId)
public CompoundObjectId(ObjectId id)
Parameters
id ObjectId
 CompoundObjectId(ObjectId, Database)
public CompoundObjectId(ObjectId id, Database hostDatabase)
Parameters
id ObjectId
hostDatabase Database
 CompoundObjectId(ObjectId, ObjectIdCollection, Database)
public CompoundObjectId(ObjectId id, ObjectIdCollection path, Database hostDatabase)
Parameters
id ObjectId
path ObjectIdCollection
hostDatabase Database
 CompoundObjectId(IntPtr, bool)
protected CompoundObjectId(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 FullPath
public ObjectIdCollection FullPath { get; }
Property Value
ObjectIdCollection
 IsEmpty
public bool IsEmpty { get; }
Property Value
bool
 IsExternal
public bool IsExternal { get; }
Property Value
bool
 IsSimpleObjectId
public bool IsSimpleObjectId { get; }
Property Value
bool
 LeafId
public ObjectId LeafId { get; }
Property Value
ObjectId
 Path
public ObjectIdCollection Path { get; }
Property Value
ObjectIdCollection
 Status
public CompoundObjectId.StatusType Status { get; }
Property Value
CompoundObjectId.StatusType
 TopId
public ObjectId TopId { get; }
Property Value
ObjectId
 Transform
public Matrix3d Transform { get; }
Property Value
Matrix3d
Methods
 DwgInFields(DwgFiler, int)
public void DwgInFields(DwgFiler filer, int ownerVersion)
Parameters
filer DwgFiler
ownerVersion int
 DwgOutFields(DwgFiler, Database)
public void DwgOutFields(DwgFiler filer, Database hostDatabase)
Parameters
filer DwgFiler
hostDatabase Database
 DxfInFields(DxfFiler, Database, int)
public void DxfInFields(DxfFiler filer, Database hostDatabase, int ownerVersion)
Parameters
filer DxfFiler
hostDatabase Database
ownerVersion int
 DxfOutFields(DxfFiler, Database)
public void DxfOutFields(DxfFiler filer, Database hostDatabase)
Parameters
filer DxfFiler
hostDatabase Database
 IsValid(int)
public bool IsValid(int validityCheckingLevel)
Parameters
validityCheckingLevel int
Returns
bool
 NullId()
public static CompoundObjectId NullId()
Returns
CompoundObjectId
 Remap(IdMapping)
public bool Remap(IdMapping idMap)
Parameters
idMap IdMapping
Returns
bool
 Set(CompoundObjectId, Database)
public void Set(CompoundObjectId compoundID, Database hostDatabase)
Parameters
compoundID CompoundObjectId
hostDatabase Database
 Set(ObjectId, Database)
public void Set(ObjectId id, Database hostDatabase)
Parameters
id ObjectId
hostDatabase Database
 Set(ObjectId, ObjectIdCollection, Database)
public void Set(ObjectId id, ObjectIdCollection path, Database hostDatabase)
Parameters
id ObjectId
path ObjectIdCollection
hostDatabase Database
 SetEmpty()
public void SetEmpty()
 SetFullPath(ObjectIdCollection, Database)
public void SetFullPath(ObjectIdCollection fullPath, Database hostDatabase)
Parameters
fullPath ObjectIdCollection
hostDatabase Database
 op_Assign(CompoundObjectId)
public CompoundObjectId op_Assign(CompoundObjectId A_0)
Parameters
A_0 CompoundObjectId
Returns
CompoundObjectId
 op_Assign(ObjectId)
public CompoundObjectId op_Assign(ObjectId A_0)
Parameters
A_0 ObjectId
Returns
CompoundObjectId
 op_Equality(CompoundObjectId)
public bool op_Equality(CompoundObjectId A_0)
Parameters
A_0 CompoundObjectId
Returns
bool
 op_Inequality(CompoundObjectId)
public bool op_Inequality(CompoundObjectId other)
Parameters
other CompoundObjectId
Returns
bool