Table of Contents
 Class GraphNode
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbGraphNode")]
public class GraphNode : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
GraphNode
Implements
IDisposable
Derived
ObjectIdGraphNode
XrefGraphNode
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 GraphNode()
public GraphNode()
 GraphNode(IntPtr, bool)
protected GraphNode(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 Data
public IntPtr Data { get; set; }
Property Value
IntPtr
 IsCycleNode
public bool IsCycleNode { get; }
Property Value
bool
 NextCycleNode
public GraphNode NextCycleNode { get; }
Property Value
GraphNode
 NumCycleIn
public int NumCycleIn { get; }
Property Value
int
 NumCycleOut
public int NumCycleOut { get; }
Property Value
int
 NumIn
public int NumIn { get; }
Property Value
int
 NumOut
public int NumOut { get; }
Property Value
int
 Owner
public Graph Owner { get; }
Property Value
Graph
Methods
 AddRefTo(GraphNode)
public void AddRefTo(GraphNode outGoingNode)
Parameters
outGoingNode GraphNode
 Clear(byte)
public void Clear(byte flags)
Parameters
flags byte
 Create(IntPtr, bool)
public static GraphNode Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
GraphNode
 CycleIn(int)
public GraphNode CycleIn(int index)
Parameters
index int
Returns
GraphNode
 CycleOut(int)
public GraphNode CycleOut(int index)
Parameters
index int
Returns
GraphNode
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 DisconnectAll()
public void DisconnectAll()
 In(int)
public GraphNode In(int index)
Parameters
index int
Returns
GraphNode
 IsMarkedAs(int)
public bool IsMarkedAs(int flag)
Parameters
flag int
Returns
bool
 MarkAs(byte)
public void MarkAs(byte flags)
Parameters
flags byte
 MarkTree(byte, GraphNodeCollection)
public void MarkTree(byte flags, GraphNodeCollection appendedTo)
Parameters
flags byte
appendedTo GraphNodeCollection
 Out(int)
public GraphNode Out(int index)
Parameters
index int
Returns
GraphNode
 RemoveRefTo(GraphNode)
public void RemoveRefTo(GraphNode nodeToRemoveReference)
Parameters
nodeToRemoveReference GraphNode
 SetEdgeGrowthRate(int, int)
public void SetEdgeGrowthRate(int outEdgeRate, int inEdgeRate)
Parameters
outEdgeRate int
inEdgeRate int