Table of Contents
 Enum AssocEvaluationPriority
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocEvaluationPriority")]
public enum AssocEvaluationPriority
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CanBeEvaluatedAssocEvaluationPriority = 1000
CannotBeEvaluatedAssocEvaluationPriority = -1000
CannotDermineAssocEvaluationPriority = 0