Table of Contents
 Enum MaintenanceReleaseVersion
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::MaintenanceReleaseVersion")]
public enum MaintenanceReleaseVersion
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Release0 = 0
Release1 = 1
Release10 = 10
Release100 = 100
Release101 = 101
Release102 = 102
Release103 = 103
Release104 = 104
Release105 = 105
Release106 = 106
Release107 = 107
Release108 = 108
Release109 = 109
Release11 = 11
Release110 = 110
Release111 = 111
Release112 = 112
Release113 = 113
Release114 = 114
Release115 = 115
Release116 = 116
Release117 = 117
Release118 = 118
Release119 = 119
Release12 = 12
Release120 = 120
Release121 = 121
Release122 = 122
Release123 = 123
Release124 = 124
Release125 = 125
Release126 = 126
Release127 = 127
Release128 = 128
Release129 = 129
Release13 = 13
Release130 = 130
Release131 = 131
Release132 = 132
Release133 = 133
Release134 = 134
Release135 = 135
Release136 = 136
Release137 = 137
Release138 = 138
Release139 = 139
Release14 = 14
Release140 = 140
Release141 = 141
Release142 = 142
Release143 = 143
Release144 = 144
Release145 = 145
Release146 = 146
Release147 = 147
Release148 = 148
Release149 = 149
Release15 = 15
Release150 = 150
Release151 = 151
Release152 = 152
Release153 = 153
Release154 = 154
Release155 = 155
Release156 = 156
Release157 = 157
Release158 = 158
Release159 = 159
Release16 = 16
Release160 = 160
Release17 = 17
Release18 = 18
Release19 = 19
Release2 = 2
Release20 = 20
Release2010Max = 255
Release2010Newest = 205
Release21 = 21
Release22 = 22
Release23 = 23
Release24 = 24
Release25 = 25
Release26 = 26
Release27 = 27
Release28 = 28
Release29 = 29
Release3 = 3
Release30 = 30
Release31 = 31
Release32 = 32
Release33 = 33
Release34 = 34
Release35 = 35
Release36 = 36
Release37 = 37
Release38 = 38
Release39 = 39
Release4 = 4
Release40 = 40
Release41 = 41
Release42 = 42
Release43 = 43
Release44 = 44
Release45 = 45
Release46 = 46
Release47 = 47
Release48 = 48
Release49 = 49
Release5 = 5
Release50 = 50
Release51 = 51
Release52 = 52
Release53 = 53
Release54 = 54
Release55 = 55
Release56 = 56
Release57 = 57
Release58 = 58
Release59 = 59
Release6 = 6
Release60 = 60
Release61 = 61
Release62 = 62
Release63 = 63
Release64 = 64
Release65 = 65
Release66 = 66
Release67 = 67
Release68 = 68
Release69 = 69
Release7 = 7
Release70 = 70
Release71 = 71
Release72 = 72
Release73 = 73
Release74 = 74
Release75 = 75
Release76 = 76
Release77 = 77
Release78 = 78
Release79 = 79
Release8 = 8
Release80 = 80
Release81 = 81
Release82 = 82
Release83 = 83
Release84 = 84
Release85 = 85
Release86 = 86
Release87 = 87
Release88 = 88
Release89 = 89
Release9 = 9
Release90 = 90
Release91 = 91
Release92 = 92
Release93 = 93
Release94 = 94
Release95 = 95
Release96 = 96
Release97 = 97
Release98 = 98
Release99 = 99
ReleaseCurrent = 105
ReleaseKnown = 126
ReleaseMax = 127