Table of Contents
 Class BlockTableRecord
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbBlockTableRecord")]
public class BlockTableRecord : SymbolTableRecord, IDisposable, ICloneable, IEnumerable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
SymbolTableRecord
BlockTableRecord
Implements
IDisposable
ICloneable
IEnumerable
Inherited Members
 SymbolTableRecord.IsResolved
 SymbolTableRecord.IsDependent
 SymbolTableRecord.Name
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 BlockTableRecord()
public BlockTableRecord()
 BlockTableRecord(IntPtr, bool)
protected BlockTableRecord(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Fields
 ModelSpace
public static string ModelSpace
Field Value
string
 PaperSpace
public static string PaperSpace
Field Value
string
Properties
 BlockBeginId
public ObjectId BlockBeginId { get; }
Property Value
ObjectId
 BlockEndId
public ObjectId BlockEndId { get; }
Property Value
ObjectId
 BlockScaling
public BlockScaling BlockScaling { get; set; }
Property Value
BlockScaling
 Comments
public string Comments { get; set; }
Property Value
string
 DrawOrderTableId
public ObjectId DrawOrderTableId { get; }
Property Value
ObjectId
 Explodable
public bool Explodable { get; set; }
Property Value
bool
 HasAttributeDefinitions
public bool HasAttributeDefinitions { get; }
Property Value
bool
 HasPreviewIcon
public bool HasPreviewIcon { get; }
Property Value
bool
 Hyperlinks
public HyperLinkCollection Hyperlinks { get; }
Property Value
HyperLinkCollection
 IncludingErased
public BlockTableRecord IncludingErased { get; }
Property Value
BlockTableRecord
 IsAnonymous
public bool IsAnonymous { get; }
Property Value
bool
 IsDynamicBlock
public bool IsDynamicBlock { get; }
Property Value
bool
 IsFromExternalReference
public bool IsFromExternalReference { get; }
Property Value
bool
 IsFromOverlayReference
public bool IsFromOverlayReference { get; set; }
Property Value
bool
 IsLayout
public bool IsLayout { get; }
Property Value
bool
 IsUnloaded
public bool IsUnloaded { get; set; }
Property Value
bool
 LayoutId
public ObjectId LayoutId { get; set; }
Property Value
ObjectId
 Origin
public Point3d Origin { get; set; }
Property Value
Point3d
 PathName
public string PathName { get; set; }
Property Value
string
 PreviewIcon
public Bitmap PreviewIcon { get; set; }
Property Value
Bitmap
 SkipDeleted
protected bool SkipDeleted { get; }
Property Value
bool
 Units
public UnitsValue Units { get; set; }
Property Value
UnitsValue
 XrefStatus
public XrefStatus XrefStatus { get; }
Property Value
XrefStatus
Methods
 AppendEntity(Entity)
public ObjectId AppendEntity(Entity entity)
Parameters
entity Entity
Returns
ObjectId
 AssumeOwnershipOf(ObjectIdCollection)
public void AssumeOwnershipOf(ObjectIdCollection entitiesToMove)
Parameters
entitiesToMove ObjectIdCollection
 Copy()
protected virtual BlockTableRecord Copy()
Returns
BlockTableRecord
 GetAnonymousBlockIds()
public ObjectIdCollection GetAnonymousBlockIds()
Returns
ObjectIdCollection
 GetBlockReferenceIds(bool, bool)
public ObjectIdCollection GetBlockReferenceIds(bool directOnly, bool forceValidity)
Parameters
directOnly bool
forceValidity bool
Returns
ObjectIdCollection
 GetEnumerator()
public BlockTableRecordEnumerator GetEnumerator()
Returns
BlockTableRecordEnumerator
 GetErasedBlockReferenceIds()
public ObjectIdCollection GetErasedBlockReferenceIds()
Returns
ObjectIdCollection
 GetXrefDatabase(bool)
public Database GetXrefDatabase(bool incrementUnresolved)
Parameters
incrementUnresolved bool
Returns
Database
 UpdateAnonymousBlocks()
[OpenMode(OpenMode.ForRead)]
public void UpdateAnonymousBlocks()
 raise_BlockInsertionPoints(object, BlockInsertionPointsEventArgs)
protected static void raise_BlockInsertionPoints(object sender, BlockInsertionPointsEventArgs arguments)
Parameters
sender object
arguments BlockInsertionPointsEventArgs
Events
 BlockInsertionPoints
public static event BlockInsertionPointsEventHandler BlockInsertionPoints
Event Type
BlockInsertionPointsEventHandler
Explicit Interface Implementations
 IEnumerableGetEnumerator()
virtual IEnumerator IEnumerableGetEnumerator()
Returns
IEnumerator