Table of Contents
 Class SubentityOverrule
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbSubentityOverrule")]
public abstract class SubentityOverrule : Overrule, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Overrule
SubentityOverrule
Implements
IDisposable
ICloneable
Inherited Members
 Overrule.AddOverrule(RXClass, Overrule, bool)
 Overrule.RemoveOverrule(RXClass, Overrule)
 Overrule.HasOverrule(RXObject, RXClass)
 Overrule.IsApplicable(RXObject)
 Overrule.Overruling
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 SubentityOverrule()
protected SubentityOverrule()
Methods
 AddSubentPaths(Entity, FullSubentityPath[])
public virtual void AddSubentPaths(Entity entity, FullSubentityPath[] paths)
Parameters
entity Entity
paths FullSubentityPath[]
 DeleteSubentPaths(Entity, FullSubentityPath[])
public virtual void DeleteSubentPaths(Entity entity, FullSubentityPath[] paths)
Parameters
entity Entity
paths FullSubentityPath[]
 GetCompoundObjectTransform(Entity)
public virtual Matrix3d GetCompoundObjectTransform(Entity entity)
Parameters
entity Entity
Returns
Matrix3d
 GetGripPointsAtSubentPath(Entity, FullSubentityPath, GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
public virtual void GetGripPointsAtSubentPath(Entity entity, FullSubentityPath subPath, GripDataCollection grips, double curViewUnitSize, int gripSize, Vector3d curViewDir, GetGripPointsFlags bitFlags)
Parameters
entity Entity
subPath FullSubentityPath
grips GripDataCollection
curViewUnitSize double
gripSize int
curViewDir Vector3d
bitFlags GetGripPointsFlags
 GetGsMarkersAtSubentPath(Entity, FullSubentityPath)
public virtual IntPtr[] GetGsMarkersAtSubentPath(Entity entity, FullSubentityPath subPath)
Parameters
entity Entity
subPath FullSubentityPath
Returns
IntPtr[]
 GetSubentClassId(Entity, FullSubentityPath)
public virtual Guid GetSubentClassId(Entity entity, FullSubentityPath path)
Parameters
entity Entity
path FullSubentityPath
Returns
Guid
 GetSubentPathGeomExtents(Entity, FullSubentityPath)
public virtual Extents3d GetSubentPathGeomExtents(Entity entity, FullSubentityPath path)
Parameters
entity Entity
path FullSubentityPath
Returns
Extents3d
 GetSubentPathsAtGsMarker(Entity, SubentityType, IntPtr, Point3d, Matrix3d, ObjectId[])
public virtual FullSubentityPath[] GetSubentPathsAtGsMarker(Entity entity, SubentityType type, IntPtr gsMark, Point3d pickPoint, Matrix3d viewXform, ObjectId[] entAndInsertStack)
Parameters
entity Entity
type SubentityType
gsMark IntPtr
pickPoint Point3d
viewXform Matrix3d
entAndInsertStack ObjectId[]
Returns
FullSubentityPath[]
 MoveGripPointsAtSubentPaths(Entity, FullSubentityPath[], GripDataCollection, Vector3d, MoveGripPointsFlags)
public virtual void MoveGripPointsAtSubentPaths(Entity entity, FullSubentityPath[] path, GripDataCollection grips, Vector3d offset, MoveGripPointsFlags bitFlags)
Parameters
entity Entity
path FullSubentityPath[]
grips GripDataCollection
offset Vector3d
bitFlags MoveGripPointsFlags
 OnSubentGripStatusChanged(Entity, GripStatus, FullSubentityPath)
public virtual void OnSubentGripStatusChanged(Entity entity, GripStatus status, FullSubentityPath subentity)
Parameters
entity Entity
status GripStatus
subentity FullSubentityPath
 SetCustomFilter()
public override sealed void SetCustomFilter()
 SetExtensionDictionaryEntryFilter(string)
public override sealed void SetExtensionDictionaryEntryFilter(string entryName)
Parameters
entryName string
 SetIdFilter(ObjectId[])
public override sealed void SetIdFilter(ObjectId[] ids)
Parameters
ids ObjectId[]
 SetNoFilter()
public override sealed void SetNoFilter()
 SetXDataFilter(string)
public override sealed void SetXDataFilter(string registeredApplicationName)
Parameters
registeredApplicationName string
 SubentPtr(Entity, FullSubentityPath)
public virtual Entity SubentPtr(Entity entity, FullSubentityPath id)
Parameters
entity Entity
id FullSubentityPath
Returns
Entity
 TransformSubentPathsBy(Entity, FullSubentityPath[], Matrix3d)
public virtual void TransformSubentPathsBy(Entity entity, FullSubentityPath[] paths, Matrix3d xform)
Parameters
entity Entity
paths FullSubentityPath[]
xform Matrix3d