Table of Contents
 Class AssocArray
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public sealed class AssocArray
Inheritance
object
AssocArray
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 EntityId
public ObjectId EntityId { get; }
Property Value
ObjectId
 SourceEntities
public ObjectIdCollection SourceEntities { get; }
Property Value
ObjectIdCollection
Methods
 AddSourceEntity(ObjectId, Point3d)
public void AddSourceEntity(ObjectId sourceEntity, Point3d basePoint)
Parameters
sourceEntity ObjectId
basePoint Point3d
 CreateArray(ObjectIdCollection, VertexRef, AssocArrayParameters)
public static AssocArray CreateArray(ObjectIdCollection sourceEntities, VertexRef basePoint, AssocArrayParameters parameters)
Parameters
sourceEntities ObjectIdCollection
basePoint VertexRef
parameters AssocArrayParameters
Returns
AssocArray
 DeleteItem(ItemLocator, bool)
public void DeleteItem(ItemLocator index, bool bErase)
Parameters
index ItemLocator
bErase bool
 Explode(ObjectId)
public static ObjectIdCollection Explode(ObjectId entity)
Parameters
entity ObjectId
Returns
ObjectIdCollection
 GetAssociativeArray(ObjectId)
public static AssocArray GetAssociativeArray(ObjectId entity)
Parameters
entity ObjectId
Returns
AssocArray
 GetItemTransform(ItemLocator)
public Matrix3d GetItemTransform(ItemLocator index)
Parameters
index ItemLocator
Returns
Matrix3d
 GetParameters()
public AssocArrayParameters GetParameters()
Returns
AssocArrayParameters
 IsAssociativeArray(ObjectId)
public static bool IsAssociativeArray(ObjectId entity)
Parameters
entity ObjectId
Returns
bool
 IsErased(ItemLocator)
public bool IsErased(ItemLocator index)
Parameters
index ItemLocator
Returns
bool
 RemoveSourceEntity(ObjectId)
public void RemoveSourceEntity(ObjectId sourceEntity)
Parameters
sourceEntity ObjectId
 ReplaceItems(ItemLocator[], ObjectIdCollection, VertexRef)
public void ReplaceItems(ItemLocator[] indices, ObjectIdCollection substEntities, VertexRef basePoint)
Parameters
indices ItemLocator[]
substEntities ObjectIdCollection
basePoint VertexRef
 ResetItems()
public void ResetItems()
 TransformItemBy(ItemLocator, Matrix3d)
public void TransformItemBy(ItemLocator index, Matrix3d transform)
Parameters
index ItemLocator
transform Matrix3d
 getItemLocators(FullSubentityPath[])
public static ItemLocator[] getItemLocators(FullSubentityPath[] subPaths)
Parameters
subPaths FullSubentityPath[]
Returns
ItemLocator[]
 getItems(bool)
public ItemLocator[] getItems(bool skipErased)
Parameters
skipErased bool
Returns
ItemLocator[]