Table of Contents
 Class TextEditor
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbTextEditor")]
public class TextEditor : DisposableWrapper, IDisposable, ITextEditorSelectable
Inheritance
object
MarshalByRefObject
DisposableWrapper
TextEditor
Implements
IDisposable
ITextEditorSelectable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 TextEditor(IntPtr, bool)
protected TextEditor(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 ActualHeight
public double ActualHeight { get; }
Property Value
double
 ActualWidth
public double ActualWidth { get; }
Property Value
double
 Attachment
public AttachmentPoint Attachment { get; set; }
Property Value
AttachmentPoint
 AutoCAPS
public bool AutoCAPS { get; set; }
Property Value
bool
 AutoListEnabled
public bool AutoListEnabled { get; set; }
Property Value
bool
 Columns
public TextEditorColumns Columns { get; }
Property Value
TextEditorColumns
 Cursor
public TextEditorCursor Cursor { get; }
Property Value
TextEditorCursor
 DefaultStackAlignment
public TextEditorSelectionbase.FlowAlign DefaultStackAlignment { get; set; }
Property Value
TextEditorSelectionbase.FlowAlign
 DefaultStackScale
public double DefaultStackScale { get; set; }
Property Value
double
 DefinedHeight
public double DefinedHeight { get; set; }
Property Value
double
 DefinedWidth
public double DefinedWidth { get; set; }
Property Value
double
 EndOfText
public virtual TextEditorLocation EndOfText { get; }
Property Value
TextEditorLocation
 FontCount
public int FontCount { get; }
Property Value
int
 IsAnnotativeStyle
public bool IsAnnotativeStyle { get; }
Property Value
bool
 NumberingEnabled
public bool NumberingEnabled { get; set; }
Property Value
bool
 Paragraphs
public TextEditorParagraph[] Paragraphs { get; }
Property Value
TextEditorParagraph[]
 Selection
public TextEditorSelection Selection { get; }
Property Value
TextEditorSelection
 StackCount
public int StackCount { get; }
Property Value
int
 StartOfText
public virtual TextEditorLocation StartOfText { get; }
Property Value
TextEditorLocation
 Style
public ObjectId Style { get; set; }
Property Value
ObjectId
 StyleCount
public int StyleCount { get; }
Property Value
int
 TabOnlyDelimiter
public bool TabOnlyDelimiter { get; set; }
Property Value
bool
 TextHeight
public double TextHeight { get; set; }
Property Value
double
 VerticalSHX
public bool VerticalSHX { get; }
Property Value
bool
 VerticalTTF
public bool VerticalTTF { get; }
Property Value
bool
 Wipeout
public TextEditorWipeout Wipeout { get; }
Property Value
TextEditorWipeout
Methods
 ClearSelection()
public void ClearSelection()
 Close(ExitStatus)
public void Close(TextEditor.ExitStatus stat)
Parameters
stat TextEditor.ExitStatus
 CreateTextEditor(MText)
public static TextEditor CreateTextEditor(MText mtext)
Parameters
mtext MText
Returns
TextEditor
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 FindTextW(string, TextFindFlags, ref TextEditorLocation, ref TextEditorLocation)
public void FindTextW(string findString, TextEditor.TextFindFlags findFlags, ref TextEditorLocation start, ref TextEditorLocation end)
Parameters
findString string
findFlags TextEditor.TextFindFlags
start TextEditorLocation
end TextEditorLocation
 GetFont(int)
public Font GetFont(int index)
Parameters
index int
Returns
Font
 MakeSelection(TextEditorLocation, TextEditorLocation)
public void MakeSelection(TextEditorLocation start, TextEditorLocation end)
Parameters
start TextEditorLocation
end TextEditorLocation
 Redraw()
public void Redraw()
 SelectAll()
public void SelectAll()