Table of Contents
 Class OpenCloseTransaction
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcTransaction")]
public class OpenCloseTransaction : Transaction, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Transaction
OpenCloseTransaction
Implements
IDisposable
ICloneable
Inherited Members
 Transaction.GetAllObjects()
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 OpenCloseTransaction()
public OpenCloseTransaction()
Properties
 TransactionManager
public override TransactionManager TransactionManager { get; }
Property Value
TransactionManager
Methods
 Abort()
public override void Abort()
 AddNewlyCreatedDBObject(DBObject, bool)
public override void AddNewlyCreatedDBObject(DBObject obj, bool add)
Parameters
obj DBObject
add bool
 Commit()
public override void Commit()
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 GetObject(ObjectId, OpenMode)
public override DBObject GetObject(ObjectId id, OpenMode mode)
Parameters
id ObjectId
mode OpenMode
Returns
DBObject
 GetObject(ObjectId, OpenMode, bool)
public override DBObject GetObject(ObjectId id, OpenMode mode, bool openErased)
Parameters
id ObjectId
mode OpenMode
openErased bool
Returns
DBObject
 GetObject(ObjectId, OpenMode, bool, bool)
public override DBObject GetObject(ObjectId id, OpenMode mode, bool openErased, bool forceOpenOnLockedLayer)
Parameters
id ObjectId
mode OpenMode
openErased bool
forceOpenOnLockedLayer bool
Returns
DBObject