Table of Contents
 Enum TableCopyOptions
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::TableCopyOption")]
[Flags]
public enum TableCopyOptions
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ConvertFormatToOverrides = 2048
ExpandOrContractTable = 1
FillTarget = 131072
None = 0
OnlyContentModifiedAfterUpdate = 4194304
OnlyFormatModifiedAfterUpdate = 8388608
OverwriteContentModifiedAfterUpdate = 1048576
OverwriteFormatModifiedAfterUpdate = 2097152
OverwriteReadOnlyContent = 262144
OverwriteReadOnlyFormat = 524288
SkipBlock = 32
SkipCellState = 4096
SkipCellStyle = 1024
SkipContent = 2
SkipContentFormat = 8192
SkipDataCell = 256
SkipDataLink = 64
SkipDissimilarContentFormat = 16384
SkipField = 8
SkipFormat = 512
SkipFormula = 16
SkipGeometry = 32768
SkipLabelCell = 128
SkipMerges = 65536
SkipValue = 4
TableCopyColumnWidth = 33554432
TableCopyRowHeight = 16777216