Table of Contents
 Class DwgFiler
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDwgFiler")]
public abstract class DwgFiler : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
DwgFiler
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DwgFiler()
protected DwgFiler()
Properties
 DwgVersion
public virtual FullDwgVersion DwgVersion { get; }
Property Value
FullDwgVersion
 FilerStatus
public abstract ErrorStatus FilerStatus { get; set; }
Property Value
ErrorStatus
 FilerType
public abstract FilerType FilerType { get; }
Property Value
FilerType
 Position
public abstract long Position { get; }
Property Value
long
Methods
 ReadAddress()
public abstract IntPtr ReadAddress()
Returns
IntPtr
 ReadBinaryChunk()
public abstract byte[] ReadBinaryChunk()
Returns
byte[]
 ReadBoolean()
public abstract bool ReadBoolean()
Returns
bool
 ReadByte()
public abstract byte ReadByte()
Returns
byte
 ReadBytes(byte[])
public abstract void ReadBytes(byte[] value)
Parameters
value byte[]
 ReadDouble()
public abstract double ReadDouble()
Returns
double
 ReadHandle()
public abstract Handle ReadHandle()
Returns
Handle
 ReadHardOwnershipId()
public abstract ObjectId ReadHardOwnershipId()
Returns
ObjectId
 ReadHardPointerId()
public abstract ObjectId ReadHardPointerId()
Returns
ObjectId
 ReadInt16()
public abstract short ReadInt16()
Returns
short
 ReadInt32()
public abstract int ReadInt32()
Returns
int
 ReadInt64()
public abstract long ReadInt64()
Returns
long
 ReadPoint2d()
public abstract Point2d ReadPoint2d()
Returns
Point2d
 ReadPoint3d()
public abstract Point3d ReadPoint3d()
Returns
Point3d
 ReadScale3d()
public abstract Scale3d ReadScale3d()
Returns
Scale3d
 ReadSoftOwnershipId()
public abstract ObjectId ReadSoftOwnershipId()
Returns
ObjectId
 ReadSoftPointerId()
public abstract ObjectId ReadSoftPointerId()
Returns
ObjectId
 ReadString()
public abstract string ReadString()
Returns
string
 ReadUInt16()
public abstract ushort ReadUInt16()
Returns
ushort
 ReadUInt32()
public abstract uint ReadUInt32()
Returns
uint
 ReadUInt64()
public abstract ulong ReadUInt64()
Returns
ulong
 ReadVector2d()
public abstract Vector2d ReadVector2d()
Returns
Vector2d
 ReadVector3d()
public abstract Vector3d ReadVector3d()
Returns
Vector3d
 ResetFilerStatus()
public abstract void ResetFilerStatus()
 Seek(long, int)
public abstract void Seek(long offset, int method)
Parameters
offset long
method int
 WriteAddress(IntPtr)
public abstract void WriteAddress(IntPtr value)
Parameters
value IntPtr
 WriteBinaryChunk(byte[])
public abstract void WriteBinaryChunk(byte[] chunk)
Parameters
chunk byte[]
 WriteBoolean(bool)
public abstract void WriteBoolean(bool value)
Parameters
value bool
 WriteByte(byte)
public abstract void WriteByte(byte value)
Parameters
value byte
 WriteBytes(byte[])
public abstract void WriteBytes(byte[] value)
Parameters
value byte[]
 WriteDouble(double)
public abstract void WriteDouble(double value)
Parameters
value double
 WriteHandle(Handle)
public abstract void WriteHandle(Handle handle)
Parameters
handle Handle
 WriteHardOwnershipId(ObjectId)
public abstract void WriteHardOwnershipId(ObjectId value)
Parameters
value ObjectId
 WriteHardPointerId(ObjectId)
public abstract void WriteHardPointerId(ObjectId value)
Parameters
value ObjectId
 WriteInt16(short)
public abstract void WriteInt16(short value)
Parameters
value short
 WriteInt32(int)
public abstract void WriteInt32(int value)
Parameters
value int
 WriteInt64(long)
public abstract void WriteInt64(long value)
Parameters
value long
 WritePoint2d(Point2d)
public abstract void WritePoint2d(Point2d value)
Parameters
value Point2d
 WritePoint3d(Point3d)
public abstract void WritePoint3d(Point3d value)
Parameters
value Point3d
 WriteScale3d(Scale3d)
public abstract void WriteScale3d(Scale3d value)
Parameters
value Scale3d
 WriteSoftOwnershipId(ObjectId)
public abstract void WriteSoftOwnershipId(ObjectId value)
Parameters
value ObjectId
 WriteSoftPointerId(ObjectId)
public abstract void WriteSoftPointerId(ObjectId value)
Parameters
value ObjectId
 WriteString(string)
public abstract void WriteString(string value)
Parameters
value string
 WriteUInt16(ushort)
public abstract void WriteUInt16(ushort value)
Parameters
value ushort
 WriteUInt32(uint)
public abstract void WriteUInt32(uint value)
Parameters
value uint
 WriteUInt64(ulong)
public abstract void WriteUInt64(ulong value)
Parameters
value ulong
 WriteVector2d(Vector2d)
public abstract void WriteVector2d(Vector2d value)
Parameters
value Vector2d
 WriteVector3d(Vector3d)
public abstract void WriteVector3d(Vector3d value)
Parameters
value Vector3d