Table of Contents
 Struct FrontAndBackClipping
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
public struct FrontAndBackClipping
Inherited Members
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 FrontAndBackClipping(bool, bool, double, double)
public FrontAndBackClipping(bool clipFront, bool clipBack, double front, double back)
Parameters
clipFront bool
clipBack bool
front double
back double
Properties
 Back
public double Back { get; }
Property Value
double
 ClipBack
public bool ClipBack { get; }
Property Value
bool
 ClipFront
public bool ClipFront { get; }
Property Value
bool
 Front
public double Front { get; }
Property Value
double
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 IsEqualTo(FrontAndBackClipping)
public bool IsEqualTo(FrontAndBackClipping a)
Parameters
a FrontAndBackClipping
Returns
bool
 IsEqualTo(FrontAndBackClipping, Tolerance)
public bool IsEqualTo(FrontAndBackClipping a, Tolerance tolerance)
Parameters
a FrontAndBackClipping
tolerance Tolerance
Returns
bool
Operators
 operator ==(FrontAndBackClipping, FrontAndBackClipping)
public static bool operator ==(FrontAndBackClipping a, FrontAndBackClipping b)
Parameters
a FrontAndBackClipping
b FrontAndBackClipping
Returns
bool
 operator !=(FrontAndBackClipping, FrontAndBackClipping)
public static bool operator !=(FrontAndBackClipping a, FrontAndBackClipping b)
Parameters
a FrontAndBackClipping
b FrontAndBackClipping
Returns
bool