Table of Contents
 Class RevolveOptions
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbRevolveOptions")]
public sealed class RevolveOptions : DisposableWrapper, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RevolveOptions
Implements
IDisposable
ICloneable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 RevolveOptions()
public RevolveOptions()
 RevolveOptions(RevolveOptions)
public RevolveOptions(RevolveOptions opts)
Parameters
opts RevolveOptions
Properties
 CloseToAxis
public bool CloseToAxis { get; }
Property Value
bool
 DraftAngle
[UnitType(UnitType.Angle)]
public double DraftAngle { get; }
Property Value
double
 TwistAngle
[UnitType(UnitType.Angle)]
public double TwistAngle { get; }
Property Value
double
Methods
 CheckRevolveCurve(Entity, Point3d, Vector3d, bool)
public RevolveOptionsCheckRevolveCurveOut CheckRevolveCurve(Entity __unnamed000, Point3d axisPnt, Vector3d axisDir, bool displayErrorMessages)
Parameters
__unnamed000 Entity
axisPnt Point3d
axisDir Vector3d
displayErrorMessages bool
Returns
RevolveOptionsCheckRevolveCurveOut
 Clone()
public object Clone()
Returns
object
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()