Table of Contents
 Class CompositeCurve3d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeCompositeCurve3d")]
public sealed class CompositeCurve3d : Curve3d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
Curve3d
CompositeCurve3d
Implements
IDisposable
ICloneable
Inherited Members
 Curve3d.GetInterval()
 Curve3d.SetInterval(Interval)
 Curve3d.GetReverseParameterCurve()
 Curve3d.GetDistanceTo(Curve3d)
 Curve3d.GetDistanceTo(Curve3d, Tolerance)
 Curve3d.GetDistanceTo(Point3d)
 Curve3d.GetDistanceTo(Point3d, Tolerance)
 Curve3d.GetClosestPointTo(Curve3d)
 Curve3d.GetClosestPointTo(Curve3d, Tolerance)
 Curve3d.GetClosestPointTo(Point3d)
 Curve3d.GetClosestPointTo(Point3d, Tolerance)
 Curve3d.GetProjectedClosestPointTo(Curve3d, Vector3d)
 Curve3d.GetProjectedClosestPointTo(Curve3d, Vector3d, Tolerance)
 Curve3d.GetProjectedClosestPointTo(Point3d, Vector3d)
 Curve3d.GetProjectedClosestPointTo(Point3d, Vector3d, Tolerance)
 Curve3d.GetNormalPoint(Point3d)
 Curve3d.GetNormalPoint(Point3d, Tolerance)
 Curve3d.GetBoundBlockOf(Interval)
 Curve3d.GetOrthoBoundBlockOf(Interval)
 Curve3d.GetProjectedEntity(Plane, Vector3d)
 Curve3d.GetProjectedEntity(Plane, Vector3d, Tolerance)
 Curve3d.GetOrthoProjectEntity(Plane)
 Curve3d.GetOrthoProjectEntity(Plane, Tolerance)
 Curve3d.IsOn(double)
 Curve3d.IsOn(double, Tolerance)
 Curve3d.IsOn(Point3d, out double)
 Curve3d.IsOn(Point3d, out double, Tolerance)
 Curve3d.IsOn(Point3d)
 Curve3d.IsOn(Point3d, Tolerance)
 Curve3d.GetParameterOf(Point3d)
 Curve3d.GetParameterOf(Point3d, Tolerance)
 Curve3d.GetTrimmedOffset(double, Vector3d, OffsetCurveExtensionType)
 Curve3d.GetTrimmedOffset(double, Vector3d, OffsetCurveExtensionType, Tolerance)
 Curve3d.IsClosed()
 Curve3d.IsClosed(Tolerance)
 Curve3d.IsPlanar(out Plane)
 Curve3d.IsPlanar(out Plane, Tolerance)
 Curve3d.IsLinear(out Line3d)
 Curve3d.IsLinear(out Line3d, Tolerance)
 Curve3d.IsCoplanarWith(Curve3d, out Plane)
 Curve3d.IsCoplanarWith(Curve3d, out Plane, Tolerance)
 Curve3d.IsPeriodic(out double)
 Curve3d.IsDegenerate(out Entity3d)
 Curve3d.IsDegenerate(out Entity3d, Tolerance)
 Curve3d.GetLength(double, double, double)
 Curve3d.GetParameterAtLength(double, double, bool, double)
 Curve3d.GetArea(double, double)
 Curve3d.GetArea(double, double, Tolerance)
 Curve3d.GetSplitCurves(double)
 Curve3d.Explode(Interval)
 Curve3d.EvaluatePoint(double)
 Curve3d.GetSamplePoints(int)
 Curve3d.GetSamplePoints(double, double, double)
 Curve3d.GetNewSamplePoints(double, double, double)
 Curve3d.EndPoint
 Curve3d.StartPoint
 Curve3d.HasEndPoint
 Curve3d.HasStartPoint
 Curve3d.OrthoBoundBlock
 Curve3d.BoundBlock
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 CompositeCurve3d(Curve3d[])
public CompositeCurve3d(Curve3d[] curves)
Parameters
curves Curve3d[]
Methods
 Create(IntPtr, bool)
public static CompositeCurve3d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
CompositeCurve3d
 GetCurves()
public Curve3d[] GetCurves()
Returns
Curve3d[]
 GlobalToLocalParameter(double)
public CompositeParameter GlobalToLocalParameter(double value)
Parameters
value double
Returns
CompositeParameter
 LocalToGlobalParameter(CompositeParameter)
public double LocalToGlobalParameter(CompositeParameter value)
Parameters
value CompositeParameter
Returns
double