Table of Contents
 Struct DBObjectReference
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct DBObjectReference
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 DBObjectReference(ObjectId, int)
public DBObjectReference(ObjectId id, int kind)
Parameters
id ObjectId
kind int
Properties
 Kind
public int Kind { get; }
Property Value
int
 ObjectId
public ObjectId ObjectId { get; }
Property Value
ObjectId