Table of Contents
 Struct FullSubentityPath
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbFullSubentPath")]
public struct FullSubentityPath
Inherited Members
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 FullSubentityPath(ObjectId[], SubentityId)
public FullSubentityPath(ObjectId[] ids, SubentityId index)
Parameters
ids ObjectId[]
index SubentityId
Properties
 IsNull
public bool IsNull { get; }
Property Value
bool
 Null
public static FullSubentityPath Null { get; }
Property Value
FullSubentityPath
 SubentId
public SubentityId SubentId { get; }
Property Value
SubentityId
Methods
 CopyToUnmanagedObject(IntPtr)
public void CopyToUnmanagedObject(IntPtr unmanagedPointer)
Parameters
unmanagedPointer IntPtr
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 GetObjectIds()
public ObjectId[] GetObjectIds()
Returns
ObjectId[]
Operators
 operator ==(FullSubentityPath, FullSubentityPath)
public static bool operator ==(FullSubentityPath a, FullSubentityPath b)
Parameters
a FullSubentityPath
b FullSubentityPath
Returns
bool
 operator !=(FullSubentityPath, FullSubentityPath)
public static bool operator !=(FullSubentityPath a, FullSubentityPath b)
Parameters
a FullSubentityPath
b FullSubentityPath
Returns
bool