Table of Contents
 Struct PixelBGRA32
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiPixelBGRA32")]
public struct PixelBGRA32
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 PixelBGRA32()
public PixelBGRA32()
 PixelBGRA32(byte, byte, byte, byte)
public PixelBGRA32(byte blue, byte green, byte red, byte alpha)
Parameters
blue byte
green byte
red byte
alpha byte
 PixelBGRA32(uint)
public PixelBGRA32(uint bgra)
Parameters
bgra uint
Properties
 Alpha
public byte Alpha { get; set; }
Property Value
byte
 Blue
public byte Blue { get; set; }
Property Value
byte
 Green
public byte Green { get; set; }
Property Value
byte
 Red
public byte Red { get; set; }
Property Value
byte
Methods
 init()
public void init()