Table of Contents
 Class SubentityGeometry
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbSubentGeometry")]
public class SubentityGeometry
Inheritance
object
SubentityGeometry
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 SubentityGeometry()
public SubentityGeometry()
 SubentityGeometry(AcDbSubentGeometry*, bool)
protected SubentityGeometry(AcDbSubentGeometry* unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr AcDbSubentGeometry*
autoDelete bool
 SubentityGeometry(Curve3d)
public SubentityGeometry(Curve3d curve)
Parameters
curve Curve3d
 SubentityGeometry(Point3d)
public SubentityGeometry(Point3d pnt)
Parameters
pnt Point3d
Properties
 Curve
public Curve3d Curve { get; }
Property Value
Curve3d
 Point
public Point3d Point { get; }
Property Value
Point3d
 Type
public SubentityType Type { get; }
Property Value
SubentityType