Table of Contents
 Class TextEditorSelection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbTextEditorSelection")]
public class TextEditorSelection : TextEditorSelectionbase, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
TextEditorSelectionbase
TextEditorSelection
Implements
IDisposable
Inherited Members
 TextEditorSelectionbase.InsertSymbol(char, int)
 TextEditorSelectionbase.InsertString(string)
 TextEditorSelectionbase.InsertImportedText(TextEditorSelectionbase.InsertTextType, byte[])
 TextEditorSelectionbase.InputSpecialChar(char)
 TextEditorSelectionbase.InsertColumnBreak()
 TextEditorSelectionbase.MaxWidthScale
 TextEditorSelectionbase.MinWidthScale
 TextEditorSelectionbase.MaxTrackingFactor
 TextEditorSelectionbase.MinTrackingFactor
 TextEditorSelectionbase.MaxObliqueAngle
 TextEditorSelectionbase.MinObliqueAngle
 TextEditorSelectionbase.FlowAlignment
 TextEditorSelectionbase.WidthScale
 TextEditorSelectionbase.TrackingFactor
 TextEditorSelectionbase.ObliqueAngle
 TextEditorSelectionbase.Strikethrough
 TextEditorSelectionbase.Overline
 TextEditorSelectionbase.Underline
 TextEditorSelectionbase.Color
 TextEditorSelectionbase.Height
 TextEditorSelectionbase.Italic
 TextEditorSelectionbase.Bold
 TextEditorSelectionbase.Font
 TextEditorSelectionbase.Language
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 CanChangeCase
public bool CanChangeCase { get; }
Property Value
bool
 CanStack
public bool CanStack { get; }
Property Value
bool
 CanUnStack
public bool CanUnStack { get; }
Property Value
bool
 FieldObject
public Field FieldObject { get; }
Property Value
Field
 Paragraphs
public TextEditorParagraph[] Paragraphs { get; }
Property Value
TextEditorParagraph[]
 SelectionString
public string SelectionString { get; }
Property Value
string
 SingleFieldSelected
public bool SingleFieldSelected { get; }
Property Value
bool
 SingleStackSelected
public bool SingleStackSelected { get; }
Property Value
bool
 StackSettings
public TextEditorStack StackSettings { get; set; }
Property Value
TextEditorStack
Methods
 CanSupportFont(Font)
public bool CanSupportFont(Font font)
Parameters
font Font
Returns
bool
 CanSupportLanguage(int)
public bool CanSupportLanguage(int charset)
Parameters
charset int
Returns
bool
 ChangeToLowercase()
public bool ChangeToLowercase()
Returns
bool
 ChangeToUppercase()
public bool ChangeToUppercase()
Returns
bool
 CombineParagraphs()
public void CombineParagraphs()
 ConvertToPlainText()
public void ConvertToPlainText()
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 RemoveAllFormatting()
public void RemoveAllFormatting()
 RemoveCharacterFormatting()
public void RemoveCharacterFormatting()
 RemoveParagraphFormatting()
public void RemoveParagraphFormatting()
 Stack()
public void Stack()
 UnStack()
public void UnStack()
 UpdateField()
public void UpdateField()