Table of Contents
 Struct Transparency
Namespace
Autodesk.AutoCAD.Colors
Assembly
Acdbmgd.dll
[Wrapper("AcCmTransparency")]
public struct Transparency
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 Transparency(TransparencyMethod)
public Transparency(TransparencyMethod method)
Parameters
method TransparencyMethod
 Transparency(byte)
public Transparency(byte alpha)
Parameters
alpha byte
Properties
 Alpha
public byte Alpha { get; }
Property Value
byte
 IsByAlpha
public bool IsByAlpha { get; }
Property Value
bool
 IsByBlock
public bool IsByBlock { get; }
Property Value
bool
 IsByLayer
public bool IsByLayer { get; }
Property Value
bool
 IsClear
public bool IsClear { get; }
Property Value
bool
 IsInvalid
public bool IsInvalid { get; }
Property Value
bool
 IsSolid
public bool IsSolid { get; }
Property Value
bool
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
Operators
 operator ==(Transparency, Transparency)
public static bool operator ==(Transparency a, Transparency b)
Parameters
a Transparency
b Transparency
Returns
bool
 operator !=(Transparency, Transparency)
public static bool operator !=(Transparency a, Transparency b)
Parameters
a Transparency
b Transparency
Returns
bool