Table of Contents
 Class Database
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDatabase")]
public sealed class Database : RXObject, IDisposable, ICloneable, IDynamicMetaObjectProvider
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Database
Implements
IDisposable
ICloneable
IDynamicMetaObjectProvider
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Database()
public Database()
 Database(bool, bool)
public Database(bool buildDefaultDrawing, bool noDocument)
Parameters
buildDefaultDrawing bool
noDocument bool
Properties
 AcadDatabase
public object AcadDatabase { get; }
Property Value
object
 AllowExtendedNames
public bool AllowExtendedNames { get; set; }
Property Value
bool
 Angbase
public double Angbase { get; set; }
Property Value
double
 Angdir
public bool Angdir { get; set; }
Property Value
bool
 AnnoAllVisible
public bool AnnoAllVisible { get; set; }
Property Value
bool
 AnnotativeDwg
public bool AnnotativeDwg { get; set; }
Property Value
bool
 ApproxNumObjects
public int ApproxNumObjects { get; }
Property Value
int
 Attmode
public int Attmode { get; set; }
Property Value
int
 Aunits
public int Aunits { get; set; }
Property Value
int
 Auprec
public int Auprec { get; set; }
Property Value
int
 BlockTableId
public ObjectId BlockTableId { get; }
Property Value
ObjectId
 ByBlockLinetype
public ObjectId ByBlockLinetype { get; }
Property Value
ObjectId
 ByLayerLinetype
public ObjectId ByLayerLinetype { get; }
Property Value
ObjectId
 CameraDisplay
public bool CameraDisplay { get; set; }
Property Value
bool
 CameraHeight
public double CameraHeight { get; set; }
Property Value
double
 Cannoscale
public AnnotationScale Cannoscale { get; set; }
Property Value
AnnotationScale
 Cecolor
public Color Cecolor { get; set; }
Property Value
Color
 Celtscale
public double Celtscale { get; set; }
Property Value
double
 Celtype
public ObjectId Celtype { get; set; }
Property Value
ObjectId
 Celweight
public LineWeight Celweight { get; set; }
Property Value
LineWeight
 Cetransparency
public Transparency Cetransparency { get; set; }
Property Value
Transparency
 Chamfera
public double Chamfera { get; set; }
Property Value
double
 Chamferb
public double Chamferb { get; set; }
Property Value
double
 Chamferc
public double Chamferc { get; set; }
Property Value
double
 Chamferd
public double Chamferd { get; set; }
Property Value
double
 Clayer
public ObjectId Clayer { get; set; }
Property Value
ObjectId
 Cmaterial
public ObjectId Cmaterial { get; set; }
Property Value
ObjectId
 Cmljust
public int Cmljust { get; set; }
Property Value
int
 Cmlscale
public double Cmlscale { get; set; }
Property Value
double
 CmlstyleID
public ObjectId CmlstyleID { get; set; }
Property Value
ObjectId
 ColorDictionaryId
public ObjectId ColorDictionaryId { get; }
Property Value
ObjectId
 ContinuousLinetype
public ObjectId ContinuousLinetype { get; }
Property Value
ObjectId
 Cshadow
public int Cshadow { get; set; }
Property Value
int
 CurrentSpaceId
public ObjectId CurrentSpaceId { get; }
Property Value
ObjectId
 CurrentViewportTableRecordId
public ObjectId CurrentViewportTableRecordId { get; }
Property Value
ObjectId
 DataLinkDictionaryId
public ObjectId DataLinkDictionaryId { get; }
Property Value
ObjectId
 DataLinkManager
public DataLinkManager DataLinkManager { get; }
Property Value
DataLinkManager
 DetailViewStyle
public ObjectId DetailViewStyle { get; set; }
Property Value
ObjectId
 DetailViewStyleDictionaryId
public ObjectId DetailViewStyleDictionaryId { get; }
Property Value
ObjectId
 DgnFrame
public int DgnFrame { get; set; }
Property Value
int
 DimAssoc
public int DimAssoc { get; set; }
Property Value
int
 DimStyleTableId
public ObjectId DimStyleTableId { get; }
Property Value
ObjectId
 Dimadec
public int Dimadec { get; set; }
Property Value
int
 Dimalt
public bool Dimalt { get; set; }
Property Value
bool
 Dimaltd
public int Dimaltd { get; set; }
Property Value
int
 Dimaltf
public double Dimaltf { get; set; }
Property Value
double
 Dimaltrnd
public double Dimaltrnd { get; set; }
Property Value
double
 Dimalttd
public int Dimalttd { get; set; }
Property Value
int
 Dimalttz
public int Dimalttz { get; set; }
Property Value
int
 Dimaltu
public int Dimaltu { get; set; }
Property Value
int
 Dimaltz
public int Dimaltz { get; set; }
Property Value
int
 Dimapost
public string Dimapost { get; set; }
Property Value
string
 Dimarcsym
public int Dimarcsym { get; set; }
Property Value
int
 Dimaso
public bool Dimaso { get; set; }
Property Value
bool
 Dimasz
public double Dimasz { get; set; }
Property Value
double
 Dimatfit
public int Dimatfit { get; set; }
Property Value
int
 Dimaunit
public int Dimaunit { get; set; }
Property Value
int
 Dimazin
public int Dimazin { get; set; }
Property Value
int
 Dimblk
public ObjectId Dimblk { get; set; }
Property Value
ObjectId
 Dimblk1
public ObjectId Dimblk1 { get; set; }
Property Value
ObjectId
 Dimblk2
public ObjectId Dimblk2 { get; set; }
Property Value
ObjectId
 Dimcen
public double Dimcen { get; set; }
Property Value
double
 Dimclrd
public Color Dimclrd { get; set; }
Property Value
Color
 Dimclre
public Color Dimclre { get; set; }
Property Value
Color
 Dimclrt
public Color Dimclrt { get; set; }
Property Value
Color
 Dimdec
public int Dimdec { get; set; }
Property Value
int
 Dimdle
public double Dimdle { get; set; }
Property Value
double
 Dimdli
public double Dimdli { get; set; }
Property Value
double
 Dimdsep
public char Dimdsep { get; set; }
Property Value
char
 Dimexe
public double Dimexe { get; set; }
Property Value
double
 Dimexo
public double Dimexo { get; set; }
Property Value
double
 Dimfrac
public int Dimfrac { get; set; }
Property Value
int
 Dimfxlen
public double Dimfxlen { get; set; }
Property Value
double
 DimfxlenOn
public bool DimfxlenOn { get; set; }
Property Value
bool
 Dimgap
public double Dimgap { get; set; }
Property Value
double
 Dimjogang
public double Dimjogang { get; set; }
Property Value
double
 Dimjust
public int Dimjust { get; set; }
Property Value
int
 Dimldrblk
public ObjectId Dimldrblk { get; set; }
Property Value
ObjectId
 Dimlfac
public double Dimlfac { get; set; }
Property Value
double
 Dimlim
public bool Dimlim { get; set; }
Property Value
bool
 Dimltex1
public ObjectId Dimltex1 { get; set; }
Property Value
ObjectId
 Dimltex2
public ObjectId Dimltex2 { get; set; }
Property Value
ObjectId
 Dimltype
public ObjectId Dimltype { get; set; }
Property Value
ObjectId
 Dimlunit
public int Dimlunit { get; set; }
Property Value
int
 Dimlwd
public LineWeight Dimlwd { get; set; }
Property Value
LineWeight
 Dimlwe
public LineWeight Dimlwe { get; set; }
Property Value
LineWeight
 Dimpost
public string Dimpost { get; set; }
Property Value
string
 Dimrnd
public double Dimrnd { get; set; }
Property Value
double
 Dimsah
public bool Dimsah { get; set; }
Property Value
bool
 Dimscale
public double Dimscale { get; set; }
Property Value
double
 Dimsd1
public bool Dimsd1 { get; set; }
Property Value
bool
 Dimsd2
public bool Dimsd2 { get; set; }
Property Value
bool
 Dimse1
public bool Dimse1 { get; set; }
Property Value
bool
 Dimse2
public bool Dimse2 { get; set; }
Property Value
bool
 Dimsho
public bool Dimsho { get; set; }
Property Value
bool
 Dimsoxd
public bool Dimsoxd { get; set; }
Property Value
bool
 Dimstyle
public ObjectId Dimstyle { get; set; }
Property Value
ObjectId
 Dimtad
public int Dimtad { get; set; }
Property Value
int
 Dimtdec
public int Dimtdec { get; set; }
Property Value
int
 Dimtfac
public double Dimtfac { get; set; }
Property Value
double
 Dimtfill
public int Dimtfill { get; set; }
Property Value
int
 Dimtfillclr
public Color Dimtfillclr { get; set; }
Property Value
Color
 Dimtih
public bool Dimtih { get; set; }
Property Value
bool
 Dimtix
public bool Dimtix { get; set; }
Property Value
bool
 Dimtm
public double Dimtm { get; set; }
Property Value
double
 Dimtmove
public int Dimtmove { get; set; }
Property Value
int
 Dimtofl
public bool Dimtofl { get; set; }
Property Value
bool
 Dimtoh
public bool Dimtoh { get; set; }
Property Value
bool
 Dimtol
public bool Dimtol { get; set; }
Property Value
bool
 Dimtolj
public int Dimtolj { get; set; }
Property Value
int
 Dimtp
public double Dimtp { get; set; }
Property Value
double
 Dimtsz
public double Dimtsz { get; set; }
Property Value
double
 Dimtvp
public double Dimtvp { get; set; }
Property Value
double
 Dimtxsty
public ObjectId Dimtxsty { get; set; }
Property Value
ObjectId
 Dimtxt
public double Dimtxt { get; set; }
Property Value
double
 Dimtxtdirection
public bool Dimtxtdirection { get; set; }
Property Value
bool
 Dimtzin
public int Dimtzin { get; set; }
Property Value
int
 Dimupt
public bool Dimupt { get; set; }
Property Value
bool
 Dimzin
public int Dimzin { get; set; }
Property Value
int
 DispSilh
public bool DispSilh { get; set; }
Property Value
bool
 DrawOrderCtl
public byte DrawOrderCtl { get; set; }
Property Value
byte
 DwfFrame
public int DwfFrame { get; set; }
Property Value
int
 DwgFileWasSavedByAutodeskSoftware
public bool DwgFileWasSavedByAutodeskSoftware { get; }
Property Value
bool
 DxEval
public int DxEval { get; set; }
Property Value
int
 Elevation
public double Elevation { get; set; }
Property Value
double
 EndCaps
public EndCap EndCaps { get; set; }
Property Value
EndCap
 Extmax
public Point3d Extmax { get; set; }
Property Value
Point3d
 Extmin
public Point3d Extmin { get; set; }
Property Value
Point3d
 Facetres
public double Facetres { get; set; }
Property Value
double
 FileDependencyManager
public FileDependencyManager FileDependencyManager { get; }
Property Value
FileDependencyManager
 Filename
public string Filename { get; }
Property Value
string
 Filletrad
public double Filletrad { get; set; }
Property Value
double
 Fillmode
public bool Fillmode { get; set; }
Property Value
bool
 FingerprintGuid
public string FingerprintGuid { get; set; }
Property Value
string
 GeoDataObject
public ObjectId GeoDataObject { get; }
Property Value
ObjectId
 GroupDictionaryId
public ObjectId GroupDictionaryId { get; }
Property Value
ObjectId
 HaloGap
public int HaloGap { get; set; }
Property Value
int
 Handseed
public Handle Handseed { get; set; }
Property Value
Handle
 HideText
public int HideText { get; set; }
Property Value
int
 HomeView
public DbHomeView HomeView { get; set; }
Property Value
DbHomeView
 HpInherit
public bool HpInherit { get; set; }
Property Value
bool
 HpOrigin
public Point2d HpOrigin { get; set; }
Property Value
Point2d
 HyperlinkBase
public string HyperlinkBase { get; set; }
Property Value
string
 Indexctl
public int Indexctl { get; set; }
Property Value
int
 Insbase
public Point3d Insbase { get; set; }
Property Value
Point3d
 Insunits
public UnitsValue Insunits { get; set; }
Property Value
UnitsValue
 Interferecolor
public Color Interferecolor { get; set; }
Property Value
Color
 Interfereobjvs
public ObjectId Interfereobjvs { get; set; }
Property Value
ObjectId
 Interferevpvs
public ObjectId Interferevpvs { get; set; }
Property Value
ObjectId
 IntersectColor
public int IntersectColor { get; set; }
Property Value
int
 IntersectDisplay
public int IntersectDisplay { get; set; }
Property Value
int
 IsPartiallyOpened
public bool IsPartiallyOpened { get; }
Property Value
bool
 Isolines
public int Isolines { get; set; }
Property Value
int
 JoinStyle
public JoinStyle JoinStyle { get; set; }
Property Value
JoinStyle
 LastSavedAsMaintenanceVersion
public MaintenanceReleaseVersion LastSavedAsMaintenanceVersion { get; }
Property Value
MaintenanceReleaseVersion
 LastSavedAsVersion
public DwgVersion LastSavedAsVersion { get; }
Property Value
DwgVersion
 Latitude
public double Latitude { get; set; }
Property Value
double
 LayerEval
public int LayerEval { get; set; }
Property Value
int
 LayerFilters
public LayerFilterTree LayerFilters { get; set; }
Property Value
LayerFilterTree
 LayerNotify
public int LayerNotify { get; set; }
Property Value
int
 LayerStateManager
public LayerStateManager LayerStateManager { get; }
Property Value
LayerStateManager
 LayerTableId
public ObjectId LayerTableId { get; }
Property Value
ObjectId
 LayerZero
public ObjectId LayerZero { get; }
Property Value
ObjectId
 LayoutDictionaryId
public ObjectId LayoutDictionaryId { get; }
Property Value
ObjectId
 LensLength
public double LensLength { get; set; }
Property Value
double
 LightGlyphDisplay
public int LightGlyphDisplay { get; set; }
Property Value
int
 LightingUnits
public byte LightingUnits { get; set; }
Property Value
byte
 LightsInBlocks
public bool LightsInBlocks { get; set; }
Property Value
bool
 Limcheck
public bool Limcheck { get; set; }
Property Value
bool
 Limmax
public Point2d Limmax { get; set; }
Property Value
Point2d
 Limmin
public Point2d Limmin { get; set; }
Property Value
Point2d
 LineWeightDisplay
public bool LineWeightDisplay { get; set; }
Property Value
bool
 LinetypeTableId
public ObjectId LinetypeTableId { get; }
Property Value
ObjectId
 LoftAng1
public double LoftAng1 { get; set; }
Property Value
double
 LoftAng2
public double LoftAng2 { get; set; }
Property Value
double
 LoftMag1
public double LoftMag1 { get; set; }
Property Value
double
 LoftMag2
public double LoftMag2 { get; set; }
Property Value
double
 LoftNormals
public int LoftNormals { get; set; }
Property Value
int
 LoftParam
public int LoftParam { get; set; }
Property Value
int
 Longitude
public double Longitude { get; set; }
Property Value
double
 Ltscale
public double Ltscale { get; set; }
Property Value
double
 Lunits
public int Lunits { get; set; }
Property Value
int
 Luprec
public int Luprec { get; set; }
Property Value
int
 MLStyleDictionaryId
public ObjectId MLStyleDictionaryId { get; }
Property Value
ObjectId
 MLeaderStyleDictionaryId
public ObjectId MLeaderStyleDictionaryId { get; }
Property Value
ObjectId
 MLeaderstyle
public ObjectId MLeaderstyle { get; set; }
Property Value
ObjectId
 MaintenanceReleaseVersion
public int MaintenanceReleaseVersion { get; }
Property Value
int
 MaterialDictionaryId
public ObjectId MaterialDictionaryId { get; }
Property Value
ObjectId
 Maxactvp
public int Maxactvp { get; set; }
Property Value
int
 Measurement
public MeasurementValue Measurement { get; set; }
Property Value
MeasurementValue
 Menu
public string Menu { get; }
Property Value
string
 Mirrtext
public bool Mirrtext { get; set; }
Property Value
bool
 MsLtScale
public bool MsLtScale { get; set; }
Property Value
bool
 MsOleScale
public double MsOleScale { get; set; }
Property Value
double
 NamedObjectsDictionaryId
public ObjectId NamedObjectsDictionaryId { get; }
Property Value
ObjectId
 NorthDirection
public double NorthDirection { get; set; }
Property Value
double
 NumberOfSaves
public int NumberOfSaves { get; }
Property Value
int
 ObjectContextManager
public ObjectContextManager ObjectContextManager { get; }
Property Value
ObjectContextManager
 ObscuredColor
public int ObscuredColor { get; set; }
Property Value
int
 ObscuredLineType
public int ObscuredLineType { get; set; }
Property Value
int
 OleStartUp
public bool OleStartUp { get; set; }
Property Value
bool
 OriginalFileMaintenanceVersion
public MaintenanceReleaseVersion OriginalFileMaintenanceVersion { get; }
Property Value
MaintenanceReleaseVersion
 OriginalFileName
public string OriginalFileName { get; }
Property Value
string
 OriginalFileSavedByMaintenanceVersion
public MaintenanceReleaseVersion OriginalFileSavedByMaintenanceVersion { get; }
Property Value
MaintenanceReleaseVersion
 OriginalFileSavedByVersion
public DwgVersion OriginalFileSavedByVersion { get; }
Property Value
DwgVersion
 OriginalFileVersion
public DwgVersion OriginalFileVersion { get; }
Property Value
DwgVersion
 Orthomode
public bool Orthomode { get; set; }
Property Value
bool
 PaperSpaceVportId
public ObjectId PaperSpaceVportId { get; }
Property Value
ObjectId
 PdfFrame
public int PdfFrame { get; set; }
Property Value
int
 Pdmode
public int Pdmode { get; set; }
Property Value
int
 Pdsize
public double Pdsize { get; set; }
Property Value
double
 Pelevation
public double Pelevation { get; set; }
Property Value
double
 Pextmax
public Point3d Pextmax { get; set; }
Property Value
Point3d
 Pextmin
public Point3d Pextmin { get; set; }
Property Value
Point3d
 Pinsbase
public Point3d Pinsbase { get; set; }
Property Value
Point3d
 Plimcheck
public bool Plimcheck { get; set; }
Property Value
bool
 Plimmax
public Point2d Plimmax { get; set; }
Property Value
Point2d
 Plimmin
public Point2d Plimmin { get; set; }
Property Value
Point2d
 PlineEllipse
public bool PlineEllipse { get; set; }
Property Value
bool
 Plinegen
public bool Plinegen { get; set; }
Property Value
bool
 Plinewid
public double Plinewid { get; set; }
Property Value
double
 PlotSettingsDictionaryId
public ObjectId PlotSettingsDictionaryId { get; }
Property Value
ObjectId
 PlotStyleMode
public bool PlotStyleMode { get; }
Property Value
bool
 PlotStyleNameDictionaryId
public ObjectId PlotStyleNameDictionaryId { get; }
Property Value
ObjectId
 PlotStyleNameId
public PlotStyleDescriptor PlotStyleNameId { get; set; }
Property Value
PlotStyleDescriptor
 ProjectName
public string ProjectName { get; set; }
Property Value
string
 Psltscale
public bool Psltscale { get; set; }
Property Value
bool
 PsolHeight
public double PsolHeight { get; set; }
Property Value
double
 PsolWidth
public double PsolWidth { get; set; }
Property Value
double
 Pucs
public CoordinateSystem3d Pucs { set; }
Property Value
CoordinateSystem3d
 PucsBase
public ObjectId PucsBase { get; set; }
Property Value
ObjectId
 PucsOrthographic
public OrthographicView PucsOrthographic { get; }
Property Value
OrthographicView
 Pucsname
public ObjectId Pucsname { get; set; }
Property Value
ObjectId
 Pucsorg
public Point3d Pucsorg { get; }
Property Value
Point3d
 Pucsxdir
public Vector3d Pucsxdir { get; }
Property Value
Vector3d
 Pucsydir
public Vector3d Pucsydir { get; }
Property Value
Vector3d
 Qtextmode
public bool Qtextmode { get; set; }
Property Value
bool
 RegAppTableId
public ObjectId RegAppTableId { get; }
Property Value
ObjectId
 Regenmode
public bool Regenmode { get; set; }
Property Value
bool
 RetainOriginalThumbnailBitmap
public bool RetainOriginalThumbnailBitmap { get; set; }
Property Value
bool
 Saveproxygraphics
public int Saveproxygraphics { get; set; }
Property Value
int
 SectionManagerId
public ObjectId SectionManagerId { get; }
Property Value
ObjectId
 SectionViewStyle
public ObjectId SectionViewStyle { get; set; }
Property Value
ObjectId
 SectionViewStyleDictionaryId
public ObjectId SectionViewStyleDictionaryId { get; }
Property Value
ObjectId
 SecurityParameters
public SecurityParameters SecurityParameters { get; set; }
Property Value
SecurityParameters
 Shadedge
public int Shadedge { get; set; }
Property Value
int
 Shadedif
public int Shadedif { get; set; }
Property Value
int
 ShadowPlaneLocation
public double ShadowPlaneLocation { get; set; }
Property Value
double
 ShowHist
public int ShowHist { get; set; }
Property Value
int
 Sketchinc
public double Sketchinc { get; set; }
Property Value
double
 Skpoly
public bool Skpoly { get; set; }
Property Value
bool
 SolidHist
public int SolidHist { get; set; }
Property Value
int
 SortEnts
public int SortEnts { get; set; }
Property Value
int
 Splframe
public bool Splframe { get; set; }
Property Value
bool
 Splinesegs
public int Splinesegs { get; set; }
Property Value
int
 Splinetype
public int Splinetype { get; set; }
Property Value
int
 StepSize
public double StepSize { get; set; }
Property Value
double
 StepsPerSec
public double StepsPerSec { get; set; }
Property Value
double
 StyleSheet
public string StyleSheet { get; set; }
Property Value
string
 SummaryInfo
public DatabaseSummaryInfo SummaryInfo { get; set; }
Property Value
DatabaseSummaryInfo
 Surftab1
public int Surftab1 { get; set; }
Property Value
int
 Surftab2
public int Surftab2 { get; set; }
Property Value
int
 Surftype
public int Surftype { get; set; }
Property Value
int
 Surfu
public int Surfu { get; set; }
Property Value
int
 Surfv
public int Surfv { get; set; }
Property Value
int
 TStackAlign
public int TStackAlign { get; set; }
Property Value
int
 TableStyleDictionaryId
public ObjectId TableStyleDictionaryId { get; }
Property Value
ObjectId
 Tablestyle
public ObjectId Tablestyle { get; set; }
Property Value
ObjectId
 Tdcreate
public DateTime Tdcreate { get; }
Property Value
DateTime
 Tdindwg
public TimeSpan Tdindwg { get; }
Property Value
TimeSpan
 Tducreate
public DateTime Tducreate { get; }
Property Value
DateTime
 Tdupdate
public DateTime Tdupdate { get; }
Property Value
DateTime
 Tdusrtimer
public TimeSpan Tdusrtimer { get; }
Property Value
TimeSpan
 Tduupdate
public DateTime Tduupdate { get; }
Property Value
DateTime
 TextStyleTableId
public ObjectId TextStyleTableId { get; }
Property Value
ObjectId
 Textsize
public double Textsize { get; set; }
Property Value
double
 Textstyle
public ObjectId Textstyle { get; set; }
Property Value
ObjectId
 Thickness
public double Thickness { get; set; }
Property Value
double
 ThumbnailBitmap
public Bitmap ThumbnailBitmap { get; set; }
Property Value
Bitmap
 TileMode
public bool TileMode { get; set; }
Property Value
bool
 TileModeLightSynch
public int TileModeLightSynch { get; set; }
Property Value
int
 TimeZone
public TimeZone TimeZone { get; set; }
Property Value
TimeZone
 Tracewid
public double Tracewid { get; set; }
Property Value
double
 TransactionManager
public TransactionManager TransactionManager { get; }
Property Value
TransactionManager
 Treedepth
public int Treedepth { get; set; }
Property Value
int
 TstackSize
public int TstackSize { get; set; }
Property Value
int
 Ucs
public CoordinateSystem3d Ucs { set; }
Property Value
CoordinateSystem3d
 UcsBase
public ObjectId UcsBase { get; set; }
Property Value
ObjectId
 UcsOrthographic
public OrthographicView UcsOrthographic { get; }
Property Value
OrthographicView
 UcsTableId
public ObjectId UcsTableId { get; }
Property Value
ObjectId
 Ucsname
public ObjectId Ucsname { get; set; }
Property Value
ObjectId
 Ucsorg
public Point3d Ucsorg { get; }
Property Value
Point3d
 Ucsxdir
public Vector3d Ucsxdir { get; }
Property Value
Vector3d
 Ucsydir
public Vector3d Ucsydir { get; }
Property Value
Vector3d
 UndoRecording
public bool UndoRecording { get; }
Property Value
bool
 Unitmode
public int Unitmode { get; set; }
Property Value
int
 UpdateThumbnail
public int UpdateThumbnail { get; set; }
Property Value
int
 Useri1
public int Useri1 { get; set; }
Property Value
int
 Useri2
public int Useri2 { get; set; }
Property Value
int
 Useri3
public int Useri3 { get; set; }
Property Value
int
 Useri4
public int Useri4 { get; set; }
Property Value
int
 Useri5
public int Useri5 { get; set; }
Property Value
int
 Userr1
public double Userr1 { get; set; }
Property Value
double
 Userr2
public double Userr2 { get; set; }
Property Value
double
 Userr3
public double Userr3 { get; set; }
Property Value
double
 Userr4
public double Userr4 { get; set; }
Property Value
double
 Userr5
public double Userr5 { get; set; }
Property Value
double
 Usrtimer
public bool Usrtimer { get; set; }
Property Value
bool
 VersionGuid
public string VersionGuid { get; set; }
Property Value
string
 ViewTableId
public ObjectId ViewTableId { get; }
Property Value
ObjectId
 ViewportScaleDefault
public double ViewportScaleDefault { get; set; }
Property Value
double
 ViewportTableId
public ObjectId ViewportTableId { get; }
Property Value
ObjectId
 Visretain
public bool Visretain { get; set; }
Property Value
bool
 VisualStyleDictionaryId
public ObjectId VisualStyleDictionaryId { get; }
Property Value
ObjectId
 Worldview
public bool Worldview { get; set; }
Property Value
bool
 XclipFrame
public int XclipFrame { get; set; }
Property Value
int
 XrefBlockId
public ObjectId XrefBlockId { get; }
Property Value
ObjectId
 XrefEditEnabled
public bool XrefEditEnabled { get; set; }
Property Value
bool
 dragvs
public ObjectId dragvs { get; set; }
Property Value
ObjectId
Methods
 AbortDeepClone(IdMapping)
public void AbortDeepClone(IdMapping idMap)
Parameters
idMap IdMapping
 AddDBObject(DBObject)
public ObjectId AddDBObject(DBObject appendIt)
Parameters
appendIt DBObject
Returns
ObjectId
 ApplyPartialOpenFilters(SpatialFilter, LayerFilter)
public void ApplyPartialOpenFilters(SpatialFilter spatialFilter, LayerFilter layerFilter)
Parameters
spatialFilter SpatialFilter
layerFilter LayerFilter
 AttachXref(string, string)
public ObjectId AttachXref(string fileName, string blockName)
Parameters
fileName string
blockName string
Returns
ObjectId
 AuditXData(AuditInfo)
public void AuditXData(AuditInfo info)
Parameters
info AuditInfo
 BindXrefs(ObjectIdCollection, bool)
public void BindXrefs(ObjectIdCollection xrefIds, bool insertBind)
Parameters
xrefIds ObjectIdCollection
insertBind bool
 ClassDxfName(RXClass)
public string ClassDxfName(RXClass getMyDxfName)
Parameters
getMyDxfName RXClass
Returns
string
 CloseInput(bool)
public void CloseInput(bool closeFile)
Parameters
closeFile bool
 CountEmptyObjects(int)
public int CountEmptyObjects(int flags)
Parameters
flags int
Returns
int
 CountHardReferences(ObjectIdCollection, int[])
public void CountHardReferences(ObjectIdCollection ids, int[] count)
Parameters
ids ObjectIdCollection
count int[]
 DeepCloneObjects(ObjectIdCollection, ObjectId, IdMapping, bool)
public void DeepCloneObjects(ObjectIdCollection identifiers, ObjectId id, IdMapping mapping, bool deferTranslation)
Parameters
identifiers ObjectIdCollection
id ObjectId
mapping IdMapping
deferTranslation bool
 DetachXref(ObjectId)
public void DetachXref(ObjectId xrefId)
Parameters
xrefId ObjectId
 DisablePartialOpen()
public void DisablePartialOpen()
 DisableUndoRecording(bool)
public void DisableUndoRecording(bool disable)
Parameters
disable bool
 DxfIn(string, string)
public void DxfIn(string fileName, string logFilename)
Parameters
fileName string
logFilename string
 DxfOut(string, int, DwgVersion)
public void DxfOut(string fileName, int precision, DwgVersion version)
Parameters
fileName string
precision int
version DwgVersion
 DxfOut(string, int, bool)
public void DxfOut(string fileName, int precision, bool saveThumbnailImage)
Parameters
fileName string
precision int
saveThumbnailImage bool
 EraseEmptyObjects(int)
public int EraseEmptyObjects(int flags)
Parameters
flags int
Returns
int
 EvaluateFields()
public FieldEvaluationResult EvaluateFields()
Returns
FieldEvaluationResult
 EvaluateFields(FieldEvaluationContext)
public FieldEvaluationResult EvaluateFields(FieldEvaluationContext context)
Parameters
context FieldEvaluationContext
Returns
FieldEvaluationResult
 EvaluateFields(FieldEvaluationContext, string)
public FieldEvaluationResult EvaluateFields(FieldEvaluationContext context, string prop)
Parameters
context FieldEvaluationContext
prop string
Returns
FieldEvaluationResult
 ForceWblockDatabaseCopy()
public void ForceWblockDatabaseCopy()
 FromAcadDatabase(object)
public static Database FromAcadDatabase(object acadDatabase)
Parameters
acadDatabase object
Returns
Database
 GetAllDatabases()
public static List<Database> GetAllDatabases()
Returns
List<Database>
 GetDimRecentStyleList()
public ObjectIdCollection GetDimRecentStyleList()
Returns
ObjectIdCollection
 GetDimensionStyleChildData(RXClass)
public DimStyleTableRecord GetDimensionStyleChildData(RXClass classDescriptor)
Parameters
classDescriptor RXClass
Returns
DimStyleTableRecord
 GetDimensionStyleChildId(RXClass, ObjectId)
public ObjectId GetDimensionStyleChildId(RXClass classDescriptor, ObjectId parentStyle)
Parameters
classDescriptor RXClass
parentStyle ObjectId
Returns
ObjectId
 GetDimensionStyleParentId(ObjectId)
public ObjectId GetDimensionStyleParentId(ObjectId childStyle)
Parameters
childStyle ObjectId
Returns
ObjectId
 GetDimstyleData()
public DimStyleTableRecord GetDimstyleData()
Returns
DimStyleTableRecord
 GetHostDwgXrefGraph(bool)
public XrefGraph GetHostDwgXrefGraph(bool includeGhosts)
Parameters
includeGhosts bool
Returns
XrefGraph
 GetMetaObject(Expression)
public DynamicMetaObject GetMetaObject(Expression parameter)
Parameters
parameter Expression
Returns
DynamicMetaObject
 GetNearestLineWeight(int)
public LineWeight GetNearestLineWeight(int weight)
Parameters
weight int
Returns
LineWeight
 GetObjectId(bool, Handle, int)
public ObjectId GetObjectId(bool createIfNotFound, Handle objHandle, int identifier)
Parameters
createIfNotFound bool
objHandle Handle
identifier int
Returns
ObjectId
 GetSupportedDxfOutVersions()
public DwgVersion[] GetSupportedDxfOutVersions()
Returns
DwgVersion[]
 GetSupportedSaveVersions()
public DwgVersion[] GetSupportedSaveVersions()
Returns
DwgVersion[]
 GetViewports(bool)
public ObjectIdCollection GetViewports(bool bGetPaperspaceVports)
Parameters
bGetPaperspaceVports bool
Returns
ObjectIdCollection
 GetVisualStyleList()
public StringCollection GetVisualStyleList()
Returns
StringCollection
 Insert(Matrix3d, Database, bool)
public void Insert(Matrix3d transform, Database dataBase, bool preserveSourceDatabase)
Parameters
transform Matrix3d
dataBase Database
preserveSourceDatabase bool
 Insert(string, Database, bool)
public ObjectId Insert(string blockName, Database dataBase, bool preserveSourceDatabase)
Parameters
blockName string
dataBase Database
preserveSourceDatabase bool
Returns
ObjectId
 Insert(string, string, Database, bool)
public ObjectId Insert(string sourceBlockName, string destinationBlockName, Database dataBase, bool preserveSourceDatabase)
Parameters
sourceBlockName string
destinationBlockName string
dataBase Database
preserveSourceDatabase bool
Returns
ObjectId
 IsObjectNonPersistent(ObjectId)
public static bool IsObjectNonPersistent(ObjectId id)
Parameters
id ObjectId
Returns
bool
 IsValidLineWeight(int)
public bool IsValidLineWeight(int weight)
Parameters
weight int
Returns
bool
 LoadLineTypeFile(string, string)
public void LoadLineTypeFile(string lineTypeName, string filename)
Parameters
lineTypeName string
filename string
 LoadMlineStyleFile(string, string)
public void LoadMlineStyleFile(string mlineStyleName, string fileName)
Parameters
mlineStyleName string
fileName string
 MarkObjectNonPersistent(ObjectId, bool)
public static void MarkObjectNonPersistent(ObjectId id, bool value)
Parameters
id ObjectId
value bool
 OverlayXref(string, string)
public ObjectId OverlayXref(string fileName, string blockName)
Parameters
fileName string
blockName string
Returns
ObjectId
 Purge(ObjectIdCollection)
public void Purge(ObjectIdCollection ids)
Parameters
ids ObjectIdCollection
 Purge(ObjectIdGraph)
public void Purge(ObjectIdGraph idGraph)
Parameters
idGraph ObjectIdGraph
 ReadDwgFile(IntPtr, bool, string)
public void ReadDwgFile(IntPtr drawingFile, bool allowCPConversion, string password)
Parameters
drawingFile IntPtr
allowCPConversion bool
password string
 ReadDwgFile(string, FileOpenMode, bool, string)
public void ReadDwgFile(string fileName, FileOpenMode mode, bool allowCPConversion, string password)
Parameters
fileName string
mode FileOpenMode
allowCPConversion bool
password string
 ReadDwgFile(string, FileShare, bool, string)
public void ReadDwgFile(string fileName, FileShare fileSharing, bool allowCPConversion, string password)
Parameters
fileName string
fileSharing FileShare
allowCPConversion bool
password string
 ReclaimMemoryFromErasedObjects(ObjectIdCollection)
public void ReclaimMemoryFromErasedObjects(ObjectIdCollection ids)
Parameters
ids ObjectIdCollection
 ReloadXrefs(ObjectIdCollection)
public void ReloadXrefs(ObjectIdCollection xrefIds)
Parameters
xrefIds ObjectIdCollection
 ResetTimes()
public void ResetTimes()
 ResolveXrefs(bool, bool)
public void ResolveXrefs(bool useThreadEngine, bool doNewOnly)
Parameters
useThreadEngine bool
doNewOnly bool
 RestoreForwardingXrefSymbols()
public void RestoreForwardingXrefSymbols()
 RestoreOriginalXrefSymbols()
public void RestoreOriginalXrefSymbols()
 Save()
public void Save()
 SaveAs(string, DwgVersion)
public void SaveAs(string fileName, DwgVersion version)
Parameters
fileName string
version DwgVersion
 SaveAs(string, SecurityParameters)
public void SaveAs(string fileName, SecurityParameters security)
Parameters
fileName string
security SecurityParameters
 SaveAs(string, bool, DwgVersion, SecurityParameters)
public void SaveAs(string fileName, bool bBakAndRename, DwgVersion version, SecurityParameters security)
Parameters
fileName string
bBakAndRename bool
version DwgVersion
security SecurityParameters
 SetDimstyleData(DimStyleTableRecord)
public void SetDimstyleData(DimStyleTableRecord style)
Parameters
style DimStyleTableRecord
 SetTimeZoneAsUtcOffset(double)
public TimeZone SetTimeZoneAsUtcOffset(double offset)
Parameters
offset double
Returns
TimeZone
 SetWorldPaperspaceUcsBaseOrigin(Point3d, OrthographicView)
public void SetWorldPaperspaceUcsBaseOrigin(Point3d origin, OrthographicView orthoView)
Parameters
origin Point3d
orthoView OrthographicView
 SetWorldUcsBaseOrigin(Point3d, OrthographicView)
public void SetWorldUcsBaseOrigin(Point3d origin, OrthographicView orthoView)
Parameters
origin Point3d
orthoView OrthographicView
 TimeZoneDescription(TimeZone)
public string TimeZoneDescription(TimeZone tz)
Parameters
tz TimeZone
Returns
string
 TimeZoneOffset(TimeZone)
public double TimeZoneOffset(TimeZone tz)
Parameters
tz TimeZone
Returns
double
 TryGetObjectId(Handle, out ObjectId)
public bool TryGetObjectId(Handle objHandle, out ObjectId id)
Parameters
objHandle Handle
id ObjectId
Returns
bool
 UnloadXrefs(ObjectIdCollection)
public void UnloadXrefs(ObjectIdCollection xrefIds)
Parameters
xrefIds ObjectIdCollection
 UpdateExt(bool)
public void UpdateExt(bool doBestFit)
Parameters
doBestFit bool
 Wblock()
public Database Wblock()
Returns
Database
 Wblock(Database, ObjectIdCollection, Point3d, DuplicateRecordCloning)
public void Wblock(Database outputDataBase, ObjectIdCollection outObjIds, Point3d basePoint, DuplicateRecordCloning cloning)
Parameters
outputDataBase Database
outObjIds ObjectIdCollection
basePoint Point3d
cloning DuplicateRecordCloning
 Wblock(ObjectId)
public Database Wblock(ObjectId blockId)
Parameters
blockId ObjectId
Returns
Database
 Wblock(ObjectIdCollection, Point3d)
public Database Wblock(ObjectIdCollection outObjIds, Point3d basePoint)
Parameters
outObjIds ObjectIdCollection
basePoint Point3d
Returns
Database
 WblockCloneObjects(ObjectIdCollection, ObjectId, IdMapping, DuplicateRecordCloning, bool)
public void WblockCloneObjects(ObjectIdCollection identifiers, ObjectId id, IdMapping mapping, DuplicateRecordCloning cloning, bool deferTranslation)
Parameters
identifiers ObjectIdCollection
id ObjectId
mapping IdMapping
cloning DuplicateRecordCloning
deferTranslation bool
 WorldPaperspaceUcsBaseOrigin(OrthographicView)
public Point3d WorldPaperspaceUcsBaseOrigin(OrthographicView orthoView)
Parameters
orthoView OrthographicView
Returns
Point3d
 WorldUcsBaseOrigin(OrthographicView)
public Point3d WorldUcsBaseOrigin(OrthographicView orthoView)
Parameters
orthoView OrthographicView
Returns
Point3d
 XBindXrefs(ObjectIdCollection, bool)
public void XBindXrefs(ObjectIdCollection xrefSymbolIds, bool insertBind)
Parameters
xrefSymbolIds ObjectIdCollection
insertBind bool
Events
 AbortDxfIn
public event EventHandler AbortDxfIn
Event Type
EventHandler
 AbortDxfOut
public event EventHandler AbortDxfOut
Event Type
EventHandler
 AbortSave
public event EventHandler AbortSave
Event Type
EventHandler
 BeginDeepClone
public event IdMappingEventHandler BeginDeepClone
Event Type
IdMappingEventHandler
 BeginDeepCloneTranslation
public event IdMappingEventHandler BeginDeepCloneTranslation
Event Type
IdMappingEventHandler
 BeginDxfIn
public event EventHandler BeginDxfIn
Event Type
EventHandler
 BeginDxfOut
public event EventHandler BeginDxfOut
Event Type
EventHandler
 BeginInsert
public event BeginInsertEventHandler BeginInsert
Event Type
BeginInsertEventHandler
 BeginSave
public event DatabaseIOEventHandler BeginSave
Event Type
DatabaseIOEventHandler
 BeginWblockBlock
public event BeginWblockBlockEventHandler BeginWblockBlock
Event Type
BeginWblockBlockEventHandler
 BeginWblockEntireDatabase
public event BeginWblockEntireDatabaseEventHandler BeginWblockEntireDatabase
Event Type
BeginWblockEntireDatabaseEventHandler
 BeginWblockObjects
public event BeginWblockObjectsEventHandler BeginWblockObjects
Event Type
BeginWblockObjectsEventHandler
 BeginWblockSelectedObjects
public event BeginWblockSelectedObjectsEventHandler BeginWblockSelectedObjects
Event Type
BeginWblockSelectedObjectsEventHandler
 DatabaseConstructed
public static event EventHandler DatabaseConstructed
Event Type
EventHandler
 DatabaseToBeDestroyed
public event EventHandler DatabaseToBeDestroyed
Event Type
EventHandler
 DeepCloneAborted
public event EventHandler DeepCloneAborted
Event Type
EventHandler
 DeepCloneEnded
public event EventHandler DeepCloneEnded
Event Type
EventHandler
 Disposed
public event EventHandler Disposed
Event Type
EventHandler
 DwgFileOpened
public event DatabaseIOEventHandler DwgFileOpened
Event Type
DatabaseIOEventHandler
 DxfInComplete
public event EventHandler DxfInComplete
Event Type
EventHandler
 DxfOutComplete
public event EventHandler DxfOutComplete
Event Type
EventHandler
 InitialDwgFileOpenComplete
public event EventHandler InitialDwgFileOpenComplete
Event Type
EventHandler
 InsertAborted
public event EventHandler InsertAborted
Event Type
EventHandler
 InsertEnded
public event EventHandler InsertEnded
Event Type
EventHandler
 InsertMappingAvailable
public event IdMappingEventHandler InsertMappingAvailable
Event Type
IdMappingEventHandler
 ObjectAppended
public event ObjectEventHandler ObjectAppended
Event Type
ObjectEventHandler
 ObjectErased
public event ObjectErasedEventHandler ObjectErased
Event Type
ObjectErasedEventHandler
 ObjectModified
public event ObjectEventHandler ObjectModified
Event Type
ObjectEventHandler
 ObjectOpenedForModify
public event ObjectEventHandler ObjectOpenedForModify
Event Type
ObjectEventHandler
 ObjectReappended
public event ObjectEventHandler ObjectReappended
Event Type
ObjectEventHandler
 ObjectUnappended
public event ObjectEventHandler ObjectUnappended
Event Type
ObjectEventHandler
 PartialOpenNotice
public event EventHandler PartialOpenNotice
Event Type
EventHandler
 ProxyResurrectionCompleted
public event ProxyResurrectionCompletedEventHandler ProxyResurrectionCompleted
Event Type
ProxyResurrectionCompletedEventHandler
 SaveComplete
public event DatabaseIOEventHandler SaveComplete
Event Type
DatabaseIOEventHandler
 SystemVariableChanged
public event SystemVariableChangedEventHandler SystemVariableChanged
Event Type
SystemVariableChangedEventHandler
 SystemVariableWillChange
public event SystemVariableChangingEventHandler SystemVariableWillChange
Event Type
SystemVariableChangingEventHandler
 WblockAborted
public event EventHandler WblockAborted
Event Type
EventHandler
 WblockEnded
public event EventHandler WblockEnded
Event Type
EventHandler
 WblockMappingAvailable
public event IdMappingEventHandler WblockMappingAvailable
Event Type
IdMappingEventHandler
 WblockNotice
public event WblockNoticeEventHandler WblockNotice
Event Type
WblockNoticeEventHandler
 XrefAttachAborted
public static event EventHandler XrefAttachAborted
Event Type
EventHandler
 XrefAttachEnded
public event EventHandler XrefAttachEnded
Event Type
EventHandler
 XrefBeginAttached
public event XrefBeginOperationEventHandler XrefBeginAttached
Event Type
XrefBeginOperationEventHandler
 XrefBeginOtherAttached
public event XrefBeginOperationEventHandler XrefBeginOtherAttached
Event Type
XrefBeginOperationEventHandler
 XrefBeginRestore
public event XrefBeginOperationEventHandler XrefBeginRestore
Event Type
XrefBeginOperationEventHandler
 XrefComandeered
public event XrefComandeeredEventHandler XrefComandeered
Event Type
XrefComandeeredEventHandler
 XrefPreXrefLockFile
public event XrefPreXrefLockFileEventHandler XrefPreXrefLockFile
Event Type
XrefPreXrefLockFileEventHandler
 XrefRedirected
public event XrefRedirectedEventHandler XrefRedirected
Event Type
XrefRedirectedEventHandler
 XrefRestoreAborted
public event EventHandler XrefRestoreAborted
Event Type
EventHandler
 XrefRestoreEnded
public event EventHandler XrefRestoreEnded
Event Type
EventHandler
 XrefSubCommandAborted
public event XrefSubCommandAbortedEventHandler XrefSubCommandAborted
Event Type
XrefSubCommandAbortedEventHandler
 XrefSubCommandEnd
public event XrefSubCommandEndEventHandler XrefSubCommandEnd
Event Type
XrefSubCommandEndEventHandler
 XrefSubCommandStart
public event XrefSubCommandStartEventHandler XrefSubCommandStart
Event Type
XrefSubCommandStartEventHandler