Table of Contents
 Enum TransparencyMethod
Namespace
Autodesk.AutoCAD.Colors
Assembly
Acdbmgd.dll
[Wrapper("AcCmTransparency::transparencyMethod")]
public enum TransparencyMethod
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ByAlpha = 2
ByBlock = 1
ByLayer = 0
ErrorValue = 3