Table of Contents
 Struct NurbCurve3dFitData
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public struct NurbCurve3dFitData
Inherited Members
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Properties
 Degree
public int Degree { get; }
Property Value
int
 EndTangent
public Vector3d EndTangent { get; }
Property Value
Vector3d
 FitPoints
public Point3dCollection FitPoints { get; }
Property Value
Point3dCollection
 FitTolerance
public Tolerance FitTolerance { get; }
Property Value
Tolerance
 KnotParam
public KnotParameterizationEnum KnotParam { get; }
Property Value
KnotParameterizationEnum
 StartTangent
public Vector3d StartTangent { get; }
Property Value
Vector3d
 TangentsExist
public bool TangentsExist { get; }
Property Value
bool
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 IsEqualTo(NurbCurve3dFitData)
public bool IsEqualTo(NurbCurve3dFitData a)
Parameters
a NurbCurve3dFitData
Returns
bool
Operators
 operator ==(NurbCurve3dFitData, NurbCurve3dFitData)
public static bool operator ==(NurbCurve3dFitData a, NurbCurve3dFitData b)
Parameters
a NurbCurve3dFitData
b NurbCurve3dFitData
Returns
bool
 operator !=(NurbCurve3dFitData, NurbCurve3dFitData)
public static bool operator !=(NurbCurve3dFitData a, NurbCurve3dFitData b)
Parameters
a NurbCurve3dFitData
b NurbCurve3dFitData
Returns
bool