Table of Contents
 Class ParameterValueSet
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbParameterValueSet")]
public abstract class ParameterValueSet : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
ParameterValueSet
Implements
IDisposable
Derived
ParameterValueSetList
ParameterValueSetMinMax
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 DataType
public DataType DataType { get; }
Property Value
DataType
Methods
 CopyFrom(RXObject)
public void CopyFrom(RXObject obj)
Parameters
obj RXObject
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 GetClosestLegalValue(ResultBuffer)
public ResultBuffer GetClosestLegalValue(ResultBuffer value)
Parameters
value ResultBuffer
Returns
ResultBuffer
 ValueIsLegal(ResultBuffer)
public bool ValueIsLegal(ResultBuffer value)
Parameters
value ResultBuffer
Returns
bool