Table of Contents
 Class NonEntityTraits
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiNonEntityTraits")]
public class NonEntityTraits : DrawableTraits, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
SubEntityTraits
DrawableTraits
NonEntityTraits
Implements
IDisposable
ICloneable
Derived
GradientBackgroundTraits
GroundPlaneBackgroundTraits
IBLBackgroundTraits
ImageBackgroundTraits
LightTraits
MaterialTraits
RapidRTRenderSettingsTraits
RenderEnvironmentTraits
RenderSettingsTraits
SkyBackgroundTraits
SolidBackgroundTraits
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 NonEntityTraits(IntPtr, bool)
protected NonEntityTraits(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 Color
public override sealed short Color { get; set; }
Property Value
short
 DrawFlags
public override sealed int DrawFlags { get; set; }
Property Value
int
 Fill
public override sealed Fill Fill { get; set; }
Property Value
Fill
 FillType
public override sealed FillType FillType { get; set; }
Property Value
FillType
 Layer
public override sealed ObjectId Layer { get; set; }
Property Value
ObjectId
 LinePattern
public override sealed Linetype LinePattern { get; set; }
Property Value
Linetype
 LineType
public override sealed ObjectId LineType { get; set; }
Property Value
ObjectId
 LineTypeScale
public override sealed double LineTypeScale { get; set; }
Property Value
double
 LineWeight
public override sealed LineWeight LineWeight { get; set; }
Property Value
LineWeight
 Mapper
public override sealed Mapper Mapper { get; set; }
Property Value
Mapper
 Material
public override sealed ObjectId Material { get; set; }
Property Value
ObjectId
 PlotStyleDescriptor
public override sealed PlotStyleDescriptor PlotStyleDescriptor { get; set; }
Property Value
PlotStyleDescriptor
 Sectionable
public override sealed bool Sectionable { get; set; }
Property Value
bool
 SelectionFlags
public override sealed SelectionFlags SelectionFlags { get; set; }
Property Value
SelectionFlags
 SelectionOnlyGeometry
public override sealed bool SelectionOnlyGeometry { get; set; }
Property Value
bool
 ShadowFlags
public override sealed ShadowFlags ShadowFlags { get; set; }
Property Value
ShadowFlags
 Thickness
public override sealed double Thickness { get; set; }
Property Value
double
 Transparency
public override sealed Transparency Transparency { get; set; }
Property Value
Transparency
 TrueColor
public override sealed EntityColor TrueColor { get; set; }
Property Value
EntityColor
 VisualStyle
public override sealed ObjectId VisualStyle { get; set; }
Property Value
ObjectId
Methods
 AddLight(ObjectId)
public override sealed void AddLight(ObjectId lightId)
Parameters
lightId ObjectId
 GetHighlightProperty(HighlightProperty)
public override sealed object GetHighlightProperty(DrawableTraits.HighlightProperty propertyType)
Parameters
propertyType DrawableTraits.HighlightProperty
Returns
object
 SetHighlightProperty(HighlightProperty, object)
public override sealed void SetHighlightProperty(DrawableTraits.HighlightProperty propertyType, object value)
Parameters
propertyType DrawableTraits.HighlightProperty
value object
 SetLayerFlags(LayerFlags)
protected override sealed void SetLayerFlags(DrawableTraits.LayerFlags flags)
Parameters
flags DrawableTraits.LayerFlags
 SetSelectionMarker(IntPtr)
public override sealed void SetSelectionMarker(IntPtr markerId)
Parameters
markerId IntPtr
 SetupForEntity(Entity)
public override sealed void SetupForEntity(Entity entity)
Parameters
entity Entity