Table of Contents
 Enum LispDataType
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public enum LispDataType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Angle = 5004
DottedPair = 5018
Double = 5001
Int16 = 5003
Int32 = 5010
ListBegin = 5016
ListEnd = 5017
Nil = 5019
None = 5000
ObjectId = 5006
Orientation = 5008
Point2d = 5002
Point3d = 5009
SelectionSet = 5007
T_atom = 5021
Text = 5005
Void = 5014