Table of Contents
 Class DataColumn
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDataColumn")]
public class DataColumn : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
DataColumn
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DataColumn()
public DataColumn()
 DataColumn(CellType, string)
public DataColumn(CellType type, string columnName)
Parameters
type CellType
columnName string
 DataColumn(DataColumn)
public DataColumn(DataColumn column)
Parameters
column DataColumn
 DataColumn(IntPtr, bool)
protected DataColumn(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 ColumnName
public virtual string ColumnName { get; set; }
Property Value
string
 ColumnType
public virtual CellType ColumnType { get; set; }
Property Value
CellType
 GrowLength
public virtual int GrowLength { get; set; }
Property Value
int
 NumCells
public virtual int NumCells { get; }
Property Value
int
 PhysicalLength
public virtual int PhysicalLength { get; set; }
Property Value
int
Methods
 AppendCell(DataCell)
public virtual void AppendCell(DataCell cell)
Parameters
cell DataCell
 Assign(DataColumn)
public void Assign(DataColumn col)
Parameters
col DataColumn
 GetCellAt(int)
public virtual DataCell GetCellAt(int index)
Parameters
index int
Returns
DataCell
 GetIndexAtCell(DataCell)
public virtual int GetIndexAtCell(DataCell cell)
Parameters
cell DataCell
Returns
int
 InsertCellAt(int, DataCell)
public virtual void InsertCellAt(int index, DataCell cell)
Parameters
index int
cell DataCell
 RemoveCellAt(int)
public virtual void RemoveCellAt(int index)
Parameters
index int
 SetCellAt(int, DataCell)
public virtual void SetCellAt(int index, DataCell cell)
Parameters
index int
cell DataCell