Table of Contents
 Class LinetypeCollection
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcArray<AcGiLineType>")]
public sealed class LinetypeCollection : DisposableWrapper, IDisposable, IList, ICollection, IEnumerable
Inheritance
object
MarshalByRefObject
DisposableWrapper
LinetypeCollection
Implements
IDisposable
IList
ICollection
IEnumerable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 LinetypeCollection()
public LinetypeCollection()
 LinetypeCollection(Linetype[])
public LinetypeCollection(Linetype[] values)
Parameters
values Linetype[]
Properties
 Count
public int Count { get; }
Property Value
int
 this[int]
public Linetype this[int index] { get; set; }
Parameters
index int
Property Value
Linetype
Methods
 Add(Linetype)
public int Add(Linetype value)
Parameters
value Linetype
Returns
int
 Clear()
public void Clear()
 Contains(Linetype)
public bool Contains(Linetype value)
Parameters
value Linetype
Returns
bool
 CopyTo(Linetype[], int)
public void CopyTo(Linetype[] array, int index)
Parameters
array Linetype[]
index int
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 GetEnumerator()
public IEnumerator GetEnumerator()
Returns
IEnumerator
 IndexOf(Linetype)
public int IndexOf(Linetype value)
Parameters
value Linetype
Returns
int
 Insert(int, Linetype)
public void Insert(int index, Linetype value)
Parameters
index int
value Linetype
 Remove(Linetype)
public void Remove(Linetype value)
Parameters
value Linetype
 RemoveAt(int)
public void RemoveAt(int index)
Parameters
index int