Table of Contents
 Class SweepOptions
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbSweepOptions")]
public sealed class SweepOptions : DisposableWrapper, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
SweepOptions
Implements
IDisposable
ICloneable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 SweepOptions()
public SweepOptions()
 SweepOptions(SweepOptions)
public SweepOptions(SweepOptions opts)
Parameters
opts SweepOptions
Properties
 Align
public SweepOptionsAlignOption Align { get; }
Property Value
SweepOptionsAlignOption
 AlignAngle
[UnitType(UnitType.Angle)]
public double AlignAngle { get; }
Property Value
double
 AlignStart
public bool AlignStart { get; }
Property Value
bool
 Bank
public bool Bank { get; }
Property Value
bool
 BasePoint
public Point3d BasePoint { get; }
Property Value
Point3d
 CheckIntersections
public bool CheckIntersections { get; }
Property Value
bool
 DraftAngle
[UnitType(UnitType.Angle)]
public double DraftAngle { get; }
Property Value
double
 EndDraftDist
[UnitType(UnitType.Distance)]
public double EndDraftDist { get; }
Property Value
double
 PathEntityTransform
public Matrix3d PathEntityTransform { get; }
Property Value
Matrix3d
 ScaleFactor
[UnitType(UnitType.Unitless)]
public double ScaleFactor { get; }
Property Value
double
 StartDraftDist
[UnitType(UnitType.Distance)]
public double StartDraftDist { get; }
Property Value
double
 SweepEntityTransform
public Matrix3d SweepEntityTransform { get; }
Property Value
Matrix3d
 TwistAngle
[UnitType(UnitType.Angle)]
public double TwistAngle { get; }
Property Value
double
Methods
 CheckPathCurve(Entity, bool)
public void CheckPathCurve(Entity pathEnt, bool displayErrorMessages)
Parameters
pathEnt Entity
displayErrorMessages bool
 CheckSweepCurve(Entity, bool)
public SweepOptionsCheckSweepCurveOut CheckSweepCurve(Entity sweepEnt, bool displayErrorMessages)
Parameters
sweepEnt Entity
displayErrorMessages bool
Returns
SweepOptionsCheckSweepCurveOut
 Clone()
public object Clone()
Returns
object
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()