Table of Contents
 Struct NurbCurve2dData
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public struct NurbCurve2dData
Inherited Members
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Properties
 ControlPoints
public Point2dCollection ControlPoints { get; }
Property Value
Point2dCollection
 Degree
public int Degree { get; }
Property Value
int
 Knots
public KnotCollection Knots { get; }
Property Value
KnotCollection
 Periodic
public bool Periodic { get; }
Property Value
bool
 Rational
public bool Rational { get; }
Property Value
bool
 Weights
public DoubleCollection Weights { get; }
Property Value
DoubleCollection
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 IsEqualTo(NurbCurve2dData)
public bool IsEqualTo(NurbCurve2dData a)
Parameters
a NurbCurve2dData
Returns
bool
Operators
 operator ==(NurbCurve2dData, NurbCurve2dData)
public static bool operator ==(NurbCurve2dData a, NurbCurve2dData b)
Parameters
a NurbCurve2dData
b NurbCurve2dData
Returns
bool
 operator !=(NurbCurve2dData, NurbCurve2dData)
public static bool operator !=(NurbCurve2dData a, NurbCurve2dData b)
Parameters
a NurbCurve2dData
b NurbCurve2dData
Returns
bool