Table of Contents
 Class PlotSettingsValidator
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbPlotSettingsValidator")]
public sealed class PlotSettingsValidator : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
PlotSettingsValidator
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Current
public static PlotSettingsValidator Current { get; }
Property Value
PlotSettingsValidator
Methods
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 GetCanonicalMediaNameList(PlotSettings)
public StringCollection GetCanonicalMediaNameList(PlotSettings plotSet)
Parameters
plotSet PlotSettings
Returns
StringCollection
 GetLocaleMediaName(PlotSettings, int)
public string GetLocaleMediaName(PlotSettings plotSet, int index)
Parameters
plotSet PlotSettings
index int
Returns
string
 GetLocaleMediaName(PlotSettings, string)
public string GetLocaleMediaName(PlotSettings plotSet, string canonicalName)
Parameters
plotSet PlotSettings
canonicalName string
Returns
string
 GetPlotDeviceList()
public StringCollection GetPlotDeviceList()
Returns
StringCollection
 GetPlotStyleSheetList()
public StringCollection GetPlotStyleSheetList()
Returns
StringCollection
 RefreshLists(PlotSettings)
public void RefreshLists(PlotSettings plotSet)
Parameters
plotSet PlotSettings
 SetCanonicalMediaName(PlotSettings, string)
public void SetCanonicalMediaName(PlotSettings plotSet, string mediaName)
Parameters
plotSet PlotSettings
mediaName string
 SetClosestMediaName(PlotSettings, double, double, PlotPaperUnit, bool)
public void SetClosestMediaName(PlotSettings plotSet, double paperWidth, double paperHeight, PlotPaperUnit units, bool matchPrintableArea)
Parameters
plotSet PlotSettings
paperWidth double
paperHeight double
units PlotPaperUnit
matchPrintableArea bool
 SetCurrentStyleSheet(PlotSettings, string)
public void SetCurrentStyleSheet(PlotSettings plotSet, string styleSheetName)
Parameters
plotSet PlotSettings
styleSheetName string
 SetCustomPrintScale(PlotSettings, CustomScale)
public void SetCustomPrintScale(PlotSettings plotSet, CustomScale scale)
Parameters
plotSet PlotSettings
scale CustomScale
 SetDefaultPlotConfig(PlotSettings)
public void SetDefaultPlotConfig(PlotSettings plotSet)
Parameters
plotSet PlotSettings
 SetPlotCentered(PlotSettings, bool)
public void SetPlotCentered(PlotSettings plotSet, bool isCentered)
Parameters
plotSet PlotSettings
isCentered bool
 SetPlotConfigurationName(PlotSettings, string, string)
public void SetPlotConfigurationName(PlotSettings plotSet, string plotDeviceName, string mediaName)
Parameters
plotSet PlotSettings
plotDeviceName string
mediaName string
 SetPlotOrigin(PlotSettings, Point2d)
public void SetPlotOrigin(PlotSettings plotSet, Point2d origin)
Parameters
plotSet PlotSettings
origin Point2d
 SetPlotPaperUnits(PlotSettings, PlotPaperUnit)
public void SetPlotPaperUnits(PlotSettings plotSet, PlotPaperUnit units)
Parameters
plotSet PlotSettings
units PlotPaperUnit
 SetPlotRotation(PlotSettings, PlotRotation)
public void SetPlotRotation(PlotSettings plotSet, PlotRotation rotationType)
Parameters
plotSet PlotSettings
rotationType PlotRotation
 SetPlotType(PlotSettings, PlotType)
public void SetPlotType(PlotSettings plotSet, PlotType plotAreaType)
Parameters
plotSet PlotSettings
plotAreaType PlotType
 SetPlotViewName(PlotSettings, string)
public void SetPlotViewName(PlotSettings plotSet, string viewName)
Parameters
plotSet PlotSettings
viewName string
 SetPlotWindowArea(PlotSettings, Extents2d)
public void SetPlotWindowArea(PlotSettings plotSet, Extents2d windowArea)
Parameters
plotSet PlotSettings
windowArea Extents2d
 SetStdScale(PlotSettings, double)
public void SetStdScale(PlotSettings plotSet, double standardScale)
Parameters
plotSet PlotSettings
standardScale double
 SetStdScaleType(PlotSettings, StdScaleType)
public void SetStdScaleType(PlotSettings plotSet, StdScaleType scaleType)
Parameters
plotSet PlotSettings
scaleType StdScaleType
 SetUseStandardScale(PlotSettings, bool)
public void SetUseStandardScale(PlotSettings plotSet, bool useStandard)
Parameters
plotSet PlotSettings
useStandard bool
 SetZoomToPaperOnUpdate(PlotSettings, bool)
public void SetZoomToPaperOnUpdate(PlotSettings plotSet, bool doZoom)
Parameters
plotSet PlotSettings
doZoom bool