Table of Contents
 Class Vector3dCollection
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeVector3dArray")]
public class Vector3dCollection : IList, ICollection, IEnumerable
Inheritance
object
Vector3dCollection
Implements
IList
ICollection
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Vector3dCollection()
public Vector3dCollection()
 Vector3dCollection(Vector3d[])
public Vector3dCollection(Vector3d[] values)
Parameters
values Vector3d[]
 Vector3dCollection(int)
public Vector3dCollection(int capacity)
Parameters
capacity int
Fields
 DefaultSize
public const int DefaultSize = 10
Field Value
int
Properties
 Capacity
public virtual int Capacity { get; set; }
Property Value
int
 Count
public virtual int Count { get; }
Property Value
int
 IsFixedSize
public virtual bool IsFixedSize { get; }
Property Value
bool
 IsReadOnly
public virtual bool IsReadOnly { get; }
Property Value
bool
 IsSynchronized
public virtual bool IsSynchronized { get; }
Property Value
bool
 this[int]
public virtual Vector3d this[int index] { get; set; }
Parameters
index int
Property Value
Vector3d
 SyncRoot
public virtual object SyncRoot { get; }
Property Value
object
Methods
 Add(Vector3d)
public virtual int Add(Vector3d value)
Parameters
value Vector3d
Returns
int
 AddRange(Vector3d[])
public virtual void AddRange(Vector3d[] range)
Parameters
range Vector3d[]
 Clear()
public virtual void Clear()
 Contains(Vector3d)
public virtual bool Contains(Vector3d value)
Parameters
value Vector3d
Returns
bool
 CopyTo(Vector3d[], int)
public virtual void CopyTo(Vector3d[] array, int index)
Parameters
array Vector3d[]
index int
 GetEnumerator()
public virtual Vector3dCollectionEnumerator GetEnumerator()
Returns
Vector3dCollectionEnumerator
 IndexOf(Vector3d)
public virtual int IndexOf(Vector3d value)
Parameters
value Vector3d
Returns
int
 Insert(int, Vector3d)
public virtual void Insert(int index, Vector3d value)
Parameters
index int
value Vector3d
 Remove(Vector3d)
public virtual void Remove(Vector3d value)
Parameters
value Vector3d
 RemoveAt(int)
public virtual void RemoveAt(int index)
Parameters
index int
 ToArray()
public virtual Vector3d[] ToArray()
Returns
Vector3d[]
 TrimToSize()
public virtual void TrimToSize()