Table of Contents
 Class CurveBoundary
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeCurveBoundary")]
public sealed class CurveBoundary : DisposableWrapper, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
CurveBoundary
Implements
IDisposable
ICloneable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 CurveBoundary()
public CurveBoundary()
 CurveBoundary(int, Curve3d[], Curve2d[], bool, bool)
public CurveBoundary(int numberOfCurves, Curve3d[] curve3d, Curve2d[] curve2d, bool orientation3d, bool orientation2d)
Parameters
numberOfCurves int
curve3d Curve3d[]
curve2d Curve2d[]
orientation3d bool
orientation2d bool
 CurveBoundary(IntPtr, bool)
protected CurveBoundary(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 Contour
public CurveBoundaryData Contour { get; set; }
Property Value
CurveBoundaryData
 DegenerateCurve
public Curve2d DegenerateCurve { get; }
Property Value
Curve2d
 DegeneratePosition
public Position3d DegeneratePosition { get; }
Property Value
Position3d
 IsDegenerate
public bool IsDegenerate { get; }
Property Value
bool
 IsOwnerOfCurves
public bool IsOwnerOfCurves { get; }
Property Value
bool
 NumElements
public int NumElements { get; }
Property Value
int
Methods
 Clone()
public object Clone()
Returns
object
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 Set(int, Entity3d[], Curve2d[], bool, bool)
public void Set(int numElements, Entity3d[] curve3ds, Curve2d[] curve2ds, bool orientation3d, bool orientation2d)
Parameters
numElements int
curve3ds Entity3d[]
curve2ds Curve2d[]
orientation3d bool
orientation2d bool
 SetToOwnCurves()
public void SetToOwnCurves()