Table of Contents
 Enum ClipCondition
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public enum ClipCondition
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AllSegmentsInside = 1
AllSegmentsOutsideEvenWinds = 5
AllSegmentsOutsideOddWinds = 4
AllSegmentsOutsideZeroWinds = 3
Invalid = 0
SegmentsIntersect = 2