Table of Contents
 Enum WebFileType
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiWebLightTraits::WebFileType")]
public enum WebFileType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
TypeA = 3
TypeB = 2
TypeC = 1