Table of Contents
 Interface IPointCloudExtractionProgressCallback
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public interface IPointCloudExtractionProgressCallback
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Methods
 Cancel()
void Cancel()
 Cancelled()
bool Cancelled()
Returns
bool
 End()
void End()
 UpdateCaption(string)
void UpdateCaption(string caption)
Parameters
caption string
 UpdateProgress(int)
void UpdateProgress(int progress)
Parameters
progress int
 UpdateRemainTime(double)
void UpdateRemainTime(double remainTime)
Parameters
remainTime double