Table of Contents
 Enum TextAttachmentType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMLeaderStyle::TextAttachmentType")]
public enum TextAttachmentType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AttachmentAllLine = 8
AttachmentBottomLine = 5
AttachmentBottomOfBottom = 4
AttachmentBottomOfTop = 7
AttachmentBottomOfTopLine = 6
AttachmentCenter = 9
AttachmentLinedCenter = 10
AttachmentMiddle = 2
AttachmentMiddleOfBottom = 3
AttachmentMiddleOfTop = 1
AttachmentTopOfTop = 0