Table of Contents
 Class ResultBuffer
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("resbuf")]
public sealed class ResultBuffer : DisposableWrapper, IDisposable, IEnumerable, IFormattable
Inheritance
object
MarshalByRefObject
DisposableWrapper
ResultBuffer
Implements
IDisposable
IEnumerable
IFormattable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ResultBuffer()
public ResultBuffer()
 ResultBuffer(params TypedValue[])
public ResultBuffer(params TypedValue[] values)
Parameters
values TypedValue[]
Methods
 Add(TypedValue)
public void Add(TypedValue value)
Parameters
value TypedValue
 Add(object)
public void Add(object value)
Parameters
value object
 AsArray()
public TypedValue[] AsArray()
Returns
TypedValue[]
 Create(IntPtr, bool)
public static ResultBuffer Create(IntPtr buffer, bool autoDelete)
Parameters
buffer IntPtr
autoDelete bool
Returns
ResultBuffer
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetEnumerator()
public ResultBufferEnumerator GetEnumerator()
Returns
ResultBufferEnumerator
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
 ToString(string, IFormatProvider)
public string ToString(string format, IFormatProvider provider)
Parameters
format string
provider IFormatProvider
Returns
string
Operators
 operator ==(ResultBuffer, ResultBuffer)
public static bool operator ==(ResultBuffer a, ResultBuffer b)
Parameters
a ResultBuffer
b ResultBuffer
Returns
bool
 operator !=(ResultBuffer, ResultBuffer)
public static bool operator !=(ResultBuffer a, ResultBuffer b)
Parameters
a ResultBuffer
b ResultBuffer
Returns
bool