Table of Contents
 Enum PhysicalIntensityMethod
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbLight::PhysicalIntensityMethod")]
public enum PhysicalIntensityMethod
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Flux = 1
Illuminance = 2
PeakIntensity = 0