Table of Contents
 Class ViewportTableRecord
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbViewportTableRecord")]
public class ViewportTableRecord : AbstractViewTableRecord, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
SymbolTableRecord
AbstractViewTableRecord
ViewportTableRecord
Implements
IDisposable
ICloneable
Inherited Members
 AbstractViewTableRecord.SetSun(DBObject)
 AbstractViewTableRecord.SetUcs(ObjectId)
 AbstractViewTableRecord.SetUcs(OrthographicView)
 AbstractViewTableRecord.SetUcs(Point3d, Vector3d, Vector3d)
 AbstractViewTableRecord.SetUcsToWorld()
 AbstractViewTableRecord.SetViewDirection(OrthographicView)
 AbstractViewTableRecord.VisualStyleId
 AbstractViewTableRecord.Background
 AbstractViewTableRecord.ViewOrthographic
 AbstractViewTableRecord.Elevation
 AbstractViewTableRecord.UcsName
 AbstractViewTableRecord.UcsOrthographic
 AbstractViewTableRecord.Ucs
 AbstractViewTableRecord.SunId
 AbstractViewTableRecord.AmbientLightColor
 AbstractViewTableRecord.Contrast
 AbstractViewTableRecord.Brightness
 AbstractViewTableRecord.DefaultLightingType
 AbstractViewTableRecord.DefaultLightingOn
 AbstractViewTableRecord.FrontClipAtEye
 AbstractViewTableRecord.BackClipEnabled
 AbstractViewTableRecord.FrontClipEnabled
 AbstractViewTableRecord.PerspectiveEnabled
 AbstractViewTableRecord.BackClipDistance
 AbstractViewTableRecord.FrontClipDistance
 AbstractViewTableRecord.LensLength
 AbstractViewTableRecord.ViewTwist
 AbstractViewTableRecord.ViewDirection
 AbstractViewTableRecord.Target
 AbstractViewTableRecord.Width
 AbstractViewTableRecord.Height
 AbstractViewTableRecord.CenterPoint
 SymbolTableRecord.IsResolved
 SymbolTableRecord.IsDependent
 SymbolTableRecord.Name
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ViewportTableRecord()
public ViewportTableRecord()
 ViewportTableRecord(IntPtr, bool)
protected ViewportTableRecord(IntPtr obj, bool autoDelete)
Parameters
obj IntPtr
autoDelete bool
Properties
 CircleSides
public short CircleSides { get; set; }
Property Value
short
 FastZoomsEnabled
public bool FastZoomsEnabled { get; set; }
Property Value
bool
 GridAdaptive
public bool GridAdaptive { get; set; }
Property Value
bool
 GridBoundToLimits
public bool GridBoundToLimits { get; set; }
Property Value
bool
 GridEnabled
public bool GridEnabled { get; set; }
Property Value
bool
 GridFollow
public bool GridFollow { get; set; }
Property Value
bool
 GridIncrements
public Point2d GridIncrements { get; set; }
Property Value
Point2d
 GridMajor
public short GridMajor { get; set; }
Property Value
short
 GridSubdivisionRestricted
public bool GridSubdivisionRestricted { get; set; }
Property Value
bool
 IconAtOrigin
public bool IconAtOrigin { get; set; }
Property Value
bool
 IconEnabled
public bool IconEnabled { get; set; }
Property Value
bool
 IsometricSnapEnabled
public bool IsometricSnapEnabled { get; set; }
Property Value
bool
 LowerLeftCorner
public Point2d LowerLeftCorner { get; set; }
Property Value
Point2d
 Number
public int Number { get; }
Property Value
int
 SnapAngle
[UnitType(UnitType.Angle)]
public double SnapAngle { get; set; }
Property Value
double
 SnapBase
public Point2d SnapBase { get; set; }
Property Value
Point2d
 SnapEnabled
public bool SnapEnabled { get; set; }
Property Value
bool
 SnapIncrements
public Point2d SnapIncrements { get; set; }
Property Value
Point2d
 SnapPair
public short SnapPair { get; set; }
Property Value
short
 ToneOperatorParameters
public ToneOperatorParameters ToneOperatorParameters { get; set; }
Property Value
ToneOperatorParameters
 UcsFollowMode
public bool UcsFollowMode { get; set; }
Property Value
bool
 UcsSavedWithViewport
public bool UcsSavedWithViewport { get; set; }
Property Value
bool
 UpperRightCorner
public Point2d UpperRightCorner { get; set; }
Property Value
Point2d
Methods
 GetPreviousBackground(DrawableType)
public ObjectId GetPreviousBackground(DrawableType type)
Parameters
type DrawableType
Returns
ObjectId
 SetPreviousBackground(ObjectId, DrawableType)
public void SetPreviousBackground(ObjectId value, DrawableType type)
Parameters
value ObjectId
type DrawableType