Table of Contents
 Struct Rectangle3d
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct Rectangle3d
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 Rectangle3d(Point3d, Point3d, Point3d, Point3d)
public Rectangle3d(Point3d upperLeft, Point3d upperRight, Point3d lowerLeft, Point3d lowerRight)
Parameters
upperLeft Point3d
upperRight Point3d
lowerLeft Point3d
lowerRight Point3d
Properties
 LowerLeft
public Point3d LowerLeft { get; }
Property Value
Point3d
 LowerRight
public Point3d LowerRight { get; }
Property Value
Point3d
 UpperLeft
public Point3d UpperLeft { get; }
Property Value
Point3d
 UpperRight
public Point3d UpperRight { get; }
Property Value
Point3d
Methods
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string