Table of Contents
 Class Curve3d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeCurve3d")]
public abstract class Curve3d : Entity3d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
Curve3d
Implements
IDisposable
ICloneable
Derived
CircularArc3d
CompositeCurve3d
EllipticalArc3d
ExternalCurve3d
LinearEntity3d
OffsetCurve3d
SplineEntity3d
Inherited Members
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 BoundBlock
public BoundBlock3d BoundBlock { get; }
Property Value
BoundBlock3d
 EndPoint
public Point3d EndPoint { get; }
Property Value
Point3d
 HasEndPoint
public bool HasEndPoint { get; }
Property Value
bool
 HasStartPoint
public bool HasStartPoint { get; }
Property Value
bool
 OrthoBoundBlock
public BoundBlock3d OrthoBoundBlock { get; }
Property Value
BoundBlock3d
 StartPoint
public Point3d StartPoint { get; }
Property Value
Point3d
Methods
 Create(IntPtr, bool)
public static Curve3d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
Curve3d
 EvaluatePoint(double)
public Point3d EvaluatePoint(double value)
Parameters
value double
Returns
Point3d
 Explode(Interval)
public Curve3d[] Explode(Interval interval)
Parameters
interval Interval
Returns
Curve3d[]
 GetArea(double, double)
public double GetArea(double startingParameter, double endingParameter)
Parameters
startingParameter double
endingParameter double
Returns
double
 GetArea(double, double, Tolerance)
public double GetArea(double startingParameter, double endingParameter, Tolerance tolerance)
Parameters
startingParameter double
endingParameter double
tolerance Tolerance
Returns
double
 GetBoundBlockOf(Interval)
public BoundBlock3d GetBoundBlockOf(Interval range)
Parameters
range Interval
Returns
BoundBlock3d
 GetClosestPointTo(Curve3d)
public PointOnCurve3d[] GetClosestPointTo(Curve3d curve3d)
Parameters
curve3d Curve3d
Returns
PointOnCurve3d[]
 GetClosestPointTo(Curve3d, Tolerance)
public PointOnCurve3d[] GetClosestPointTo(Curve3d curve3d, Tolerance tolerance)
Parameters
curve3d Curve3d
tolerance Tolerance
Returns
PointOnCurve3d[]
 GetClosestPointTo(Point3d)
public PointOnCurve3d GetClosestPointTo(Point3d point)
Parameters
point Point3d
Returns
PointOnCurve3d
 GetClosestPointTo(Point3d, Tolerance)
public PointOnCurve3d GetClosestPointTo(Point3d point, Tolerance tolerance)
Parameters
point Point3d
tolerance Tolerance
Returns
PointOnCurve3d
 GetDistanceTo(Curve3d)
public double GetDistanceTo(Curve3d curve)
Parameters
curve Curve3d
Returns
double
 GetDistanceTo(Curve3d, Tolerance)
public double GetDistanceTo(Curve3d curve, Tolerance tolerance)
Parameters
curve Curve3d
tolerance Tolerance
Returns
double
 GetDistanceTo(Point3d)
public double GetDistanceTo(Point3d point)
Parameters
point Point3d
Returns
double
 GetDistanceTo(Point3d, Tolerance)
public double GetDistanceTo(Point3d point, Tolerance tolerance)
Parameters
point Point3d
tolerance Tolerance
Returns
double
 GetInterval()
public Interval GetInterval()
Returns
Interval
 GetLength(double, double, double)
public double GetLength(double fromParameter, double toParameter, double tolerance)
Parameters
fromParameter double
toParameter double
tolerance double
Returns
double
 GetNewSamplePoints(double, double, double)
public PointOnCurve3d[] GetNewSamplePoints(double fromParameter, double toParameter, double chordHeight)
Parameters
fromParameter double
toParameter double
chordHeight double
Returns
PointOnCurve3d[]
 GetNormalPoint(Point3d)
public PointOnCurve3d GetNormalPoint(Point3d point)
Parameters
point Point3d
Returns
PointOnCurve3d
 GetNormalPoint(Point3d, Tolerance)
public PointOnCurve3d GetNormalPoint(Point3d point, Tolerance tolerance)
Parameters
point Point3d
tolerance Tolerance
Returns
PointOnCurve3d
 GetOrthoBoundBlockOf(Interval)
public BoundBlock3d GetOrthoBoundBlockOf(Interval range)
Parameters
range Interval
Returns
BoundBlock3d
 GetOrthoProjectEntity(Plane)
public Entity3d GetOrthoProjectEntity(Plane projectionPlane)
Parameters
projectionPlane Plane
Returns
Entity3d
 GetOrthoProjectEntity(Plane, Tolerance)
public Entity3d GetOrthoProjectEntity(Plane projectionPlane, Tolerance tolerance)
Parameters
projectionPlane Plane
tolerance Tolerance
Returns
Entity3d
 GetParameterAtLength(double, double, bool, double)
public double GetParameterAtLength(double datumParameter, double length, bool direction, double tolerance)
Parameters
datumParameter double
length double
direction bool
tolerance double
Returns
double
 GetParameterOf(Point3d)
public double GetParameterOf(Point3d point)
Parameters
point Point3d
Returns
double
 GetParameterOf(Point3d, Tolerance)
public double GetParameterOf(Point3d point, Tolerance tolerance)
Parameters
point Point3d
tolerance Tolerance
Returns
double
 GetProjectedClosestPointTo(Curve3d, Vector3d)
public PointOnCurve3d[] GetProjectedClosestPointTo(Curve3d curve3d, Vector3d projectDirection)
Parameters
curve3d Curve3d
projectDirection Vector3d
Returns
PointOnCurve3d[]
 GetProjectedClosestPointTo(Curve3d, Vector3d, Tolerance)
public PointOnCurve3d[] GetProjectedClosestPointTo(Curve3d curve3d, Vector3d projectDirection, Tolerance tolerance)
Parameters
curve3d Curve3d
projectDirection Vector3d
tolerance Tolerance
Returns
PointOnCurve3d[]
 GetProjectedClosestPointTo(Point3d, Vector3d)
public PointOnCurve3d GetProjectedClosestPointTo(Point3d point, Vector3d projectDirection)
Parameters
point Point3d
projectDirection Vector3d
Returns
PointOnCurve3d
 GetProjectedClosestPointTo(Point3d, Vector3d, Tolerance)
public PointOnCurve3d GetProjectedClosestPointTo(Point3d point, Vector3d projectDirection, Tolerance tolerance)
Parameters
point Point3d
projectDirection Vector3d
tolerance Tolerance
Returns
PointOnCurve3d
 GetProjectedEntity(Plane, Vector3d)
public Entity3d GetProjectedEntity(Plane projectionPlane, Vector3d projectDirection)
Parameters
projectionPlane Plane
projectDirection Vector3d
Returns
Entity3d
 GetProjectedEntity(Plane, Vector3d, Tolerance)
public Entity3d GetProjectedEntity(Plane projectionPlane, Vector3d projectDirection, Tolerance tolerance)
Parameters
projectionPlane Plane
projectDirection Vector3d
tolerance Tolerance
Returns
Entity3d
 GetReverseParameterCurve()
public Curve3d GetReverseParameterCurve()
Returns
Curve3d
 GetSamplePoints(double, double, double)
public PointOnCurve3d[] GetSamplePoints(double fromParameter, double toParameter, double chordHeight)
Parameters
fromParameter double
toParameter double
chordHeight double
Returns
PointOnCurve3d[]
 GetSamplePoints(int)
public PointOnCurve3d[] GetSamplePoints(int numSample)
Parameters
numSample int
Returns
PointOnCurve3d[]
 GetSplitCurves(double)
public Curve3d[] GetSplitCurves(double value)
Parameters
value double
Returns
Curve3d[]
 GetTrimmedOffset(double, Vector3d, OffsetCurveExtensionType)
public Curve3d[] GetTrimmedOffset(double distance, Vector3d planeNormal, OffsetCurveExtensionType extensionType)
Parameters
distance double
planeNormal Vector3d
extensionType OffsetCurveExtensionType
Returns
Curve3d[]
 GetTrimmedOffset(double, Vector3d, OffsetCurveExtensionType, Tolerance)
public Curve3d[] GetTrimmedOffset(double distance, Vector3d planeNormal, OffsetCurveExtensionType extensionType, Tolerance tolerance)
Parameters
distance double
planeNormal Vector3d
extensionType OffsetCurveExtensionType
tolerance Tolerance
Returns
Curve3d[]
 IsClosed()
public bool IsClosed()
Returns
bool
 IsClosed(Tolerance)
public bool IsClosed(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 IsCoplanarWith(Curve3d, out Plane)
public bool IsCoplanarWith(Curve3d curve3d, out Plane plane)
Parameters
curve3d Curve3d
plane Plane
Returns
bool
 IsCoplanarWith(Curve3d, out Plane, Tolerance)
public bool IsCoplanarWith(Curve3d curve3d, out Plane plane, Tolerance tolerance)
Parameters
curve3d Curve3d
plane Plane
tolerance Tolerance
Returns
bool
 IsDegenerate(out Entity3d)
public bool IsDegenerate(out Entity3d result)
Parameters
result Entity3d
Returns
bool
 IsDegenerate(out Entity3d, Tolerance)
public bool IsDegenerate(out Entity3d result, Tolerance tolerance)
Parameters
result Entity3d
tolerance Tolerance
Returns
bool
 IsLinear(out Line3d)
public bool IsLinear(out Line3d line)
Parameters
line Line3d
Returns
bool
 IsLinear(out Line3d, Tolerance)
public bool IsLinear(out Line3d line, Tolerance tolerance)
Parameters
line Line3d
tolerance Tolerance
Returns
bool
 IsOn(Point3d)
public bool IsOn(Point3d point)
Parameters
point Point3d
Returns
bool
 IsOn(Point3d, Tolerance)
public bool IsOn(Point3d point, Tolerance tolerance)
Parameters
point Point3d
tolerance Tolerance
Returns
bool
 IsOn(Point3d, out double)
public bool IsOn(Point3d point, out double value)
Parameters
point Point3d
value double
Returns
bool
 IsOn(Point3d, out double, Tolerance)
public bool IsOn(Point3d point, out double value, Tolerance tolerance)
Parameters
point Point3d
value double
tolerance Tolerance
Returns
bool
 IsOn(double)
public bool IsOn(double value)
Parameters
value double
Returns
bool
 IsOn(double, Tolerance)
public bool IsOn(double value, Tolerance tolerance)
Parameters
value double
tolerance Tolerance
Returns
bool
 IsPeriodic(out double)
public bool IsPeriodic(out double period)
Parameters
period double
Returns
bool
 IsPlanar(out Plane)
public bool IsPlanar(out Plane plane)
Parameters
plane Plane
Returns
bool
 IsPlanar(out Plane, Tolerance)
public bool IsPlanar(out Plane plane, Tolerance tolerance)
Parameters
plane Plane
tolerance Tolerance
Returns
bool
 SetInterval(Interval)
public void SetInterval(Interval value)
Parameters
value Interval