Table of Contents
 Class Assoc2dConstraintCallback
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssoc2dConstraintCallback")]
public class Assoc2dConstraintCallback : IDisposable
Inheritance
object
Assoc2dConstraintCallback
Implements
IDisposable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Assoc2dConstraintCallback()
public Assoc2dConstraintCallback()
 Assoc2dConstraintCallback(AcDbAssoc2dConstraintCallback*, bool)
public Assoc2dConstraintCallback(AcDbAssoc2dConstraintCallback* impObj, bool autoDelete)
Parameters
impObj AcDbAssoc2dConstraintCallback*
autoDelete bool
Methods
 CanBeRelaxed(ExplicitConstraint)
public virtual bool CanBeRelaxed(ExplicitConstraint constraint)
Parameters
constraint ExplicitConstraint
Returns
bool
 ConstraintDeactivated(ExplicitConstraint, bool)
public virtual void ConstraintDeactivated(ExplicitConstraint constraint, bool deactivated)
Parameters
constraint ExplicitConstraint
deactivated bool
 Dispose()
public override sealed void Dispose()
 Dispose(bool)
protected virtual void Dispose(bool A_0)
Parameters
A_0 bool