Table of Contents
 Class NurbSurface
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeNurbSurface")]
public sealed class NurbSurface : Surface, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
Surface
NurbSurface
Implements
IDisposable
ICloneable
Inherited Members
 Surface.GetClosestPointTo(Point3d)
 Surface.GetClosestPointTo(Point3d, Tolerance)
 Surface.GetEnvelope()
 Surface.ParameterOf(Point3d)
 Surface.ParameterOf(Point3d, Tolerance)
 Surface.IsOn(Point3d, Point2d)
 Surface.IsOn(Point3d, Point2d, Tolerance)
 Surface.ClosestPointTo(Point3d)
 Surface.ClosestPointTo(Point3d, Tolerance)
 Surface.DistanceTo(Point3d)
 Surface.DistanceTo(Point3d, Tolerance)
 Surface.IsClosedInU()
 Surface.IsClosedInU(Tolerance)
 Surface.IsClosedInV()
 Surface.IsClosedInV(Tolerance)
 Surface.EvaluatePoint(Point2d, int, ref Vector3dCollection, ref Vector3d)
 Surface.EvaluatePoint(Point2d, int, ref Vector3dCollection)
 Surface.EvaluatePoint(Point2d)
 Surface.ReverseNormal
 Surface.IsNormalReversed
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.IsOn(Point3d)
 Entity3d.IsOn(Point3d, Tolerance)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 NurbSurface()
public NurbSurface()
 NurbSurface(int, int, int, int, int, int, Point3dCollection, DoubleCollection, KnotCollection, KnotCollection)
public NurbSurface(int degreeU, int degreeV, int propsInU, int propertiesInV, int numberControlPointsInU, int numberControlPointsInV, Point3dCollection controlPoints, DoubleCollection weights, KnotCollection knotsInU, KnotCollection knotsInV)
Parameters
degreeU int
degreeV int
propsInU int
propertiesInV int
numberControlPointsInU int
numberControlPointsInV int
controlPoints Point3dCollection
weights DoubleCollection
knotsInU KnotCollection
knotsInV KnotCollection
 NurbSurface(int, int, int, int, int, int, Point3dCollection, DoubleCollection, KnotCollection, KnotCollection, Tolerance)
public NurbSurface(int degreeU, int degreeV, int propsInU, int propertiesInV, int numberControlPointsInU, int numberControlPointsInV, Point3dCollection controlPoints, DoubleCollection weights, KnotCollection knotsInU, KnotCollection knotsInV, Tolerance tolerance)
Parameters
degreeU int
degreeV int
propsInU int
propertiesInV int
numberControlPointsInU int
numberControlPointsInV int
controlPoints Point3dCollection
weights DoubleCollection
knotsInU KnotCollection
knotsInV KnotCollection
tolerance Tolerance
Properties
 ControlPoints
public Point3dCollection ControlPoints { get; }
Property Value
Point3dCollection
 DegreeInU
public int DegreeInU { get; }
Property Value
int
 DegreeInV
public int DegreeInV { get; }
Property Value
int
 IsPeriodicInU
public bool IsPeriodicInU { get; }
Property Value
bool
 IsPeriodicInV
public bool IsPeriodicInV { get; }
Property Value
bool
 IsRationalInU
public bool IsRationalInU { get; }
Property Value
bool
 IsRationalInV
public bool IsRationalInV { get; }
Property Value
bool
 NumControlPointsInU
public int NumControlPointsInU { get; }
Property Value
int
 NumControlPointsInV
public int NumControlPointsInV { get; }
Property Value
int
 NumKnotsInU
public int NumKnotsInU { get; }
Property Value
int
 NumKnotsInV
public int NumKnotsInV { get; }
Property Value
int
 PeriodicInU
public double PeriodicInU { get; }
Property Value
double
 PeriodicInV
public double PeriodicInV { get; }
Property Value
double
 SingularityInU
public int SingularityInU { get; }
Property Value
int
 SingularityInV
public int SingularityInV { get; }
Property Value
int
 UKnots
public KnotCollection UKnots { get; }
Property Value
KnotCollection
 VKnots
public KnotCollection VKnots { get; }
Property Value
KnotCollection
 Weights
public DoubleCollection Weights { get; }
Property Value
DoubleCollection
Methods
 Create(IntPtr, bool)
public static NurbSurface Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
NurbSurface
 GetDefinition()
public NurbSurfaceDefinition GetDefinition()
Returns
NurbSurfaceDefinition
 Set(int, int, int, int, int, int, Point3dCollection, DoubleCollection, KnotCollection, KnotCollection)
public void Set(int degreeU, int degreeV, int propsInU, int propsInV, int numControlPointsInU, int numControlPointsInV, Point3dCollection controlPoints, DoubleCollection weights, KnotCollection knotsInU, KnotCollection knotsInV)
Parameters
degreeU int
degreeV int
propsInU int
propsInV int
numControlPointsInU int
numControlPointsInV int
controlPoints Point3dCollection
weights DoubleCollection
knotsInU KnotCollection
knotsInV KnotCollection
 Set(int, int, int, int, int, int, Point3dCollection, DoubleCollection, KnotCollection, KnotCollection, Tolerance)
public void Set(int degreeU, int degreeV, int propsInU, int propsInV, int numControlPointsInU, int numControlPointsInV, Point3dCollection controlPoints, DoubleCollection weights, KnotCollection knotsInU, KnotCollection knotsInV, Tolerance tolerance)
Parameters
degreeU int
degreeV int
propsInU int
propsInV int
numControlPointsInU int
numControlPointsInV int
controlPoints Point3dCollection
weights DoubleCollection
knotsInU KnotCollection
knotsInV KnotCollection
tolerance Tolerance