Table of Contents
 Enum BlockPropertiesTable.AuditErrorType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum BlockPropertiesTable.AuditErrorType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CellEvalError = 8
DuplicateRows = 6
Empty = 0
ExprExternRef = 7
InvalidCell = 2
InvalidUnmatchedValue = 5
NoMatchingRow = 1
NonConstAttDef = 4
NotInValueSet = 3