Table of Contents
 Class ConstrainedBoundedLine
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcConstrainedBoundedLine")]
public class ConstrainedBoundedLine : ConstrainedLine, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
ConstraintGroupNode
ConstrainedGeometry
ConstrainedCurve
ConstrainedLine
ConstrainedBoundedLine
Implements
IDisposable
ICloneable
Inherited Members
 ConstrainedLine.Direction
 ConstrainedLine.PointOnLine
 ConstrainedCurve.ConstrainedImplicitPoints
 ConstrainedCurve.IsBounded
 ConstrainedGeometry.CommonConstraints(ConstrainedGeometry)
 ConstrainedGeometry.FullSubentityPaths
 ConstrainedGeometry.ConnectedGeometries
 ConstrainedGeometry.ConnectedConstraints
 ConstrainedGeometry.OwningRigidSet
 ConstrainedGeometry.GeomDependencyId
 ConstrainedGeometry.IsReadOnly
 ConstraintGroupNode.OwningConstraintGroupId
 ConstraintGroupNode.NodeId
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ConstrainedBoundedLine()
public ConstrainedBoundedLine()
 ConstrainedBoundedLine(ObjectId, bool)
public ConstrainedBoundedLine(ObjectId geomDependencyId, bool ray)
Parameters
geomDependencyId ObjectId
ray bool
 ConstrainedBoundedLine(IntPtr, bool)
protected ConstrainedBoundedLine(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 EndPoint
public Point3d EndPoint { get; }
Property Value
Point3d
 IsRay
public bool IsRay { get; }
Property Value
bool
 MidPoint
public Point3d MidPoint { get; }
Property Value
Point3d
 StartPoint
public Point3d StartPoint { get; }
Property Value
Point3d