Table of Contents
 Class BlockPropertiesTableRow
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class BlockPropertiesTableRow : ICollection, IEnumerable
Inheritance
object
BlockPropertiesTableRow
Implements
ICollection
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Count
public virtual int Count { get; }
Property Value
int
 IsSynchronized
public virtual bool IsSynchronized { get; }
Property Value
bool
 this[BlockPropertiesTableColumn]
public ResultBuffer this[BlockPropertiesTableColumn column] { get; set; }
Parameters
column BlockPropertiesTableColumn
Property Value
ResultBuffer
 this[int]
public ResultBuffer this[int columnIndex] { get; set; }
Parameters
columnIndex int
Property Value
ResultBuffer
 SyncRoot
public virtual object SyncRoot { get; }
Property Value
object
 Table
public BlockPropertiesTable Table { get; }
Property Value
BlockPropertiesTable
Methods
 CopyTo(Array, int)
public virtual void CopyTo(Array __unnamed000, int index)
Parameters
__unnamed000 Array
index int
 GetEnumerator()
public virtual IEnumerator GetEnumerator()
Returns
IEnumerator