Table of Contents
 Enum AttachmentPoint
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMText::AttachmentPoint")]
public enum AttachmentPoint
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BaseAlign = 13
BaseCenter = 11
BaseFit = 17
BaseLeft = 10
BaseMid = 21
BaseRight = 12
BottomAlign = 14
BottomCenter = 8
BottomFit = 18
BottomLeft = 7
BottomMid = 22
BottomRight = 9
MiddleAlign = 15
MiddleCenter = 5
MiddleFit = 19
MiddleLeft = 4
MiddleMid = 23
MiddleRight = 6
TopAlign = 16
TopCenter = 2
TopFit = 20
TopLeft = 1
TopMid = 24
TopRight = 3