Table of Contents
 Class Interval
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeInterval")]
public sealed class Interval : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Interval
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Interval(Interval)
public Interval(Interval other)
Parameters
other Interval
 Interval(double)
public Interval(double tolerance)
Parameters
tolerance double
 Interval(double, double, double)
public Interval(double lower, double upper, double tolerance)
Parameters
lower double
upper double
tolerance double
 Interval(int, double, double)
public Interval(int boundedBelow, double bound, double tolerance)
Parameters
boundedBelow int
bound double
tolerance double
Properties
 Element
public double Element { get; }
Property Value
double
 IsBounded
public bool IsBounded { get; }
Property Value
bool
 IsBoundedAbove
public bool IsBoundedAbove { get; }
Property Value
bool
 IsBoundedBelow
public bool IsBoundedBelow { get; }
Property Value
bool
 IsSingleton
public bool IsSingleton { get; }
Property Value
bool
 IsUnbounded
public bool IsUnbounded { get; }
Property Value
bool
 Length
public double Length { get; }
Property Value
double
 LowerBound
public double LowerBound { get; }
Property Value
double
 Tolerance
public double Tolerance { get; }
Property Value
double
 Unbounded
public static Interval Unbounded { get; }
Property Value
Interval
 UpperBound
public double UpperBound { get; }
Property Value
double
Methods
 Contains(Interval)
public bool Contains(Interval otherInterval)
Parameters
otherInterval Interval
Returns
bool
 Contains(double)
public bool Contains(double value)
Parameters
value double
Returns
bool
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 GetBounds()
public double[] GetBounds()
Returns
double[]
 GetMerge(Interval)
public Interval GetMerge(Interval otherInterval)
Parameters
otherInterval Interval
Returns
Interval
 IntersectWith(Interval)
public Interval IntersectWith(Interval otherInterval)
Parameters
otherInterval Interval
Returns
Interval
 IsContinuousAtUpper(Interval)
public bool IsContinuousAtUpper(Interval otherInterval)
Parameters
otherInterval Interval
Returns
bool
 IsDisjoint(Interval)
public bool IsDisjoint(Interval otherInterval)
Parameters
otherInterval Interval
Returns
bool
 IsEqualAtLower(Interval)
public bool IsEqualAtLower(Interval otherInterval)
Parameters
otherInterval Interval
Returns
bool
 IsEqualAtLower(double)
public bool IsEqualAtLower(double value)
Parameters
value double
Returns
bool
 IsEqualAtUpper(Interval)
public bool IsEqualAtUpper(Interval otherInterval)
Parameters
otherInterval Interval
Returns
bool
 IsEqualAtUpper(double)
public bool IsEqualAtUpper(double value)
Parameters
value double
Returns
bool
 IsOverlapAtUpper(Interval, Interval)
public bool IsOverlapAtUpper(Interval otherInterval, Interval overlap)
Parameters
otherInterval Interval
overlap Interval
Returns
bool
 IsPeriodicallyOn(double, out double)
public bool IsPeriodicallyOn(double period, out double value)
Parameters
period double
value double
Returns
bool
 Subtract(Interval)
public Interval[] Subtract(Interval otherInterval)
Parameters
otherInterval Interval
Returns
Interval[]