Table of Contents
 Class TransformOverrule
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbTransformOverrule")]
public abstract class TransformOverrule : Overrule, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Overrule
TransformOverrule
Implements
IDisposable
ICloneable
Inherited Members
 Overrule.AddOverrule(RXClass, Overrule, bool)
 Overrule.RemoveOverrule(RXClass, Overrule)
 Overrule.HasOverrule(RXObject, RXClass)
 Overrule.IsApplicable(RXObject)
 Overrule.Overruling
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 TransformOverrule()
protected TransformOverrule()
Methods
 CloneMeForDragging(Entity)
public virtual bool CloneMeForDragging(Entity entity)
Parameters
entity Entity
Returns
bool
 Explode(Entity, DBObjectCollection)
public virtual void Explode(Entity entity, DBObjectCollection entitySet)
Parameters
entity Entity
entitySet DBObjectCollection
 GetTransformedCopy(Entity, Matrix3d)
public virtual Entity GetTransformedCopy(Entity entity, Matrix3d transform)
Parameters
entity Entity
transform Matrix3d
Returns
Entity
 HideMeForDragging(Entity)
public virtual bool HideMeForDragging(Entity entity)
Parameters
entity Entity
Returns
bool
 SetCustomFilter()
public override sealed void SetCustomFilter()
 SetExtensionDictionaryEntryFilter(string)
public override sealed void SetExtensionDictionaryEntryFilter(string entryName)
Parameters
entryName string
 SetIdFilter(ObjectId[])
public override sealed void SetIdFilter(ObjectId[] ids)
Parameters
ids ObjectId[]
 SetNoFilter()
public override sealed void SetNoFilter()
 SetXDataFilter(string)
public override sealed void SetXDataFilter(string registeredApplicationName)
Parameters
registeredApplicationName string
 TransformBy(Entity, Matrix3d)
public virtual void TransformBy(Entity entity, Matrix3d transform)
Parameters
entity Entity
transform Matrix3d