Table of Contents
 Class ObjectContextCollectionEnumerator
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbObjectContextCollectionIterator")]
public abstract class ObjectContextCollectionEnumerator : RXObject, IDisposable, ICloneable, IEnumerator
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
ObjectContextCollectionEnumerator
Implements
IDisposable
ICloneable
IEnumerator
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Current
public ObjectContext Current { get; }
Property Value
ObjectContext
Methods
 MoveNext()
public virtual bool MoveNext()
Returns
bool
 Reset()
public virtual void Reset()
Explicit Interface Implementations
 IEnumerator.get_Current()
object IEnumerator.get_Current()
Returns
object