Table of Contents
 Class ProfileCurve2d
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
[Wrapper("ProfileCurve2d")]
public class ProfileCurve2d : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
ProfileCurve2d
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ProfileCurve2d()
public ProfileCurve2d()
 ProfileCurve2d(CircularArc2d)
public ProfileCurve2d(CircularArc2d arc)
Parameters
arc CircularArc2d
 ProfileCurve2d(LineSegment2d)
public ProfileCurve2d(LineSegment2d seg)
Parameters
seg LineSegment2d
 ProfileCurve2d(IntPtr, bool)
protected ProfileCurve2d(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 Arc
public CircularArc2d Arc { get; set; }
Property Value
CircularArc2d
 IsArc
public bool IsArc { get; }
Property Value
bool
 IsSegment
public bool IsSegment { get; }
Property Value
bool
 LineSeg
public LineSegment2d LineSeg { get; set; }
Property Value
LineSegment2d
Methods
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()