Table of Contents
 Class TransactionManager
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbTransactionManager")]
public class TransactionManager : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
TransactionManager
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 TransactionManager(IntPtr, bool)
protected TransactionManager(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 NumberOfActiveTransactions
public virtual int NumberOfActiveTransactions { get; }
Property Value
int
 TopTransaction
public virtual Transaction TopTransaction { get; }
Property Value
Transaction
Methods
 AddNewlyCreatedDBObject(DBObject, bool)
public virtual void AddNewlyCreatedDBObject(DBObject obj, bool add)
Parameters
obj DBObject
add bool
 GetAllObjects()
public virtual DBObjectCollection GetAllObjects()
Returns
DBObjectCollection
 GetObject(ObjectId, OpenMode)
public virtual DBObject GetObject(ObjectId id, OpenMode mode)
Parameters
id ObjectId
mode OpenMode
Returns
DBObject
 GetObject(ObjectId, OpenMode, bool)
public virtual DBObject GetObject(ObjectId id, OpenMode mode, bool openErased)
Parameters
id ObjectId
mode OpenMode
openErased bool
Returns
DBObject
 GetObject(ObjectId, OpenMode, bool, bool)
public virtual DBObject GetObject(ObjectId id, OpenMode mode, bool openErased, bool forceOpenOnLockedLayer)
Parameters
id ObjectId
mode OpenMode
openErased bool
forceOpenOnLockedLayer bool
Returns
DBObject
 QueueForGraphicsFlush()
public virtual void QueueForGraphicsFlush()
 StartOpenCloseTransaction()
public virtual OpenCloseTransaction StartOpenCloseTransaction()
Returns
OpenCloseTransaction
 StartTransaction()
public virtual Transaction StartTransaction()
Returns
Transaction