Table of Contents
 Class AssocArrayRectangularParameters
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocArrayRectangularParameters")]
public class AssocArrayRectangularParameters : AssocArrayCommonParameters, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
AssocArrayParameters
AssocArrayCommonParameters
AssocArrayRectangularParameters
Implements
IDisposable
ICloneable
Inherited Members
 AssocArrayCommonParameters.GetRowCount(out string, out string)
 AssocArrayCommonParameters.SetRowCount(int, string, string)
 AssocArrayCommonParameters.GetRowSpacing(out string, out string)
 AssocArrayCommonParameters.SetRowSpacing(double, string, string)
 AssocArrayCommonParameters.GetRowElevation(out string, out string)
 AssocArrayCommonParameters.SetRowElevation(double, string, string)
 AssocArrayCommonParameters.GetLevelCount(out string, out string)
 AssocArrayCommonParameters.SetLevelCount(int, string, string)
 AssocArrayCommonParameters.GetLevelSpacing(out string, out string)
 AssocArrayCommonParameters.SetLevelSpacing(double, string, string)
 AssocArrayCommonParameters.BasePoint
 AssocArrayCommonParameters.BaseNormal
 AssocArrayCommonParameters.BasePlane
 AssocArrayCommonParameters.LevelSpacing
 AssocArrayCommonParameters.LevelCount
 AssocArrayCommonParameters.RowElevation
 AssocArrayCommonParameters.RowSpacing
 AssocArrayCommonParameters.RowCount
 AssocArrayParameters.Commit()
 AssocArrayParameters.Owner
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocArrayRectangularParameters()
public AssocArrayRectangularParameters()
 AssocArrayRectangularParameters(double, double, double, int, int, int, double, double)
public AssocArrayRectangularParameters(double columnSpacing, double rowSpacing, double levelSpacing, int columnCount, int rowCount, int levelCount, double rowElevation, double axesAngle)
Parameters
columnSpacing double
rowSpacing double
levelSpacing double
columnCount int
rowCount int
levelCount int
rowElevation double
axesAngle double
 AssocArrayRectangularParameters(IntPtr, bool)
protected AssocArrayRectangularParameters(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 AxesAngle
public double AxesAngle { get; set; }
Property Value
double
 ColumnCount
public int ColumnCount { get; set; }
Property Value
int
 ColumnSpacing
public double ColumnSpacing { get; set; }
Property Value
double
 XAxisDirection
public Vector3d XAxisDirection { get; set; }
Property Value
Vector3d
 YAxisDirection
public Vector3d YAxisDirection { get; set; }
Property Value
Vector3d
Methods
 GetAxesAngle(out string, out string)
public double GetAxesAngle(out string expression, out string evaluatorId)
Parameters
expression string
evaluatorId string
Returns
double
 GetColumnCount(out string, out string)
public int GetColumnCount(out string expression, out string evaluatorId)
Parameters
expression string
evaluatorId string
Returns
int
 GetColumnSpacing(out string, out string)
public double GetColumnSpacing(out string expression, out string evaluatorId)
Parameters
expression string
evaluatorId string
Returns
double
 SetAxesAngle(double, string, string)
public void SetAxesAngle(double val, string expression, string evaluatorId)
Parameters
val double
expression string
evaluatorId string
 SetColumnCount(int, string, string)
public void SetColumnCount(int count, string expression, string evaluatorId)
Parameters
count int
expression string
evaluatorId string
 SetColumnSpacing(double, string, string)
public void SetColumnSpacing(double spacing, string expression, string evaluatorId)
Parameters
spacing double
expression string
evaluatorId string