Table of Contents
 Class IndexUpdateData
Namespace
Autodesk.AutoCAD.DatabaseServices.Filters
Assembly
Acdbmgd.dll
[Wrapper("AcDbIndexUpdateData")]
public sealed class IndexUpdateData : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
IndexUpdateData
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Methods
 AddId(ObjectId)
public void AddId(ObjectId id)
Parameters
id ObjectId
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 GetIdData(ObjectId)
[Obsolete("Use System::IntPtr GetIdDataPtr)")]
public long GetIdData(ObjectId id)
Parameters
id ObjectId
Returns
long
 GetIdDataPtr(ObjectId)
public IntPtr GetIdDataPtr(ObjectId id)
Parameters
id ObjectId
Returns
IntPtr
 GetIdFlags(ObjectId)
public byte GetIdFlags(ObjectId id)
Parameters
id ObjectId
Returns
byte
 SetIdData(ObjectId, int)
[Obsolete("Use SetIdData(NAMESPACE_ACDB::ObjectId id, IntPtr data)")]
public void SetIdData(ObjectId id, int data)
Parameters
id ObjectId
data int
 SetIdData(ObjectId, IntPtr)
public void SetIdData(ObjectId id, IntPtr data)
Parameters
id ObjectId
data IntPtr
 SetIdFlags(ObjectId, byte)
public void SetIdFlags(ObjectId id, byte flags)
Parameters
id ObjectId
flags byte