Table of Contents
 Enum GripData.DrawType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum GripData.DrawType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
DragImageGrip = 3
HotGrip = 2
HoverGrip = 1
WarmGrip = 0