Table of Contents
 Class PointOnCurve3d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGePointOnCurve3d")]
public sealed class PointOnCurve3d : PointEntity3d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
PointEntity3d
PointOnCurve3d
Implements
IDisposable
ICloneable
Inherited Members
 PointEntity3d.GetPoint()
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.IsOn(Point3d)
 Entity3d.IsOn(Point3d, Tolerance)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 PointOnCurve3d()
public PointOnCurve3d()
 PointOnCurve3d(Curve3d, double)
public PointOnCurve3d(Curve3d curve, double parameter)
Parameters
curve Curve3d
parameter double
Properties
 Curve
public Curve3d Curve { get; set; }
Property Value
Curve3d
 Parameter
public double Parameter { get; set; }
Property Value
double
 Point
public Point3d Point { get; }
Property Value
Point3d
Methods
 Create(IntPtr, bool)
public static PointOnCurve3d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
PointOnCurve3d
 GetCurvature()
public double GetCurvature()
Returns
double
 GetCurvature(double)
public double GetCurvature(double parameter)
Parameters
parameter double
Returns
double
 GetDerivative(int)
public Vector3d GetDerivative(int order)
Parameters
order int
Returns
Vector3d
 GetDerivative(int, Curve3d, double)
public static Vector3d GetDerivative(int order, Curve3d curve, double parameter)
Parameters
order int
curve Curve3d
parameter double
Returns
Vector3d
 GetDerivative(int, double)
public Vector3d GetDerivative(int order, double parameter)
Parameters
order int
parameter double
Returns
Vector3d
 GetPointAtParameter(double)
public Point3d GetPointAtParameter(double parameter)
Parameters
parameter double
Returns
Point3d
 GetPointOnCurve(Curve3d, double)
public static Point3d GetPointOnCurve(Curve3d curve, double parameter)
Parameters
curve Curve3d
parameter double
Returns
Point3d
 IsSingular()
public bool IsSingular()
Returns
bool
 IsSingular(Tolerance)
public bool IsSingular(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool