Table of Contents
 Class VertexData
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiVertexData")]
public sealed class VertexData
Inheritance
object
VertexData
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 VertexData()
public VertexData()
Properties
 OrientationFlag
public OrientationType OrientationFlag { get; set; }
Property Value
OrientationType
Methods
 GetNormalVectors()
public Vector3d[] GetNormalVectors()
Returns
Vector3d[]
 GetTrueColors()
public EntityColor[] GetTrueColors()
Returns
EntityColor[]
 SetNormalVectors(Vector3d[])
public void SetNormalVectors(Vector3d[] normal)
Parameters
normal Vector3d[]
 SetTrueColors(EntityColor[])
public void SetTrueColors(EntityColor[] colors)
Parameters
colors EntityColor[]
 get_MappingCoords(MapChannel)
public Point3d[] get_MappingCoords(MapChannel mapChannel)
Parameters
mapChannel MapChannel
Returns
Point3d[]
 set_MappingCoords(MapChannel, Point3d[])
public void set_MappingCoords(MapChannel mapChannel, Point3d[] coords)
Parameters
mapChannel MapChannel
coords Point3d[]