Table of Contents
 Enum PointCloudStylizationType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum PointCloudStylizationType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ClassificationRamp = 6
HeightRamp = 4
IntensityRamp = 5
NormalRamp = 3
SingleColor = 2
TrueColor = 1