Table of Contents
 Class MlineStyle
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMlineStyle")]
public class MlineStyle : DBObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
MlineStyle
Implements
IDisposable
ICloneable
Inherited Members
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 MlineStyle()
public MlineStyle()
 MlineStyle(IntPtr, bool)
protected MlineStyle(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 Description
public string Description { get; set; }
Property Value
string
 Elements
public MlineStyleElementCollection Elements { get; }
Property Value
MlineStyleElementCollection
 EndAngle
public double EndAngle { get; set; }
Property Value
double
 EndInnerArcs
public bool EndInnerArcs { get; set; }
Property Value
bool
 EndRoundCap
public bool EndRoundCap { get; set; }
Property Value
bool
 EndSquareCap
public bool EndSquareCap { get; set; }
Property Value
bool
 FillColor
public Color FillColor { get; set; }
Property Value
Color
 Filled
public bool Filled { get; set; }
Property Value
bool
 Name
public string Name { get; set; }
Property Value
string
 ShowMiters
public bool ShowMiters { get; set; }
Property Value
bool
 StartAngle
public double StartAngle { get; set; }
Property Value
double
 StartInnerArcs
public bool StartInnerArcs { get; set; }
Property Value
bool
 StartRoundCap
public bool StartRoundCap { get; set; }
Property Value
bool
 StartSquareCap
public bool StartSquareCap { get; set; }
Property Value
bool
Methods
 Reset()
public void Reset()
 Set(MlineStyle, bool)
public void Set(MlineStyle source, bool checkIfReferenced)
Parameters
source MlineStyle
checkIfReferenced bool