Table of Contents
 Class Curve2d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeCurve2d")]
public abstract class Curve2d : Entity2d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity2d
Curve2d
Implements
IDisposable
ICloneable
Derived
CircularArc2d
CompositeCurve2d
EllipticalArc2d
ExternalCurve2d
LinearEntity2d
OffsetCurve2d
SplineEntity2d
Inherited Members
 Entity2d.Clone()
 Entity2d.IsEqualTo(Entity2d)
 Entity2d.IsEqualTo(Entity2d, Tolerance)
 Entity2d.TransformBy(Matrix2d)
 Entity2d.TranslateBy(Vector2d)
 Entity2d.RotateBy(double, Point2d)
 Entity2d.Mirror(Line2d)
 Entity2d.ScaleBy(double, Point2d)
 Entity2d.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 BoundBlock
public BoundBlock2d BoundBlock { get; }
Property Value
BoundBlock2d
 EndPoint
public Point2d EndPoint { get; }
Property Value
Point2d
 HasEndPoint
public bool HasEndPoint { get; }
Property Value
bool
 HasStartPoint
public bool HasStartPoint { get; }
Property Value
bool
 OrthoBoundBlock
public BoundBlock2d OrthoBoundBlock { get; }
Property Value
BoundBlock2d
 StartPoint
public Point2d StartPoint { get; }
Property Value
Point2d
Methods
 Create(IntPtr, bool)
public static Curve2d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
Curve2d
 EvaluatePoint(double)
public Point2d EvaluatePoint(double parameter)
Parameters
parameter double
Returns
Point2d
 Explode(Interval)
public Curve2d[] Explode(Interval interval)
Parameters
interval Interval
Returns
Curve2d[]
 GetArea(double, double)
public double GetArea(double startParameter, double endParameter)
Parameters
startParameter double
endParameter double
Returns
double
 GetArea(double, double, Tolerance)
public double GetArea(double startParameter, double endParameter, Tolerance tolerance)
Parameters
startParameter double
endParameter double
tolerance Tolerance
Returns
double
 GetBoundBlockOf(Interval)
public BoundBlock2d GetBoundBlockOf(Interval range)
Parameters
range Interval
Returns
BoundBlock2d
 GetClosestPointTo(Curve2d)
public PointOnCurve2d[] GetClosestPointTo(Curve2d curve)
Parameters
curve Curve2d
Returns
PointOnCurve2d[]
 GetClosestPointTo(Curve2d, Tolerance)
public PointOnCurve2d[] GetClosestPointTo(Curve2d curve, Tolerance tolerance)
Parameters
curve Curve2d
tolerance Tolerance
Returns
PointOnCurve2d[]
 GetClosestPointTo(Point2d)
public PointOnCurve2d GetClosestPointTo(Point2d point)
Parameters
point Point2d
Returns
PointOnCurve2d
 GetClosestPointTo(Point2d, Tolerance)
public PointOnCurve2d GetClosestPointTo(Point2d point, Tolerance tolerance)
Parameters
point Point2d
tolerance Tolerance
Returns
PointOnCurve2d
 GetDistanceTo(Curve2d)
public double GetDistanceTo(Curve2d curve)
Parameters
curve Curve2d
Returns
double
 GetDistanceTo(Curve2d, Tolerance)
public double GetDistanceTo(Curve2d curve, Tolerance tolerance)
Parameters
curve Curve2d
tolerance Tolerance
Returns
double
 GetDistanceTo(Point2d)
public double GetDistanceTo(Point2d point)
Parameters
point Point2d
Returns
double
 GetDistanceTo(Point2d, Tolerance)
public double GetDistanceTo(Point2d point, Tolerance tolerance)
Parameters
point Point2d
tolerance Tolerance
Returns
double
 GetInterval()
public Interval GetInterval()
Returns
Interval
 GetLength(double, double)
public double GetLength(double fromParameter, double toParameter)
Parameters
fromParameter double
toParameter double
Returns
double
 GetLength(double, double, Tolerance)
public double GetLength(double fromParameter, double toParameter, Tolerance tolerance)
Parameters
fromParameter double
toParameter double
tolerance Tolerance
Returns
double
 GetNormalPoint(Point2d)
public PointOnCurve2d GetNormalPoint(Point2d point)
Parameters
point Point2d
Returns
PointOnCurve2d
 GetNormalPoint(Point2d, Tolerance)
public PointOnCurve2d GetNormalPoint(Point2d point, Tolerance tolerance)
Parameters
point Point2d
tolerance Tolerance
Returns
PointOnCurve2d
 GetOrthoBoundBlockOf(Interval)
public BoundBlock2d GetOrthoBoundBlockOf(Interval range)
Parameters
range Interval
Returns
BoundBlock2d
 GetParameterAtLength(double, double, bool)
public double GetParameterAtLength(double datumParameter, double length, bool parameterDirection)
Parameters
datumParameter double
length double
parameterDirection bool
Returns
double
 GetParameterAtLength(double, double, bool, Tolerance)
public double GetParameterAtLength(double datumParameter, double length, bool parameterDirection, Tolerance tolerance)
Parameters
datumParameter double
length double
parameterDirection bool
tolerance Tolerance
Returns
double
 GetParameterOf(Point2d)
public double GetParameterOf(Point2d point)
Parameters
point Point2d
Returns
double
 GetParameterOf(Point2d, Tolerance)
public double GetParameterOf(Point2d point, Tolerance tolerance)
Parameters
point Point2d
tolerance Tolerance
Returns
double
 GetReverseParameterCurve()
public Curve2d GetReverseParameterCurve()
Returns
Curve2d
 GetSamplePoints(double, double, double)
public PointOnCurve2d[] GetSamplePoints(double fromParameter, double toParameter, double approxEps)
Parameters
fromParameter double
toParameter double
approxEps double
Returns
PointOnCurve2d[]
 GetSamplePoints(int)
public Point2d[] GetSamplePoints(int numSample)
Parameters
numSample int
Returns
Point2d[]
 GetSplitCurves(double)
public Curve2d[] GetSplitCurves(double value)
Parameters
value double
Returns
Curve2d[]
 GetTrimmedOffset(double, OffsetCurveExtensionType)
public Curve2d[] GetTrimmedOffset(double distance, OffsetCurveExtensionType extensionType)
Parameters
distance double
extensionType OffsetCurveExtensionType
Returns
Curve2d[]
 GetTrimmedOffset(double, OffsetCurveExtensionType, Tolerance)
public Curve2d[] GetTrimmedOffset(double distance, OffsetCurveExtensionType extensionType, Tolerance tolerance)
Parameters
distance double
extensionType OffsetCurveExtensionType
tolerance Tolerance
Returns
Curve2d[]
 IsClosed()
public bool IsClosed()
Returns
bool
 IsClosed(Tolerance)
public bool IsClosed(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 IsDegenerate(out Entity2d)
public bool IsDegenerate(out Entity2d result)
Parameters
result Entity2d
Returns
bool
 IsDegenerate(out Entity2d, Tolerance)
public bool IsDegenerate(out Entity2d result, Tolerance tolerance)
Parameters
result Entity2d
tolerance Tolerance
Returns
bool
 IsLinear(out Line2d)
public bool IsLinear(out Line2d line)
Parameters
line Line2d
Returns
bool
 IsLinear(out Line2d, Tolerance)
public bool IsLinear(out Line2d line, Tolerance tolerance)
Parameters
line Line2d
tolerance Tolerance
Returns
bool
 IsOn(Point2d)
public bool IsOn(Point2d point)
Parameters
point Point2d
Returns
bool
 IsOn(Point2d, Tolerance)
public bool IsOn(Point2d point, Tolerance tolerance)
Parameters
point Point2d
tolerance Tolerance
Returns
bool
 IsOn(Point2d, out double)
public bool IsOn(Point2d point, out double value)
Parameters
point Point2d
value double
Returns
bool
 IsOn(Point2d, out double, Tolerance)
public bool IsOn(Point2d point, out double value, Tolerance tolerance)
Parameters
point Point2d
value double
tolerance Tolerance
Returns
bool
 IsOn(double)
public bool IsOn(double parameter)
Parameters
parameter double
Returns
bool
 IsOn(double, Tolerance)
public bool IsOn(double parameter, Tolerance tolerance)
Parameters
parameter double
tolerance Tolerance
Returns
bool
 IsPeriodic(out double)
public bool IsPeriodic(out double period)
Parameters
period double
Returns
bool
 SetInterval(Interval)
public void SetInterval(Interval value)
Parameters
value Interval