Table of Contents
 Enum AngleConstraint
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMLeaderStyle::SegmentAngleType")]
public enum AngleConstraint
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Degrees015 = 1
Degrees030 = 2
Degrees045 = 3
Degrees060 = 4
Degrees090 = 6
DegreesAny = 0
DegreesHorz = 12