Table of Contents
 Class TextEditorSelectionbase
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbTextEditorSelectionBase")]
public class TextEditorSelectionbase : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
TextEditorSelectionbase
Implements
IDisposable
Derived
TextEditorCursor
TextEditorSelection
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Bold
public bool Bold { get; set; }
Property Value
bool
 Color
public Color Color { get; set; }
Property Value
Color
 FlowAlignment
public TextEditorSelectionbase.FlowAlign FlowAlignment { get; set; }
Property Value
TextEditorSelectionbase.FlowAlign
 Font
public Font Font { get; set; }
Property Value
Font
 Height
public double Height { get; set; }
Property Value
double
 Italic
public bool Italic { get; set; }
Property Value
bool
 Language
public int Language { get; set; }
Property Value
int
 MaxObliqueAngle
public static double MaxObliqueAngle { get; }
Property Value
double
 MaxTrackingFactor
public static double MaxTrackingFactor { get; }
Property Value
double
 MaxWidthScale
public static double MaxWidthScale { get; }
Property Value
double
 MinObliqueAngle
public static double MinObliqueAngle { get; }
Property Value
double
 MinTrackingFactor
public static double MinTrackingFactor { get; }
Property Value
double
 MinWidthScale
public static double MinWidthScale { get; }
Property Value
double
 ObliqueAngle
public double ObliqueAngle { get; set; }
Property Value
double
 Overline
public bool Overline { get; set; }
Property Value
bool
 Strikethrough
public bool Strikethrough { get; set; }
Property Value
bool
 TrackingFactor
public double TrackingFactor { get; set; }
Property Value
double
 Underline
public bool Underline { get; set; }
Property Value
bool
 WidthScale
public double WidthScale { get; set; }
Property Value
double
Methods
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 InputSpecialChar(char)
public void InputSpecialChar(char ch)
Parameters
ch char
 InsertColumnBreak()
public void InsertColumnBreak()
 InsertImportedText(InsertTextType, byte[])
public void InsertImportedText(TextEditorSelectionbase.InsertTextType type, byte[] data)
Parameters
type TextEditorSelectionbase.InsertTextType
data byte[]
 InsertString(string)
public void InsertString(string @string)
Parameters
string string
 InsertSymbol(char, int)
public void InsertSymbol(char ch, int langId)
Parameters
ch char
langId int