Table of Contents
 Class LayerFilter
Namespace
Autodesk.AutoCAD.LayerManager
Assembly
Acdbmgd.dll
[Wrapper("AcLyLayerFilter")]
public class LayerFilter : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
LayerFilter
Implements
IDisposable
ICloneable
Derived
LayerGroup
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 LayerFilter()
public LayerFilter()
 LayerFilter(IntPtr, bool)
protected LayerFilter(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 AllowDelete
public bool AllowDelete { get; }
Property Value
bool
 AllowNested
public bool AllowNested { get; }
Property Value
bool
 AllowRename
public bool AllowRename { get; }
Property Value
bool
 DisplayImages
public LayerFilterDisplayImages DisplayImages { get; }
Property Value
LayerFilterDisplayImages
 DynamicallyGenerated
public bool DynamicallyGenerated { get; }
Property Value
bool
 FilterExpression
public string FilterExpression { get; set; }
Property Value
string
 IsIdFilter
public bool IsIdFilter { get; }
Property Value
bool
 IsProxy
public bool IsProxy { get; }
Property Value
bool
 Name
public string Name { get; set; }
Property Value
string
 NestedFilters
public LayerFilterCollection NestedFilters { get; }
Property Value
LayerFilterCollection
 Parent
public LayerFilter Parent { get; }
Property Value
LayerFilter
Methods
 CompareTo(LayerFilter)
public virtual bool CompareTo(LayerFilter otherFilter)
Parameters
otherFilter LayerFilter
Returns
bool
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 Filter(LayerTableRecord)
public bool Filter(LayerTableRecord layer)
Parameters
layer LayerTableRecord
Returns
bool
 GenerateNested()
public void GenerateNested()
 GetFilterExpressionTree()
public AndExpression[] GetFilterExpressionTree()
Returns
AndExpression[]
 ShowEditor()
public LayerFilter.DialogResult ShowEditor()
Returns
LayerFilter.DialogResult