Table of Contents
 Class ConstrainedImplicitPoint
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcConstrainedImplicitPoint")]
public class ConstrainedImplicitPoint : ConstrainedPoint, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
ConstraintGroupNode
ConstrainedGeometry
ConstrainedPoint
ConstrainedImplicitPoint
Implements
IDisposable
ICloneable
Inherited Members
 ConstrainedGeometry.CommonConstraints(ConstrainedGeometry)
 ConstrainedGeometry.FullSubentityPaths
 ConstrainedGeometry.ConnectedGeometries
 ConstrainedGeometry.ConnectedConstraints
 ConstrainedGeometry.OwningRigidSet
 ConstrainedGeometry.GeomDependencyId
 ConstrainedGeometry.IsReadOnly
 ConstraintGroupNode.OwningConstraintGroupId
 ConstraintGroupNode.NodeId
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ConstrainedImplicitPoint()
public ConstrainedImplicitPoint()
 ConstrainedImplicitPoint(IntPtr, bool)
protected ConstrainedImplicitPoint(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
 ConstrainedImplicitPoint(uint, ImplicitPointType, int)
public ConstrainedImplicitPoint(uint constrCurvId, ImplicitPointType ptype, int index)
Parameters
constrCurvId uint
ptype ImplicitPointType
index int
Properties
 ConstrainedCurveId
public uint ConstrainedCurveId { get; }
Property Value
uint
 Point
public override Point3d Point { get; }
Property Value
Point3d
 PointIndex
public int PointIndex { get; }
Property Value
int
 PointType
public ImplicitPointType PointType { get; }
Property Value
ImplicitPointType