Table of Contents
 Class Cone
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeCone")]
public sealed class Cone : Surface, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
Surface
Cone
Implements
IDisposable
ICloneable
Inherited Members
 Surface.GetClosestPointTo(Point3d)
 Surface.GetClosestPointTo(Point3d, Tolerance)
 Surface.GetEnvelope()
 Surface.ParameterOf(Point3d)
 Surface.ParameterOf(Point3d, Tolerance)
 Surface.IsOn(Point3d, Point2d)
 Surface.IsOn(Point3d, Point2d, Tolerance)
 Surface.ClosestPointTo(Point3d)
 Surface.ClosestPointTo(Point3d, Tolerance)
 Surface.DistanceTo(Point3d)
 Surface.DistanceTo(Point3d, Tolerance)
 Surface.IsClosedInU()
 Surface.IsClosedInU(Tolerance)
 Surface.IsClosedInV()
 Surface.IsClosedInV(Tolerance)
 Surface.EvaluatePoint(Point2d, int, ref Vector3dCollection, ref Vector3d)
 Surface.EvaluatePoint(Point2d, int, ref Vector3dCollection)
 Surface.EvaluatePoint(Point2d)
 Surface.ReverseNormal
 Surface.IsNormalReversed
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.IsOn(Point3d)
 Entity3d.IsOn(Point3d, Tolerance)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Cone()
public Cone()
 Cone(double, double, Point3d, double, Vector3d)
public Cone(double cosineAngle, double sineAngle, Point3d baseOrigin, double baseRadius, Vector3d axisOfSymmetry)
Parameters
cosineAngle double
sineAngle double
baseOrigin Point3d
baseRadius double
axisOfSymmetry Vector3d
 Cone(double, double, Point3d, double, Vector3d, Vector3d, Interval, double, double)
public Cone(double cosineAngle, double sineAngle, Point3d baseOrigin, double baseRadius, Vector3d axisOfSymmetry, Vector3d referenceAxis, Interval height, double startAngle, double endAngle)
Parameters
cosineAngle double
sineAngle double
baseOrigin Point3d
baseRadius double
axisOfSymmetry Vector3d
referenceAxis Vector3d
height Interval
startAngle double
endAngle double
Properties
 Apex
public Point3d Apex { get; }
Property Value
Point3d
 AxisOfSymmetry
public Vector3d AxisOfSymmetry { get; }
Property Value
Vector3d
 BaseCenter
public Point3d BaseCenter { get; }
Property Value
Point3d
 BaseRadius
public double BaseRadius { get; set; }
Property Value
double
 HalfAngle
public double HalfAngle { get; }
Property Value
double
 Height
public Interval Height { get; set; }
Property Value
Interval
 IsOuterNormal
public bool IsOuterNormal { get; }
Property Value
bool
 ReferenceAxis
public Vector3d ReferenceAxis { get; }
Property Value
Vector3d
Methods
 Create(IntPtr, bool)
public static Cone Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
Cone
 GetAngles()
public double[] GetAngles()
Returns
double[]
 GetHalfAngles()
public double[] GetHalfAngles()
Returns
double[]
 GetHeightAt(double)
public double GetHeightAt(double parameter)
Parameters
parameter double
Returns
double
 IntersectWith(LinearEntity3d)
public Point3d[] IntersectWith(LinearEntity3d linearEntity)
Parameters
linearEntity LinearEntity3d
Returns
Point3d[]
 IntersectWith(LinearEntity3d, Tolerance)
public Point3d[] IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance)
Parameters
linearEntity LinearEntity3d
tolerance Tolerance
Returns
Point3d[]
 IsClosed()
public bool IsClosed()
Returns
bool
 IsClosed(Tolerance)
public bool IsClosed(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 Set(double, double, Point3d, double, Vector3d)
public void Set(double cosineAngle, double sineAngle, Point3d baseCenter, double baseRadius, Vector3d axisOfSymmetry)
Parameters
cosineAngle double
sineAngle double
baseCenter Point3d
baseRadius double
axisOfSymmetry Vector3d
 Set(double, double, Point3d, double, Vector3d, Vector3d, Interval, double, double)
public void Set(double cosineAngle, double sineAngle, Point3d baseCenter, double baseRadius, Vector3d axisOfSymmetry, Vector3d refAxis, Interval height, double startAngle, double endAngle)
Parameters
cosineAngle double
sineAngle double
baseCenter Point3d
baseRadius double
axisOfSymmetry Vector3d
refAxis Vector3d
height Interval
startAngle double
endAngle double
 SetAngles(double, double)
public void SetAngles(double startAngle, double endAngle)
Parameters
startAngle double
endAngle double