Table of Contents
 Enum VSFaceLightingModel
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiVisualStyleProperties::FaceLightingModel")]
public enum VSFaceLightingModel
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Constant = 1
Gooch = 3
Invisible = 0
Phong = 2