Table of Contents
 Enum ShadowType
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiShadowParameters::ShadowType")]
public enum ShadowType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Maps = 1
RayTraced = 0
Sampled = 2