Table of Contents
 Class DataAdapterSourceFilesException
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class DataAdapterSourceFilesException : Exception, _Exception, ISerializable
Inheritance
object
Exception
Exception
DataAdapterSourceFilesException
Implements
_Exception
ISerializable
Inherited Members
 Exception.ErrorStatus
 Exception.GetBaseException()
 Exception.ToString()
 Exception.GetType()
 Exception.Message
 Exception.Data
 Exception.InnerException
 Exception.TargetSite
 Exception.StackTrace
 Exception.HelpLink
 Exception.Source
 Exception.HResult
 Exception.SerializeObjectState
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DataAdapterSourceFilesException(ErrorStatus, ArrayList)
public DataAdapterSourceFilesException(ErrorStatus es, ArrayList filelist)
Parameters
es ErrorStatus
filelist ArrayList
 DataAdapterSourceFilesException(ErrorStatus, string, ArrayList)
public DataAdapterSourceFilesException(ErrorStatus es, string message, ArrayList filelist)
Parameters
es ErrorStatus
message string
filelist ArrayList
 DataAdapterSourceFilesException(ErrorStatus, string, Exception, ArrayList)
public DataAdapterSourceFilesException(ErrorStatus es, string message, Exception innerException, ArrayList filelist)
Parameters
es ErrorStatus
message string
innerException Exception
filelist ArrayList
 DataAdapterSourceFilesException(ArrayList)
public DataAdapterSourceFilesException(ArrayList filelist)
Parameters
filelist ArrayList
 DataAdapterSourceFilesException(SerializationInfo, StreamingContext)
protected DataAdapterSourceFilesException(SerializationInfo info, StreamingContext context)
Parameters
info SerializationInfo
context StreamingContext
Properties
 FileNameList
public ArrayList FileNameList { get; set; }
Property Value
ArrayList
Methods
 GetObjectData(SerializationInfo, StreamingContext)
public override void GetObjectData(SerializationInfo info, StreamingContext context)
Parameters
info SerializationInfo
context StreamingContext