Table of Contents
 Class WoodTexture
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiWoodTexture")]
public sealed class WoodTexture : ProceduralTexture, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
MaterialTexture
ProceduralTexture
WoodTexture
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 WoodTexture()
public WoodTexture()
 WoodTexture(IntPtr, bool)
protected WoodTexture(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 AxialNoise
public double AxialNoise { get; set; }
Property Value
double
 Color1
public MaterialColor Color1 { get; set; }
Property Value
MaterialColor
 Color2
public MaterialColor Color2 { get; set; }
Property Value
MaterialColor
 GrainThickness
public double GrainThickness { get; set; }
Property Value
double
 RadialNoise
public double RadialNoise { get; set; }
Property Value
double
Methods
 Clone()
public WoodTexture Clone()
Returns
WoodTexture
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 Set(WoodTexture)
public void Set(WoodTexture value)
Parameters
value WoodTexture
Operators
 operator ==(WoodTexture, WoodTexture)
public static bool operator ==(WoodTexture a, WoodTexture b)
Parameters
a WoodTexture
b WoodTexture
Returns
bool
 operator !=(WoodTexture, WoodTexture)
public static bool operator !=(WoodTexture a, WoodTexture b)
Parameters
a WoodTexture
b WoodTexture
Returns
bool