Table of Contents
 Enum Surface.EdgeExtensionType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbSurface::EdgeExtensionType")]
public enum Surface.EdgeExtensionType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ExtendEdge = 0
StretchEdge = 1