Table of Contents
 Class DimStyleTableRecord
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDimStyleTableRecord")]
public class DimStyleTableRecord : SymbolTableRecord, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
SymbolTableRecord
DimStyleTableRecord
Implements
IDisposable
ICloneable
Inherited Members
 SymbolTableRecord.IsResolved
 SymbolTableRecord.IsDependent
 SymbolTableRecord.Name
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DimStyleTableRecord()
public DimStyleTableRecord()
 DimStyleTableRecord(IntPtr, bool)
protected DimStyleTableRecord(IntPtr obj, bool autoDelete)
Parameters
obj IntPtr
autoDelete bool
Properties
 Dimadec
public virtual int Dimadec { get; set; }
Property Value
int
 Dimalt
public virtual bool Dimalt { get; set; }
Property Value
bool
 Dimaltd
public virtual int Dimaltd { get; set; }
Property Value
int
 Dimaltf
public virtual double Dimaltf { get; set; }
Property Value
double
 Dimaltrnd
public virtual double Dimaltrnd { get; set; }
Property Value
double
 Dimalttd
public virtual int Dimalttd { get; set; }
Property Value
int
 Dimalttz
public virtual int Dimalttz { get; set; }
Property Value
int
 Dimaltu
public virtual int Dimaltu { get; set; }
Property Value
int
 Dimaltz
public virtual int Dimaltz { get; set; }
Property Value
int
 Dimapost
public virtual string Dimapost { get; set; }
Property Value
string
 Dimarcsym
public virtual int Dimarcsym { get; set; }
Property Value
int
 Dimasz
public virtual double Dimasz { get; set; }
Property Value
double
 Dimatfit
public virtual int Dimatfit { get; set; }
Property Value
int
 Dimaunit
public virtual int Dimaunit { get; set; }
Property Value
int
 Dimazin
public virtual int Dimazin { get; set; }
Property Value
int
 Dimblk
public virtual ObjectId Dimblk { get; set; }
Property Value
ObjectId
 Dimblk1
public virtual ObjectId Dimblk1 { get; set; }
Property Value
ObjectId
 Dimblk2
public virtual ObjectId Dimblk2 { get; set; }
Property Value
ObjectId
 Dimcen
public virtual double Dimcen { get; set; }
Property Value
double
 Dimclrd
public virtual Color Dimclrd { get; set; }
Property Value
Color
 Dimclre
public virtual Color Dimclre { get; set; }
Property Value
Color
 Dimclrt
public virtual Color Dimclrt { get; set; }
Property Value
Color
 Dimdec
public virtual int Dimdec { get; set; }
Property Value
int
 Dimdle
public virtual double Dimdle { get; set; }
Property Value
double
 Dimdli
public virtual double Dimdli { get; set; }
Property Value
double
 Dimdsep
public virtual char Dimdsep { get; set; }
Property Value
char
 Dimexe
public virtual double Dimexe { get; set; }
Property Value
double
 Dimexo
public virtual double Dimexo { get; set; }
Property Value
double
 Dimfrac
public virtual int Dimfrac { get; set; }
Property Value
int
 Dimfxlen
public virtual double Dimfxlen { get; set; }
Property Value
double
 DimfxlenOn
public virtual bool DimfxlenOn { get; set; }
Property Value
bool
 Dimgap
public virtual double Dimgap { get; set; }
Property Value
double
 Dimjogang
public virtual double Dimjogang { get; set; }
Property Value
double
 Dimjust
public virtual int Dimjust { get; set; }
Property Value
int
 Dimldrblk
public virtual ObjectId Dimldrblk { get; set; }
Property Value
ObjectId
 Dimlfac
public virtual double Dimlfac { get; set; }
Property Value
double
 Dimlim
public virtual bool Dimlim { get; set; }
Property Value
bool
 Dimltex1
public virtual ObjectId Dimltex1 { get; set; }
Property Value
ObjectId
 Dimltex2
public virtual ObjectId Dimltex2 { get; set; }
Property Value
ObjectId
 Dimltype
public virtual ObjectId Dimltype { get; set; }
Property Value
ObjectId
 Dimlunit
public virtual int Dimlunit { get; set; }
Property Value
int
 Dimlwd
public virtual LineWeight Dimlwd { get; set; }
Property Value
LineWeight
 Dimlwe
public virtual LineWeight Dimlwe { get; set; }
Property Value
LineWeight
 Dimpost
public virtual string Dimpost { get; set; }
Property Value
string
 Dimrnd
public virtual double Dimrnd { get; set; }
Property Value
double
 Dimsah
public virtual bool Dimsah { get; set; }
Property Value
bool
 Dimscale
public virtual double Dimscale { get; set; }
Property Value
double
 Dimsd1
public virtual bool Dimsd1 { get; set; }
Property Value
bool
 Dimsd2
public virtual bool Dimsd2 { get; set; }
Property Value
bool
 Dimse1
public virtual bool Dimse1 { get; set; }
Property Value
bool
 Dimse2
public virtual bool Dimse2 { get; set; }
Property Value
bool
 Dimsoxd
public virtual bool Dimsoxd { get; set; }
Property Value
bool
 Dimtad
public virtual int Dimtad { get; set; }
Property Value
int
 Dimtdec
public virtual int Dimtdec { get; set; }
Property Value
int
 Dimtfac
public virtual double Dimtfac { get; set; }
Property Value
double
 Dimtfill
public virtual int Dimtfill { get; set; }
Property Value
int
 Dimtfillclr
public virtual Color Dimtfillclr { get; set; }
Property Value
Color
 Dimtih
public virtual bool Dimtih { get; set; }
Property Value
bool
 Dimtix
public virtual bool Dimtix { get; set; }
Property Value
bool
 Dimtm
public virtual double Dimtm { get; set; }
Property Value
double
 Dimtmove
public virtual int Dimtmove { get; set; }
Property Value
int
 Dimtofl
public virtual bool Dimtofl { get; set; }
Property Value
bool
 Dimtoh
public virtual bool Dimtoh { get; set; }
Property Value
bool
 Dimtol
public virtual bool Dimtol { get; set; }
Property Value
bool
 Dimtolj
public virtual int Dimtolj { get; set; }
Property Value
int
 Dimtp
public virtual double Dimtp { get; set; }
Property Value
double
 Dimtsz
public virtual double Dimtsz { get; set; }
Property Value
double
 Dimtvp
public virtual double Dimtvp { get; set; }
Property Value
double
 Dimtxsty
public virtual ObjectId Dimtxsty { get; set; }
Property Value
ObjectId
 Dimtxt
public virtual double Dimtxt { get; set; }
Property Value
double
 Dimtxtdirection
public virtual bool Dimtxtdirection { get; set; }
Property Value
bool
 Dimtzin
public virtual int Dimtzin { get; set; }
Property Value
int
 Dimupt
public virtual bool Dimupt { get; set; }
Property Value
bool
 Dimzin
public virtual int Dimzin { get; set; }
Property Value
int
 IsModifiedForRecompute
public bool IsModifiedForRecompute { get; }
Property Value
bool
Methods
 GetArrowId(DimArrowFlag)
public ObjectId GetArrowId(DimArrowFlag whichArrow)
Parameters
whichArrow DimArrowFlag
Returns
ObjectId