Table of Contents
 Enum DuplicateRecordCloning
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::DuplicateRecordCloning")]
public enum DuplicateRecordCloning
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Ignore = 1
MangleName = 4
NotApplicable = 0
RefMangleName = 3
Replace = 2
UnmangleName = 5