Table of Contents
 Class XrefGraph
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbXrefGraph")]
public class XrefGraph : Graph, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Graph
XrefGraph
Implements
IDisposable
Inherited Members
 Graph.Create(IntPtr, bool)
 Graph.Node(int)
 Graph.AddNode(GraphNode)
 Graph.AddEdge(GraphNode, GraphNode)
 Graph.DelNode(GraphNode)
 Graph.Reset()
 Graph.ClearAll(byte)
 Graph.GetOutgoing()
 Graph.FindCycles(GraphNode)
 Graph.BreakCycleEdge(GraphNode, GraphNode)
 Graph.SetNodeGrowthRate(int)
 Graph.DeleteUnmanagedObject()
 Graph.IsEmpty
 Graph.NumNodes
 Graph.RootNode
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 XrefGraph(IntPtr, bool)
protected XrefGraph(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 HostDrawing
public XrefGraphNode HostDrawing { get; }
Property Value
XrefGraphNode
Methods
 GetXrefNode(Database)
public XrefGraphNode GetXrefNode(Database db)
Parameters
db Database
Returns
XrefGraphNode
 GetXrefNode(ObjectId)
public XrefGraphNode GetXrefNode(ObjectId btrId)
Parameters
btrId ObjectId
Returns
XrefGraphNode
 GetXrefNode(int)
public XrefGraphNode GetXrefNode(int idx)
Parameters
idx int
Returns
XrefGraphNode
 GetXrefNode(string)
public XrefGraphNode GetXrefNode(string name)
Parameters
name string
Returns
XrefGraphNode
 MarkUnresolvedTrees()
public bool MarkUnresolvedTrees()
Returns
bool