Table of Contents
 Enum CellEdgeMasks
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcDb::CellEdgeMasks")]
public enum CellEdgeMasks
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BottomMask = 4
LeftMask = 8
RightMask = 2
TopMask = 1