Table of Contents
 Class AssocEvaluationCallback
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocEvaluationCallback")]
public abstract class AssocEvaluationCallback : IDisposable
Inheritance
object
AssocEvaluationCallback
Implements
IDisposable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocEvaluationCallback()
public AssocEvaluationCallback()
 AssocEvaluationCallback(AcDbAssocEvaluationCallback*, bool)
protected AssocEvaluationCallback(AcDbAssocEvaluationCallback* unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr AcDbAssocEvaluationCallback*
autoDelete bool
Methods
 BeginActionEvaluation(AssocAction)
public abstract void BeginActionEvaluation(AssocAction action)
Parameters
action AssocAction
 BeginActionEvaluationUsingObject(AssocAction, ObjectId, bool, bool, DBObject)
public abstract void BeginActionEvaluationUsingObject(AssocAction pAction, ObjectId objectId, bool objectIsGoingToBeUsed, bool objectIsGoingToBeModified, DBObject substituteObject)
Parameters
pAction AssocAction
objectId ObjectId
objectIsGoingToBeUsed bool
objectIsGoingToBeModified bool
substituteObject DBObject
 CancelActionEvaluation()
public abstract bool CancelActionEvaluation()
Returns
bool
 Dispose()
public override sealed void Dispose()
 Dispose(bool)
protected virtual void Dispose(bool A_0)
Parameters
A_0 bool
 DraggingState()
public virtual AssocDraggingState DraggingState()
Returns
AssocDraggingState
 EndActionEvaluation(AssocAction)
public abstract void EndActionEvaluation(AssocAction action)
Parameters
action AssocAction
 EndActionEvaluationUsingObject(AssocAction, ObjectId, DBObject)
public abstract void EndActionEvaluationUsingObject(AssocAction action, ObjectId objectId, DBObject obj)
Parameters
action AssocAction
objectId ObjectId
obj DBObject
 EvaluationMode()
public virtual AssocEvaluationMode EvaluationMode()
Returns
AssocEvaluationMode
 GetTransformationType()
public virtual AssocTransformationType GetTransformationType()
Returns
AssocTransformationType
 SetActionEvaluationErrorStatus(AssocAction, ErrorStatus)
public void SetActionEvaluationErrorStatus(AssocAction action, ErrorStatus errorStatus)
Parameters
action AssocAction
errorStatus ErrorStatus
 SetActionEvaluationErrorStatus(AssocAction, ErrorStatus, ObjectId, DBObject, IntPtr)
public abstract void SetActionEvaluationErrorStatus(AssocAction action, ErrorStatus errorStatus, ObjectId objectId, DBObject obj, IntPtr errorInfo)
Parameters
action AssocAction
errorStatus ErrorStatus
objectId ObjectId
obj DBObject
errorInfo IntPtr