Table of Contents
 Class Vector2dCollection
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeVector2dArray")]
public class Vector2dCollection : IList, ICollection, IEnumerable
Inheritance
object
Vector2dCollection
Implements
IList
ICollection
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Vector2dCollection()
public Vector2dCollection()
 Vector2dCollection(Vector2d[])
public Vector2dCollection(Vector2d[] values)
Parameters
values Vector2d[]
 Vector2dCollection(int)
public Vector2dCollection(int capacity)
Parameters
capacity int
Fields
 DefaultSize
public const int DefaultSize = 10
Field Value
int
Properties
 Capacity
public virtual int Capacity { get; set; }
Property Value
int
 Count
public virtual int Count { get; }
Property Value
int
 IsFixedSize
public virtual bool IsFixedSize { get; }
Property Value
bool
 IsReadOnly
public virtual bool IsReadOnly { get; }
Property Value
bool
 IsSynchronized
public virtual bool IsSynchronized { get; }
Property Value
bool
 this[int]
public virtual Vector2d this[int index] { get; set; }
Parameters
index int
Property Value
Vector2d
 SyncRoot
public virtual object SyncRoot { get; }
Property Value
object
Methods
 Add(Vector2d)
public virtual int Add(Vector2d value)
Parameters
value Vector2d
Returns
int
 AddRange(Vector2d[])
public virtual void AddRange(Vector2d[] range)
Parameters
range Vector2d[]
 Clear()
public virtual void Clear()
 Contains(Vector2d)
public virtual bool Contains(Vector2d value)
Parameters
value Vector2d
Returns
bool
 CopyTo(Vector2d[], int)
public virtual void CopyTo(Vector2d[] array, int index)
Parameters
array Vector2d[]
index int
 GetEnumerator()
public virtual Vector2dCollectionEnumerator GetEnumerator()
Returns
Vector2dCollectionEnumerator
 IndexOf(Vector2d)
public virtual int IndexOf(Vector2d value)
Parameters
value Vector2d
Returns
int
 Insert(int, Vector2d)
public virtual void Insert(int index, Vector2d value)
Parameters
index int
value Vector2d
 Remove(Vector2d)
public virtual void Remove(Vector2d value)
Parameters
value Vector2d
 RemoveAt(int)
public virtual void RemoveAt(int index)
Parameters
index int
 ToArray()
public virtual Vector2d[] ToArray()
Returns
Vector2d[]
 TrimToSize()
public virtual void TrimToSize()