Table of Contents
Namespace Autodesk.AutoCAD.Geometry
 Classes
AugmentedPolylineCurve3d
BoundBlock2d
BoundBlock3d
BoundedPlane
CircularArc2d
CircularArc3d
ClipBoundary2d
CompositeCurve2d
CompositeCurve3d
Cone
CubicSplineCurve2d
CubicSplineCurve3d
Curve2d
Curve2dCollection
Curve3d
Curve3dCollection
CurveBoundary
CurveCurveIntersector2d
CurveCurveIntersector3d
Cylinder
DoubleCollection
DoubleCollectionEnumerator
EllipticalArc2d
EllipticalArc3d
Entity2d
Entity3d
ExternalBoundedSurface
ExternalCurve2d
ExternalCurve3d
ExternalSurface
Int32Collection
Int32CollectionEnumerator
IntPtrCollection
IntPtrCollectionEnumerator
IntegerCollection
IntegerCollectionEnumerator
Interval
KnotCollection
Line2d
Line2dCollection
Line3d
LineSegment2d
LineSegment3d
LinearEntity2d
LinearEntity3d
Matrix2dBuilder
Matrix3dBuilder
NurbCurve2d
NurbCurve3d
NurbSurface
OffsetCurve2d
OffsetCurve3d
OffsetSurface
PlanarEntity
Plane
Point2dCollection
Point2dCollectionEnumerator
Point3dCollection
PointEntity2d
PointEntity3d
PointOnCurve2d
PointOnCurve3d
PointOnSurface
PolylineCurve2d
PolylineCurve3d
Position2d
Position3d
Ray2d
Ray3d
Sphere
SplineEntity2d
SplineEntity3d
Surface
SurfaceSurfaceIntersector
Torus
UInt32Collection
UInt32CollectionEnumerator
Vector2dCollection
Vector2dCollectionEnumerator
Vector3dCollection
Vector3dCollectionEnumerator
 Structs
ClipBoundary2dData
CompositeParameter
CoordinateSystem2d
CoordinateSystem3d
CurveBoundaryData
GeoDataLonLatAltInfo
Matrix2d
Matrix2dInfo
Matrix3d
NurbCurve2dData
NurbCurve2dFitData
NurbCurve3dData
NurbCurve3dFitData
NurbSurfaceDefinition
PlanarEquationCoefficients
Point2d
Point3d
Scale2d
Scale3d
SurfaceSurfaceIntersectorConfigurations
Tolerance
Vector2d
Vector3d
 Enums
ClipCondition
ClipError
ErrorCondition
ExternalEntityKind
KnotParameterizationEnum
OffsetCurveExtensionType
SurfaceSurfaceIntersectorConfiguration
SurfaceSurfaceIntersectorType