Table of Contents
 Class PolylineCurve2d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGePolyline2d")]
public sealed class PolylineCurve2d : SplineEntity2d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity2d
Curve2d
SplineEntity2d
PolylineCurve2d
Implements
IDisposable
ICloneable
Inherited Members
 SplineEntity2d.GetContinuityAtKnot(int)
 SplineEntity2d.GetContinuityAtKnot(int, Tolerance)
 SplineEntity2d.GetKnotAt(int)
 SplineEntity2d.SetKnotAt(int, double)
 SplineEntity2d.GetControlPointAt(int)
 SplineEntity2d.SetControlPointAt(int, Point2d)
 SplineEntity2d.HasFitData
 SplineEntity2d.EndPoint
 SplineEntity2d.StartPoint
 SplineEntity2d.EndParameter
 SplineEntity2d.StartParameter
 SplineEntity2d.NumControlPoints
 SplineEntity2d.Knots
 SplineEntity2d.NumKnots
 SplineEntity2d.Order
 SplineEntity2d.Degree
 SplineEntity2d.IsRational
 Curve2d.GetInterval()
 Curve2d.SetInterval(Interval)
 Curve2d.GetReverseParameterCurve()
 Curve2d.GetDistanceTo(Curve2d)
 Curve2d.GetDistanceTo(Curve2d, Tolerance)
 Curve2d.GetDistanceTo(Point2d)
 Curve2d.GetDistanceTo(Point2d, Tolerance)
 Curve2d.GetClosestPointTo(Curve2d)
 Curve2d.GetClosestPointTo(Curve2d, Tolerance)
 Curve2d.GetClosestPointTo(Point2d)
 Curve2d.GetClosestPointTo(Point2d, Tolerance)
 Curve2d.GetNormalPoint(Point2d)
 Curve2d.GetNormalPoint(Point2d, Tolerance)
 Curve2d.IsOn(double)
 Curve2d.IsOn(double, Tolerance)
 Curve2d.IsOn(Point2d, out double)
 Curve2d.IsOn(Point2d, out double, Tolerance)
 Curve2d.IsOn(Point2d)
 Curve2d.IsOn(Point2d, Tolerance)
 Curve2d.GetParameterOf(Point2d)
 Curve2d.GetParameterOf(Point2d, Tolerance)
 Curve2d.GetTrimmedOffset(double, OffsetCurveExtensionType)
 Curve2d.GetTrimmedOffset(double, OffsetCurveExtensionType, Tolerance)
 Curve2d.IsClosed()
 Curve2d.IsClosed(Tolerance)
 Curve2d.IsPeriodic(out double)
 Curve2d.IsLinear(out Line2d)
 Curve2d.IsLinear(out Line2d, Tolerance)
 Curve2d.GetLength(double, double)
 Curve2d.GetLength(double, double, Tolerance)
 Curve2d.GetParameterAtLength(double, double, bool)
 Curve2d.GetParameterAtLength(double, double, bool, Tolerance)
 Curve2d.GetArea(double, double)
 Curve2d.GetArea(double, double, Tolerance)
 Curve2d.IsDegenerate(out Entity2d)
 Curve2d.IsDegenerate(out Entity2d, Tolerance)
 Curve2d.GetSplitCurves(double)
 Curve2d.Explode(Interval)
 Curve2d.GetBoundBlockOf(Interval)
 Curve2d.GetOrthoBoundBlockOf(Interval)
 Curve2d.EvaluatePoint(double)
 Curve2d.GetSamplePoints(int)
 Curve2d.GetSamplePoints(double, double, double)
 Curve2d.HasEndPoint
 Curve2d.HasStartPoint
 Curve2d.OrthoBoundBlock
 Curve2d.BoundBlock
 Entity2d.Clone()
 Entity2d.IsEqualTo(Entity2d)
 Entity2d.IsEqualTo(Entity2d, Tolerance)
 Entity2d.TransformBy(Matrix2d)
 Entity2d.TranslateBy(Vector2d)
 Entity2d.RotateBy(double, Point2d)
 Entity2d.Mirror(Line2d)
 Entity2d.ScaleBy(double, Point2d)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 PolylineCurve2d()
public PolylineCurve2d()
 PolylineCurve2d(Curve2d, double)
public PolylineCurve2d(Curve2d curve, double epsilon)
Parameters
curve Curve2d
epsilon double
 PolylineCurve2d(KnotCollection, Point2dCollection)
public PolylineCurve2d(KnotCollection knots, Point2dCollection controlPoints)
Parameters
knots KnotCollection
controlPoints Point2dCollection
 PolylineCurve2d(Point2dCollection)
public PolylineCurve2d(Point2dCollection points)
Parameters
points Point2dCollection
Properties
 NumberOfFitPoints
public int NumberOfFitPoints { get; }
Property Value
int
Methods
 Create(IntPtr, bool)
public static PolylineCurve2d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
PolylineCurve2d
 FitPointAt(int)
public Point2d FitPointAt(int i)
Parameters
i int
Returns
Point2d
 SetFitPointAt(int, Point2d)
public void SetFitPointAt(int i, Point2d point)
Parameters
i int
point Point2d