Table of Contents
 Class DictionaryWithDefaultDictionary
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDictionaryWithDefault")]
public class DictionaryWithDefaultDictionary : DBDictionary, IDisposable, ICloneable, IDictionary, ICollection, IEnumerable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
DBDictionary
DictionaryWithDefaultDictionary
Implements
IDisposable
ICloneable
IDictionary
ICollection
IEnumerable
Inherited Members
 DBDictionary.GetAt(string)
 DBDictionary.NameAt(ObjectId)
 DBDictionary.Contains(ObjectId)
 DBDictionary.Contains(string)
 DBDictionary.Remove(ObjectId)
 DBDictionary.Remove(string)
 DBDictionary.SetName(string, string)
 DBDictionary.SetAt(string, DBObject)
 DBDictionary.GetEnumerator()
 DBDictionary.CopyTo(DBDictionaryEntry[], int)
 DBDictionary.IDictionary.GetEnumerator()
 DBDictionary.IEnumerable.GetEnumerator()
 DBDictionary.IDictionary.get_Item(object)
 DBDictionary.IDictionary.set_Item(object, object)
 DBDictionary.IDictionary.Add(object, object)
 DBDictionary.IDictionary.Contains(object)
 DBDictionary.IDictionary.Remove(object)
 DBDictionary.IDictionary.Clear()
 DBDictionary.IDictionary.get_Keys()
 DBDictionary.IDictionary.get_Values()
 DBDictionary.ICollection.CopyTo(Array, int)
 DBDictionary.IDictionary.get_SyncRoot()
 DBDictionary.IDictionary.get_IsSynchronized()
 DBDictionary.IDictionary.get_IsFixedSize()
 DBDictionary.IDictionary.get_IsReadOnly()
 DBDictionary.Copy()
 DBDictionary.IsReadOnly
 DBDictionary.IsFixedSize
 DBDictionary.IsSynchronized
 DBDictionary.SyncRoot
 DBDictionary.Values
 DBDictionary.Keys
 DBDictionary.IncludingErased
 DBDictionary.this[string]
 DBDictionary.Count
 DBDictionary.MergeStyle
 DBDictionary.TreatElementsAsHard
 DBDictionary.SkipDeleted
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DictionaryWithDefaultDictionary()
public DictionaryWithDefaultDictionary()
 DictionaryWithDefaultDictionary(IntPtr, bool)
protected DictionaryWithDefaultDictionary(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 DefaultId
public ObjectId DefaultId { get; set; }
Property Value
ObjectId
 ObjectBirthVersion
public override FullDwgVersion ObjectBirthVersion { get; }
Property Value
FullDwgVersion