Table of Contents
 Class LoftOptionsBuilder
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class LoftOptionsBuilder
Inheritance
object
LoftOptionsBuilder
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 LoftOptionsBuilder()
public LoftOptionsBuilder()
 LoftOptionsBuilder(LoftOptions)
public LoftOptionsBuilder(LoftOptions value)
Parameters
value LoftOptions
Properties
 AlignDirection
public bool AlignDirection { get; set; }
Property Value
bool
 ArcLengthParam
public bool ArcLengthParam { get; set; }
Property Value
bool
 Closed
public bool Closed { get; set; }
Property Value
bool
 DraftEnd
[UnitType(UnitType.Angle)]
public double DraftEnd { get; set; }
Property Value
double
 DraftEndMag
[UnitType(UnitType.Unitless)]
public double DraftEndMag { get; set; }
Property Value
double
 DraftStart
[UnitType(UnitType.Angle)]
public double DraftStart { get; set; }
Property Value
double
 DraftStartMag
[UnitType(UnitType.Unitless)]
public double DraftStartMag { get; set; }
Property Value
double
 NoTwist
public bool NoTwist { get; set; }
Property Value
bool
 NormalOption
public LoftOptionsNormalOption NormalOption { get; set; }
Property Value
LoftOptionsNormalOption
 Ruled
public bool Ruled { get; set; }
Property Value
bool
 Simplify
public bool Simplify { get; set; }
Property Value
bool
 VirtualGuide
public bool VirtualGuide { get; set; }
Property Value
bool
Methods
 SetOptionsFromSysvars()
public void SetOptionsFromSysvars()
 ToLoftOptions()
public LoftOptions ToLoftOptions()
Returns
LoftOptions