Table of Contents
 Enum DistanceConstraint.DistanceDirectionType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum DistanceConstraint.DistanceDirectionType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
FixedDirection = 1
NotDirected = 0
ParallelToLine = 3
PerpendicularToLine = 2