Table of Contents
 Class Transaction
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcTransaction")]
public class Transaction : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Transaction
Implements
IDisposable
ICloneable
Derived
OpenCloseTransaction
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Transaction(IntPtr, bool)
protected Transaction(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 TransactionManager
public virtual TransactionManager TransactionManager { get; }
Property Value
TransactionManager
Methods
 Abort()
public virtual void Abort()
 AddNewlyCreatedDBObject(DBObject, bool)
public virtual void AddNewlyCreatedDBObject(DBObject obj, bool add)
Parameters
obj DBObject
add bool
 Commit()
public virtual void Commit()
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 GetAllObjects()
public DBObjectCollection GetAllObjects()
Returns
DBObjectCollection
 GetObject(ObjectId, OpenMode)
public virtual DBObject GetObject(ObjectId id, OpenMode mode)
Parameters
id ObjectId
mode OpenMode
Returns
DBObject
 GetObject(ObjectId, OpenMode, bool)
public virtual DBObject GetObject(ObjectId id, OpenMode mode, bool openErased)
Parameters
id ObjectId
mode OpenMode
openErased bool
Returns
DBObject
 GetObject(ObjectId, OpenMode, bool, bool)
public virtual DBObject GetObject(ObjectId id, OpenMode mode, bool openErased, bool forceOpenOnLockedLayer)
Parameters
id ObjectId
mode OpenMode
openErased bool
forceOpenOnLockedLayer bool
Returns
DBObject