Table of Contents
 Class SkyBackgroundTraits
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiSkyBackgroundTraits")]
public abstract class SkyBackgroundTraits : NonEntityTraits, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
SubEntityTraits
DrawableTraits
NonEntityTraits
SkyBackgroundTraits
Implements
IDisposable
ICloneable
Inherited Members
 NonEntityTraits.SetupForEntity(Entity)
 NonEntityTraits.SetSelectionMarker(IntPtr)
 NonEntityTraits.AddLight(ObjectId)
 NonEntityTraits.SetLayerFlags(DrawableTraits.LayerFlags)
 NonEntityTraits.SetHighlightProperty(DrawableTraits.HighlightProperty, object)
 NonEntityTraits.GetHighlightProperty(DrawableTraits.HighlightProperty)
 NonEntityTraits.SelectionFlags
 NonEntityTraits.LinePattern
 NonEntityTraits.Fill
 NonEntityTraits.SelectionOnlyGeometry
 NonEntityTraits.ShadowFlags
 NonEntityTraits.DrawFlags
 NonEntityTraits.VisualStyle
 NonEntityTraits.Sectionable
 NonEntityTraits.Mapper
 NonEntityTraits.Material
 NonEntityTraits.PlotStyleDescriptor
 NonEntityTraits.Thickness
 NonEntityTraits.LineTypeScale
 NonEntityTraits.LineWeight
 NonEntityTraits.FillType
 NonEntityTraits.LineType
 NonEntityTraits.Layer
 NonEntityTraits.Transparency
 NonEntityTraits.TrueColor
 NonEntityTraits.Color
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 SkyBackgroundTraits()
protected SkyBackgroundTraits()
 SkyBackgroundTraits(IntPtr, bool)
protected SkyBackgroundTraits(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 SkyParameters
public abstract SkyParameters SkyParameters { get; set; }
Property Value
SkyParameters