Table of Contents
 Class KnotCollection
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeKnotVector")]
public sealed class KnotCollection : DisposableWrapper, IDisposable, IList, ICollection, IEnumerable
Inheritance
object
MarshalByRefObject
DisposableWrapper
KnotCollection
Implements
IDisposable
IList
ICollection
IEnumerable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 KnotCollection()
public KnotCollection()
Properties
 Count
public int Count { get; }
Property Value
int
 EndParameter
public double EndParameter { get; }
Property Value
double
 this[int]
public double this[int index] { get; set; }
Parameters
index int
Property Value
double
 NumberOfIntervals
public int NumberOfIntervals { get; }
Property Value
int
 StartParameter
public double StartParameter { get; }
Property Value
double
 Tolerance
public double Tolerance { get; set; }
Property Value
double
Methods
 Add(double)
public int Add(double value)
Parameters
value double
Returns
int
 Clear()
public void Clear()
 Contains(double)
public bool Contains(double value)
Parameters
value double
Returns
bool
 CopyTo(double[], int)
public void CopyTo(double[] array, int index)
Parameters
array double[]
index int
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 GetDistinctKnots()
public DoubleCollection GetDistinctKnots()
Returns
DoubleCollection
 GetEnumerator()
public IEnumerator GetEnumerator()
Returns
IEnumerator
 GetInterval(int, double, out Interval)
public int GetInterval(int order, double parameter, out Interval interval)
Parameters
order int
parameter double
interval Interval
Returns
int
 GetMultiplicityAt(int)
public int GetMultiplicityAt(int i)
Parameters
i int
Returns
int
 Insert(int, double)
public void Insert(int index, double value)
Parameters
index int
value double
 IsOn(double)
public bool IsOn(double knot)
Parameters
knot double
Returns
bool
 RemoveAt(int)
public void RemoveAt(int index)
Parameters
index int
 Reverse()
public void Reverse()
 SetRange(double, double)
public void SetRange(double lower, double upper)
Parameters
lower double
upper double
 Split(double, int, int)
public KnotCollection[] Split(double parameter, int multiplicityLast, int multiplicityFirst)
Parameters
parameter double
multiplicityLast int
multiplicityFirst int
Returns
KnotCollection[]