Table of Contents
 Class BlendOptionsBuilder
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class BlendOptionsBuilder
Inheritance
object
BlendOptionsBuilder
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 BlendOptionsBuilder()
public BlendOptionsBuilder()
 BlendOptionsBuilder(BlendOptions)
public BlendOptionsBuilder(BlendOptions value)
Parameters
value BlendOptions
Properties
 CoplanarDirection
public Vector3d? CoplanarDirection { get; set; }
Property Value
Vector3d?
 CoplanarPoint
public Point3d? CoplanarPoint { get; set; }
Property Value
Point3d?
 DriveMode
public BlendOptions.DriveModeType DriveMode { get; set; }
Property Value
BlendOptions.DriveModeType
 Quality
public uint Quality { get; set; }
Property Value
uint
 Simplify
public bool Simplify { get; set; }
Property Value
bool
 Solid
public bool Solid { get; set; }
Property Value
bool
Methods
 ToBlendOptions()
public BlendOptions ToBlendOptions()
Returns
BlendOptions