Table of Contents
 Class GripMode
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMultiModesGripPE::GripMode")]
public class GripMode : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
GripMode
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 GripMode()
public GripMode()
Properties
 Action
public GripMode.ActionType Action { get; set; }
Property Value
GripMode.ActionType
 CLIDisplayString
public string CLIDisplayString { get; set; }
Property Value
string
 CLIKeywordList
public string CLIKeywordList { get; set; }
Property Value
string
 CLIPromptString
public string CLIPromptString { get; set; }
Property Value
string
 CommandString
public string CommandString { get; set; }
Property Value
string
 Cursor
public GripMode.CursorType Cursor { get; set; }
Property Value
GripMode.CursorType
 DisplayString
public string DisplayString { get; set; }
Property Value
string
 ModeId
public uint ModeId { get; set; }
Property Value
uint
 ToolTip
public string ToolTip { get; set; }
Property Value
string
Methods
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()