Table of Contents
 Class TransparencyCollection
Namespace
Autodesk.AutoCAD.Colors
Assembly
Acdbmgd.dll
[Wrapper("AcCmTransparencyArray")]
public class TransparencyCollection : IList, ICollection, IEnumerable
Inheritance
object
TransparencyCollection
Implements
IList
ICollection
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 TransparencyCollection()
public TransparencyCollection()
 TransparencyCollection(Transparency[])
public TransparencyCollection(Transparency[] values)
Parameters
values Transparency[]
 TransparencyCollection(int)
public TransparencyCollection(int capacity)
Parameters
capacity int
Fields
 DefaultSize
public const int DefaultSize = 10
Field Value
int
Properties
 Capacity
public virtual int Capacity { get; set; }
Property Value
int
 Count
public virtual int Count { get; }
Property Value
int
 IsFixedSize
public virtual bool IsFixedSize { get; }
Property Value
bool
 IsReadOnly
public virtual bool IsReadOnly { get; }
Property Value
bool
 IsSynchronized
public virtual bool IsSynchronized { get; }
Property Value
bool
 this[int]
public virtual Transparency this[int index] { get; set; }
Parameters
index int
Property Value
Transparency
 SyncRoot
public virtual object SyncRoot { get; }
Property Value
object
Methods
 Add(Transparency)
public virtual int Add(Transparency value)
Parameters
value Transparency
Returns
int
 AddRange(Transparency[])
public virtual void AddRange(Transparency[] range)
Parameters
range Transparency[]
 Clear()
public virtual void Clear()
 Contains(Transparency)
public virtual bool Contains(Transparency value)
Parameters
value Transparency
Returns
bool
 CopyTo(Transparency[], int)
public virtual void CopyTo(Transparency[] array, int index)
Parameters
array Transparency[]
index int
 GetEnumerator()
public virtual TransparencyCollectionEnumerator GetEnumerator()
Returns
TransparencyCollectionEnumerator
 IndexOf(Transparency)
public virtual int IndexOf(Transparency value)
Parameters
value Transparency
Returns
int
 Insert(int, Transparency)
public virtual void Insert(int index, Transparency value)
Parameters
index int
value Transparency
 Remove(Transparency)
public virtual void Remove(Transparency value)
Parameters
value Transparency
 RemoveAt(int)
public virtual void RemoveAt(int index)
Parameters
index int
 ToArray()
public virtual Transparency[] ToArray()
Returns
Transparency[]
 TrimToSize()
public virtual void TrimToSize()