Table of Contents
 Class MLeaderStyle
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMLeaderStyle")]
public class MLeaderStyle : DBObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
MLeaderStyle
Implements
IDisposable
ICloneable
Inherited Members
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 MLeaderStyle()
public MLeaderStyle()
 MLeaderStyle(MLeaderStyle)
public MLeaderStyle(MLeaderStyle mleaderStyle)
Parameters
mleaderStyle MLeaderStyle
 MLeaderStyle(IntPtr, bool)
protected MLeaderStyle(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 ArrowSize
public double ArrowSize { get; set; }
Property Value
double
 ArrowSymbolId
public ObjectId ArrowSymbolId { get; set; }
Property Value
ObjectId
 BlockColor
public Color BlockColor { get; set; }
Property Value
Color
 BlockConnectionType
public BlockConnectionType BlockConnectionType { get; set; }
Property Value
BlockConnectionType
 BlockId
public ObjectId BlockId { get; set; }
Property Value
ObjectId
 BlockRotation
public double BlockRotation { get; set; }
Property Value
double
 BlockScale
public Scale3d BlockScale { get; set; }
Property Value
Scale3d
 BreakSize
public double BreakSize { get; set; }
Property Value
double
 ContentType
public ContentType ContentType { get; set; }
Property Value
ContentType
 DefaultMText
public MText DefaultMText { get; set; }
Property Value
MText
 DoglegLength
public double DoglegLength { get; set; }
Property Value
double
 DrawLeaderOrderType
public DrawLeaderOrderType DrawLeaderOrderType { get; set; }
Property Value
DrawLeaderOrderType
 DrawMLeaderOrderType
public DrawMLeaderOrderType DrawMLeaderOrderType { get; set; }
Property Value
DrawMLeaderOrderType
 EnableBlockRotation
public bool EnableBlockRotation { get; set; }
Property Value
bool
 EnableBlockScale
public bool EnableBlockScale { get; set; }
Property Value
bool
 EnableDogleg
public bool EnableDogleg { get; set; }
Property Value
bool
 EnableFrameText
public bool EnableFrameText { get; set; }
Property Value
bool
 EnableLanding
public bool EnableLanding { get; set; }
Property Value
bool
 ExtendLeaderToText
public bool ExtendLeaderToText { get; set; }
Property Value
bool
 FirstSegmentAngleConstraint
public AngleConstraint FirstSegmentAngleConstraint { get; set; }
Property Value
AngleConstraint
 LandingGap
public double LandingGap { get; set; }
Property Value
double
 LeaderLineColor
public Color LeaderLineColor { get; set; }
Property Value
Color
 LeaderLineType
public LeaderType LeaderLineType { get; set; }
Property Value
LeaderType
 LeaderLineTypeId
public ObjectId LeaderLineTypeId { get; set; }
Property Value
ObjectId
 LeaderLineWeight
public LineWeight LeaderLineWeight { get; set; }
Property Value
LineWeight
 MaxLeaderSegmentsPoints
public int MaxLeaderSegmentsPoints { get; set; }
Property Value
int
 Name
public string Name { get; set; }
Property Value
string
 Scale
public double Scale { get; set; }
Property Value
double
 SecondSegmentAngleConstraint
public AngleConstraint SecondSegmentAngleConstraint { get; set; }
Property Value
AngleConstraint
 TextAlignAlwaysLeft
public bool TextAlignAlwaysLeft { get; set; }
Property Value
bool
 TextAlignmentType
public TextAlignmentType TextAlignmentType { get; set; }
Property Value
TextAlignmentType
 TextAngleType
public TextAngleType TextAngleType { get; set; }
Property Value
TextAngleType
 TextAttachmentDirection
public TextAttachmentDirection TextAttachmentDirection { get; set; }
Property Value
TextAttachmentDirection
 TextAttachmentType
public TextAttachmentType TextAttachmentType { get; set; }
Property Value
TextAttachmentType
 TextColor
public Color TextColor { get; set; }
Property Value
Color
 TextHeight
public double TextHeight { get; set; }
Property Value
double
 TextStyleId
public ObjectId TextStyleId { get; set; }
Property Value
ObjectId
Methods
 GetTextAttachmentType(LeaderDirectionType)
public TextAttachmentType GetTextAttachmentType(LeaderDirectionType leaderDirection)
Parameters
leaderDirection LeaderDirectionType
Returns
TextAttachmentType
 OverwritePropChanged()
public bool OverwritePropChanged()
Returns
bool
 PostMLeaderStyleToDb(Database, string)
public ObjectId PostMLeaderStyleToDb(Database db, string styleName)
Parameters
db Database
styleName string
Returns
ObjectId
 SetTextAttachmentType(TextAttachmentType, LeaderDirectionType)
public void SetTextAttachmentType(TextAttachmentType textAttachmentType, LeaderDirectionType leaderDirection)
Parameters
textAttachmentType TextAttachmentType
leaderDirection LeaderDirectionType