Table of Contents
 Class Drawable
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiDrawable")]
public abstract class Drawable : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
Implements
IDisposable
ICloneable
Derived
DBObject
DrawStream
Glyph
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Drawable(IntPtr, bool)
protected Drawable(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 Bounds
public virtual Extents3d? Bounds { get; }
Property Value
Extents3d?
 DrawStream
public virtual DrawStream DrawStream { get; set; }
Property Value
DrawStream
 DrawableType
public DrawableType DrawableType { get; }
Property Value
DrawableType
 Id
public virtual ObjectId Id { get; }
Property Value
ObjectId
 IsPersistent
public virtual bool IsPersistent { get; }
Property Value
bool
Methods
 SetAttributes(DrawableTraits)
public int SetAttributes(DrawableTraits traits)
Parameters
traits DrawableTraits
Returns
int
 SubSetAttributes(DrawableTraits)
protected abstract int SubSetAttributes(DrawableTraits traits)
Parameters
traits DrawableTraits
Returns
int
 SubViewportDraw(ViewportDraw)
protected abstract void SubViewportDraw(ViewportDraw vd)
Parameters
vd ViewportDraw
 SubViewportDrawLogicalFlags(ViewportDraw)
protected abstract int SubViewportDrawLogicalFlags(ViewportDraw vd)
Parameters
vd ViewportDraw
Returns
int
 SubWorldDraw(WorldDraw)
protected abstract bool SubWorldDraw(WorldDraw wd)
Parameters
wd WorldDraw
Returns
bool
 ViewportDraw(ViewportDraw)
public void ViewportDraw(ViewportDraw vd)
Parameters
vd ViewportDraw
 ViewportDrawLogicalFlags(ViewportDraw)
public int ViewportDrawLogicalFlags(ViewportDraw vd)
Parameters
vd ViewportDraw
Returns
int
 WorldDraw(WorldDraw)
public bool WorldDraw(WorldDraw wd)
Parameters
wd WorldDraw
Returns
bool