Table of Contents
 Enum DataLinkGetSourceContext
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum DataLinkGetSourceContext
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Etransmit = 1
FileWatcher = 3
OrignalPath = 256
Other = 4
Unknown = 0
XrefManager = 2