Table of Contents
 Class ActionsToEvaluateCallback
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbActionsToEvaluateCallback")]
public abstract class ActionsToEvaluateCallback : IDisposable
Inheritance
object
ActionsToEvaluateCallback
Implements
IDisposable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ActionsToEvaluateCallback()
public ActionsToEvaluateCallback()
 ActionsToEvaluateCallback(AcDbActionsToEvaluateCallback*, bool)
protected ActionsToEvaluateCallback(AcDbActionsToEvaluateCallback* unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr AcDbActionsToEvaluateCallback*
autoDelete bool
Methods
 Dispose()
public override sealed void Dispose()
 Dispose(bool)
protected virtual void Dispose(bool A_0)
Parameters
A_0 bool
 NeedsToEvaluate(ObjectId, AssocStatus, bool)
public abstract void NeedsToEvaluate(ObjectId objectId, AssocStatus newStatus, bool ownedActionsAlso)
Parameters
objectId ObjectId
newStatus AssocStatus
ownedActionsAlso bool