Table of Contents
 Class LinkedTableData
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbLinkedTableData")]
public class LinkedTableData : LinkedData, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
LinkedData
LinkedTableData
Implements
IDisposable
ICloneable
Derived
FormattedTableData
Inherited Members
 LinkedData.Clear()
 LinkedData.Name
 LinkedData.IsEmpty
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 LinkedTableData()
public LinkedTableData()
 LinkedTableData(IntPtr, bool)
protected LinkedTableData(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 NumberOfColumns
public virtual int NumberOfColumns { get; }
Property Value
int
 NumberOfRows
public virtual int NumberOfRows { get; }
Property Value
int
Methods
 AppendColumn(int)
public virtual int AppendColumn(int columnsNumber)
Parameters
columnsNumber int
Returns
int
 AppendRow(int)
public virtual int AppendRow(int rowsNumber)
Parameters
rowsNumber int
Returns
int
 Create(IntPtr, bool)
protected static LinkedTableData Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
LinkedTableData
 DataType(int, int)
public virtual DataType DataType(int row, int column)
Parameters
row int
column int
Returns
DataType
 DeleteColumn(int, int)
public virtual void DeleteColumn(int index, int columnsNumberToDelete)
Parameters
index int
columnsNumberToDelete int
 DeleteContent(int, int)
public virtual void DeleteContent(int row, int column)
Parameters
row int
column int
 DeleteRow(int, int)
public virtual void DeleteRow(int index, int rowsNumberToDelete)
Parameters
index int
rowsNumberToDelete int
 GetBlockAttributeValue(int, int, ObjectId)
public virtual string GetBlockAttributeValue(int row, int column, ObjectId attributeDefinitionId)
Parameters
row int
column int
attributeDefinitionId ObjectId
Returns
string
 GetBlockTableRecordId(int, int)
public virtual ObjectId GetBlockTableRecordId(int row, int column)
Parameters
row int
column int
Returns
ObjectId
 GetCellState(int, int)
public virtual CellStates GetCellState(int row, int column)
Parameters
row int
column int
Returns
CellStates
 GetColumnName(int)
public virtual string GetColumnName(int index)
Parameters
index int
Returns
string
 GetContentTypes(int, int)
public virtual CellContentTypes GetContentTypes(int row, int column)
Parameters
row int
column int
Returns
CellContentTypes
 GetCustomData(int, int, string)
public virtual object GetCustomData(int row, int column, string key)
Parameters
row int
column int
key string
Returns
object
 GetDataFormat(int, int)
public virtual string GetDataFormat(int row, int column)
Parameters
row int
column int
Returns
string
 GetDataLink()
public virtual ObjectIdCollection GetDataLink()
Returns
ObjectIdCollection
 GetDataLink(CellRange)
public virtual ObjectIdCollection GetDataLink(CellRange range)
Parameters
range CellRange
Returns
ObjectIdCollection
 GetDataLink(int, int)
public virtual ObjectId GetDataLink(int row, int column)
Parameters
row int
column int
Returns
ObjectId
 GetEnumerator()
public TableEnumerator GetEnumerator()
Returns
TableEnumerator
 GetEnumerator(TableEnumeratorOption)
public TableEnumerator GetEnumerator(TableEnumeratorOption option)
Parameters
option TableEnumeratorOption
Returns
TableEnumerator
 GetFieldId(int, int)
public virtual ObjectId GetFieldId(int row, int column)
Parameters
row int
column int
Returns
ObjectId
 GetToolTip(int, int)
public virtual string GetToolTip(int row, int column)
Parameters
row int
column int
Returns
string
 GetValue(int, int)
public virtual object GetValue(int row, int column)
Parameters
row int
column int
Returns
object
 GetValue(int, int, int, FormatOption)
public virtual object GetValue(int row, int column, int content, FormatOption formatOption)
Parameters
row int
column int
content int
formatOption FormatOption
Returns
object
 InsertColumn(int, int)
public virtual int InsertColumn(int index, int columnsNumber)
Parameters
index int
columnsNumber int
Returns
int
 InsertRow(int, int)
public virtual int InsertRow(int index, int rowsNumber)
Parameters
index int
rowsNumber int
Returns
int
 IsContentEditable(int, int)
public virtual bool IsContentEditable(int row, int column)
Parameters
row int
column int
Returns
bool
 IsLinked(int, int)
public virtual bool IsLinked(int row, int column)
Parameters
row int
column int
Returns
bool
 SetBlockAttributeValue(int, int, ObjectId, string)
public virtual void SetBlockAttributeValue(int row, int column, ObjectId attributeDefinitionId, string value)
Parameters
row int
column int
attributeDefinitionId ObjectId
value string
 SetBlockTableRecordId(int, int, ObjectId)
public virtual void SetBlockTableRecordId(int row, int column, ObjectId value)
Parameters
row int
column int
value ObjectId
 SetCellState(int, int, CellStates)
public virtual void SetCellState(int row, int column, CellStates value)
Parameters
row int
column int
value CellStates
 SetColumnName(int, string)
public virtual void SetColumnName(int index, string name)
Parameters
index int
name string
 SetCustomData(int, int, string, object)
public virtual void SetCustomData(int row, int column, string key, object value)
Parameters
row int
column int
key string
value object
 SetDataFormat(int, int, string)
public virtual void SetDataFormat(int row, int column, string format)
Parameters
row int
column int
format string
 SetDataLink(CellRange, ObjectId, bool)
public virtual void SetDataLink(CellRange range, ObjectId dataLinkId, bool bUpdate)
Parameters
range CellRange
dataLinkId ObjectId
bUpdate bool
 SetDataLink(int, int, ObjectId, bool)
public virtual void SetDataLink(int row, int column, ObjectId dataLinkId, bool bUpdate)
Parameters
row int
column int
dataLinkId ObjectId
bUpdate bool
 SetDataType(int, int, DataType, UnitType)
public virtual void SetDataType(int row, int column, DataType dataType, UnitType unitType)
Parameters
row int
column int
dataType DataType
unitType UnitType
 SetFieldId(int, int, ObjectId)
public virtual void SetFieldId(int row, int column, ObjectId value)
Parameters
row int
column int
value ObjectId
 SetSize(int, int)
public virtual void SetSize(int numRows, int numCols)
Parameters
numRows int
numCols int
 SetToolTip(int, int, string)
public virtual void SetToolTip(int row, int column, string value)
Parameters
row int
column int
value string
 SetValue(int, int, int, object, ParseOption)
public virtual void SetValue(int row, int column, int content, object value, ParseOption parseOption)
Parameters
row int
column int
content int
value object
parseOption ParseOption
 SetValue(int, int, object)
public virtual void SetValue(int row, int column, object value)
Parameters
row int
column int
value object
 UnitType(int, int)
public virtual UnitType UnitType(int row, int column)
Parameters
row int
column int
Returns
UnitType
 UpdateDataLink(UpdateDirection, UpdateOption)
public virtual void UpdateDataLink(UpdateDirection dir, UpdateOption option)
Parameters
dir UpdateDirection
option UpdateOption
 UpdateDataLink(int, int, UpdateDirection, UpdateOption)
public virtual void UpdateDataLink(int row, int column, UpdateDirection dir, UpdateOption option)
Parameters
row int
column int
dir UpdateDirection
option UpdateOption