Table of Contents
 Enum RegenType
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiRegenType")]
public enum RegenType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ForExplode = 5
HideOrShadeCommand = 3
Invalid = 0
[Obsolete("Use ShadedDisplay instead.")] RenderCommand = 4
SaveWorldDrawForProxy = 6
ShadedDisplay = 4
StandardDisplay = 2