Table of Contents
 Enum EraseFlags
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
public enum EraseFlags
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AllEmptyObj = -1
EmptyText = 2
ZeroLengthCurve = 1