Table of Contents
 Class Entity3d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeEntity3d")]
public abstract class Entity3d : DisposableWrapper, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
Implements
IDisposable
ICloneable
Derived
BoundBlock3d
Curve3d
CurveCurveIntersector3d
PointEntity3d
Surface
SurfaceSurfaceIntersector
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Methods
 Clone()
public virtual object Clone()
Returns
object
 Create(IntPtr, bool)
public static Entity3d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
Entity3d
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 IsEqualTo(Entity3d)
public bool IsEqualTo(Entity3d entity)
Parameters
entity Entity3d
Returns
bool
 IsEqualTo(Entity3d, Tolerance)
public bool IsEqualTo(Entity3d entity, Tolerance tolerance)
Parameters
entity Entity3d
tolerance Tolerance
Returns
bool
 IsOn(Point3d)
public bool IsOn(Point3d point)
Parameters
point Point3d
Returns
bool
 IsOn(Point3d, Tolerance)
public bool IsOn(Point3d point, Tolerance tolerance)
Parameters
point Point3d
tolerance Tolerance
Returns
bool
 Mirror(Plane)
public void Mirror(Plane plane)
Parameters
plane Plane
 RotateBy(double, Vector3d, Point3d)
public void RotateBy(double angle, Vector3d vector, Point3d point)
Parameters
angle double
vector Vector3d
point Point3d
 ScaleBy(double, Point3d)
public void ScaleBy(double scaleFactor, Point3d point)
Parameters
scaleFactor double
point Point3d
 TransformBy(Matrix3d)
public void TransformBy(Matrix3d transform)
Parameters
transform Matrix3d
 TranslateBy(Vector3d)
public void TranslateBy(Vector3d translateVector)
Parameters
translateVector Vector3d