Table of Contents
 Enum ContentType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMLeaderStyle::ContentType")]
public enum ContentType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BlockContent = 1
MTextContent = 2
NoneContent = 0
ToleranceContent = 3