Table of Contents
 Enum XrefNotificationStatus
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[TypeConverter(typeof(EnumConverter))]
[Wrapper("AcDb::XrefNotificationStatus")]
public enum XrefNotificationStatus
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
None = 0
ResolvedElsewhere = 2
ResolvedMatch = 1
ResolvedUpdateAvailable = 4
ResolvedWithUpdate = 3