Table of Contents
 Class CellBorder
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public sealed class CellBorder
Inheritance
object
CellBorder
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Color
public Color Color { get; set; }
Property Value
Color
 DoubleLineSpacing
public double? DoubleLineSpacing { get; set; }
Property Value
double?
 IsVisible
public bool? IsVisible { get; set; }
Property Value
bool?
 LineStyle
public GridLineStyle? LineStyle { get; set; }
Property Value
GridLineStyle?
 LineWeight
public LineWeight? LineWeight { get; set; }
Property Value
LineWeight?
 Linetype
public ObjectId? Linetype { get; set; }
Property Value
ObjectId?
 Margin
public double? Margin { get; set; }
Property Value
double?
 Overrides
public GridProperties? Overrides { get; set; }
Property Value
GridProperties?