Table of Contents
 Struct DecomposeForSaveReplacementRecord
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct DecomposeForSaveReplacementRecord
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 DecomposeForSaveReplacementRecord(DBObject, bool)
public DecomposeForSaveReplacementRecord(DBObject replacement, bool exchangeXData)
Parameters
replacement DBObject
exchangeXData bool
 DecomposeForSaveReplacementRecord(ObjectId, bool)
public DecomposeForSaveReplacementRecord(ObjectId replacement, bool exchangeXData)
Parameters
replacement ObjectId
exchangeXData bool
Properties
 ExchangeXData
public bool ExchangeXData { get; }
Property Value
bool
 ReplacementId
public ObjectId ReplacementId { get; }
Property Value
ObjectId
 ReplacementObject
public DBObject ReplacementObject { get; }
Property Value
DBObject