Table of Contents
 Class AttributeCollection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public sealed class AttributeCollection : ICollection, IEnumerable, ISubObject
Inheritance
object
AttributeCollection
Implements
ICollection
IEnumerable
ISubObject
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Count
public virtual int Count { get; }
Property Value
int
 this[int]
public ObjectId this[int index] { get; }
Parameters
index int
Property Value
ObjectId
Methods
 AppendAttribute(AttributeReference)
public ObjectId AppendAttribute(AttributeReference attributeToAddToBlockReference)
Parameters
attributeToAddToBlockReference AttributeReference
Returns
ObjectId
 CopyTo(ObjectId[], int)
public void CopyTo(ObjectId[] array, int index)
Parameters
array ObjectId[]
index int
 GetEnumerator()
public IEnumerator GetEnumerator()
Returns
IEnumerator