Table of Contents
 Class Marshaler
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public sealed class Marshaler
Inheritance
object
Marshaler
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Methods
 AcValueToObject(IntPtr)
public static object AcValueToObject(IntPtr acValueObj)
Parameters
acValueObj IntPtr
Returns
object
 BitmapInfoToBitmap(IntPtr)
public static Bitmap BitmapInfoToBitmap(IntPtr bitmapInfo)
Parameters
bitmapInfo IntPtr
Returns
Bitmap
 BitmapToBitmapInfo(Bitmap)
public static IntPtr BitmapToBitmapInfo(Bitmap bitmap)
Parameters
bitmap Bitmap
Returns
IntPtr
 CopyToManagedFullSubentityPath(IntPtr)
public static FullSubentityPath CopyToManagedFullSubentityPath(IntPtr path)
Parameters
path IntPtr
Returns
FullSubentityPath
 CopyToUnmanagedFullSubentityPath(FullSubentityPath, IntPtr)
public static void CopyToUnmanagedFullSubentityPath(FullSubentityPath path, IntPtr newPath)
Parameters
path FullSubentityPath
newPath IntPtr
 GetInternalArray(DoubleCollection)
public static double[] GetInternalArray(DoubleCollection col)
Parameters
col DoubleCollection
Returns
double[]
 GetInternalArray(IntegerCollection)
public static int[] GetInternalArray(IntegerCollection col)
Parameters
col IntegerCollection
Returns
int[]
 GetInternalArray(Point2dCollection)
public static Point2d[] GetInternalArray(Point2dCollection col)
Parameters
col Point2dCollection
Returns
Point2d[]
 GetInternalArray(Vector2dCollection)
public static Vector2d[] GetInternalArray(Vector2dCollection col)
Parameters
col Vector2dCollection
Returns
Vector2d[]
 GetInternalArray(Vector3dCollection)
public static Vector3d[] GetInternalArray(Vector3dCollection col)
Parameters
col Vector3dCollection
Returns
Vector3d[]
 ObjectToAcValue(object, IntPtr)
public static void ObjectToAcValue(object obj, IntPtr acValueObj)
Parameters
obj object
acValueObj IntPtr
 ObjectToResbuf(object)
public static IntPtr ObjectToResbuf(object o)
Parameters
o object
Returns
IntPtr
 ObjectToResbuf(object, IntPtr)
public static void ObjectToResbuf(object o, IntPtr rb)
Parameters
o object
rb IntPtr
 ObjectsToResbuf(params object[])
public static IntPtr ObjectsToResbuf(params object[] objects)
Parameters
objects object[]
Returns
IntPtr
 ResbufToObject(IntPtr)
public static object ResbufToObject(IntPtr rb)
Parameters
rb IntPtr
Returns
object
 ResbufToTypedValues(IntPtr)
public static TypedValue[] ResbufToTypedValues(IntPtr resbuf)
Parameters
resbuf IntPtr
Returns
TypedValue[]
 SetInternalArray(DoubleCollection, double[], int)
public static void SetInternalArray(DoubleCollection col, double[] newArray, int count)
Parameters
col DoubleCollection
newArray double[]
count int
 SetInternalArray(IntegerCollection, int[], int)
public static void SetInternalArray(IntegerCollection col, int[] newArray, int count)
Parameters
col IntegerCollection
newArray int[]
count int
 SetInternalArray(Point2dCollection, Point2d[], int)
public static void SetInternalArray(Point2dCollection col, Point2d[] newArray, int count)
Parameters
col Point2dCollection
newArray Point2d[]
count int
 SetInternalArray(Vector2dCollection, Vector2d[], int)
public static void SetInternalArray(Vector2dCollection col, Vector2d[] newArray, int count)
Parameters
col Vector2dCollection
newArray Vector2d[]
count int
 SetInternalArray(Vector3dCollection, Vector3d[], int)
public static void SetInternalArray(Vector3dCollection col, Vector3d[] newArray, int count)
Parameters
col Vector3dCollection
newArray Vector3d[]
count int
 TypedValuesToResbuf(params TypedValue[])
public static IntPtr TypedValuesToResbuf(params TypedValue[] values)
Parameters
values TypedValue[]
Returns
IntPtr