Table of Contents
 Class AssocGlobalUtility
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public sealed class AssocGlobalUtility
Inheritance
object
AssocGlobalUtility
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocGlobalUtility()
public AssocGlobalUtility()
Methods
 EvaluationRequestSeverityLevel(AssocStatus)
public static int EvaluationRequestSeverityLevel(AssocStatus status)
Parameters
status AssocStatus
Returns
int
 IsDraggingProvidingSubstituteObjects(AssocEvaluationCallback)
public static bool IsDraggingProvidingSubstituteObjects(AssocEvaluationCallback evaluationCallback)
Parameters
evaluationCallback AssocEvaluationCallback
Returns
bool
 IsEvaluationRequest(AssocStatus)
public static bool IsEvaluationRequest(AssocStatus status)
Parameters
status AssocStatus
Returns
bool
 IsToBeSkipped(AssocStatus)
public static bool IsToBeSkipped(AssocStatus status)
Parameters
status AssocStatus
Returns
bool