Table of Contents
 Delegate ModuleUnloadedEventHandler
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public delegate void ModuleUnloadedEventHandler(object sender, DynamicLinkerEventArgs e)
Parameters
sender object
e DynamicLinkerEventArgs
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ModuleUnloadedEventHandler(object, IntPtr)
public ModuleUnloadedEventHandler(object A_0, IntPtr A_1)
Parameters
A_0 object
A_1 IntPtr
Methods
 BeginInvoke(object, DynamicLinkerEventArgs, AsyncCallback, object)
public IAsyncResult BeginInvoke(object sender, DynamicLinkerEventArgs e, AsyncCallback callback, object obj)
Parameters
sender object
e DynamicLinkerEventArgs
callback AsyncCallback
obj object
Returns
IAsyncResult
 EndInvoke(IAsyncResult)
public void EndInvoke(IAsyncResult result)
Parameters
result IAsyncResult
 Invoke(object, DynamicLinkerEventArgs)
public void Invoke(object sender, DynamicLinkerEventArgs e)
Parameters
sender object
e DynamicLinkerEventArgs