Table of Contents
 Class ConstrainedGeometry
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcConstrainedGeometry")]
public class ConstrainedGeometry : ConstraintGroupNode, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
ConstraintGroupNode
ConstrainedGeometry
Implements
IDisposable
ICloneable
Derived
ConstrainedCurve
ConstrainedPoint
ConstrainedRigidSet
Inherited Members
 ConstraintGroupNode.OwningConstraintGroupId
 ConstraintGroupNode.NodeId
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ConstrainedGeometry(IntPtr, bool)
protected ConstrainedGeometry(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 ConnectedConstraints
public GeometricalConstraint[] ConnectedConstraints { get; }
Property Value
GeometricalConstraint[]
 ConnectedGeometries
public ConstrainedGeometry[] ConnectedGeometries { get; }
Property Value
ConstrainedGeometry[]
 FullSubentityPaths
public FullSubentityPath[] FullSubentityPaths { get; }
Property Value
FullSubentityPath[]
 GeomDependencyId
public ObjectId GeomDependencyId { get; }
Property Value
ObjectId
 IsReadOnly
public virtual bool IsReadOnly { get; }
Property Value
bool
 OwningRigidSet
public ConstrainedRigidSet OwningRigidSet { get; }
Property Value
ConstrainedRigidSet
Methods
 CommonConstraints(ConstrainedGeometry)
public GeometricalConstraint[] CommonConstraints(ConstrainedGeometry otherConsGeom)
Parameters
otherConsGeom ConstrainedGeometry
Returns
GeometricalConstraint[]