Table of Contents
 Enum UnitsValue
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::UnitsValue")]
[TypeConverter(typeof(UnitsConverter))]
public enum UnitsValue
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Angstroms = 11
Astronomical = 18
Centimeters = 5
Decimeters = 14
Dekameters = 15
Feet = 2
Gigameters = 17
Hectometers = 16
Inches = 1
Kilometers = 7
LightYears = 19
Meters = 6
MicroInches = 8
Microns = 13
Miles = 3
Millimeters = 4
Mils = 9
Nanometers = 12
Parsecs = 20
Undefined = 0
Yards = 10