Table of Contents
 Enum PlotSettingsShadePlotType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbPlotSettings::ShadePlotType")]
public enum PlotSettingsShadePlotType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AsDisplayed = 0
Hidden = 2
RenderPreset = 5
Rendered = 3
VisualStyle = 4
Wireframe = 1