Table of Contents
 Class ExtrudedSurface
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbExtrudedSurface")]
public class ExtrudedSurface : Surface, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
Entity
Surface
ExtrudedSurface
Implements
IDisposable
ICloneable
Inherited Members
 Surface.CreateFrom(Entity)
 Surface.ConvertToRegion()
 Surface.Thicken(double, bool)
 Surface.GetArea()
 Surface.CreateInterferenceObjects(Entity, int)
 Surface.BooleanUnion(Surface)
 Surface.BooleanSubtract(Solid3d)
 Surface.BooleanSubtract(Surface)
 Surface.BooleanIntersect(Solid3d)
 Surface.BooleanIntersect(Surface)
 Surface.ImprintEntity(Entity)
 Surface.CreateSectionObjects(Plane)
 Surface.SliceByPlane(Plane)
 Surface.SliceBySurface(Surface)
 Surface.ChamferEdges(SubentityId[], SubentityId, double, double, bool)
 Surface.ChamferEdges(SubentityId[], SubentityId, double, double)
 Surface.FilletEdges(SubentityId[], double, bool)
 Surface.FilletEdges(SubentityId[], DoubleCollection, DoubleCollection, DoubleCollection)
 Surface.SetSubentityColor(SubentityId, Color)
 Surface.GetSubentityColor(SubentityId)
 Surface.SetSubentityMaterial(SubentityId, ObjectId)
 Surface.GetSubentityMaterial(SubentityId)
 Surface.SetSubentityMaterialMapper(SubentityId, Mapper)
 Surface.GetSubentityMaterialMapper(SubentityId)
 Surface.ProjectOnToSurface(Entity, Vector3d)
 Surface.RayTest(Point3d, Vector3d, double, out SubentityId[], out DoubleCollection)
 Surface.ConvertToNurbSurface()
 Surface.ExtendEdges(FullSubentityPath[], double, Surface.EdgeExtensionType, bool)
 Surface.CreateExtendSurface(ObjectId, SubentityId[], double, Surface.EdgeExtensionType, bool)
 Surface.CreateExtrudedSurface(Profile3d, Vector3d, SweepOptions)
 Surface.CreateExtrudedSurface(Profile3d, Vector3d, SweepOptions, bool)
 Surface.CreateRevolvedSurface(Profile3d, Profile3d, bool, double, double, RevolveOptions)
 Surface.CreateRevolvedSurface(Profile3d, Profile3d, bool, double, double, RevolveOptions, bool)
 Surface.CreateRevolvedSurface(Profile3d, Point3d, Vector3d, double, double, RevolveOptions)
 Surface.CreateRevolvedSurface(Profile3d, Point3d, Vector3d, double, double, RevolveOptions, bool)
 Surface.CreateSweptSurface(Profile3d, Profile3d, SweepOptions)
 Surface.CreateSweptSurface(Profile3d, Profile3d, SweepOptions, bool)
 Surface.CreateLoftedSurface(LoftProfile[], LoftProfile[], LoftProfile, LoftOptions)
 Surface.CreateLoftedSurface(LoftProfile[], LoftProfile[], LoftProfile, LoftOptions, bool)
 Surface.CreateNetworkSurface(Profile3d[], Profile3d[])
 Surface.CreateNetworkSurface(Profile3d[], Profile3d[], bool)
 Surface.CreatePatchSurface(PathRef, ObjectIdCollection, int, double)
 Surface.CreatePatchSurface(PathRef, ObjectIdCollection, int, double, bool)
 Surface.CreateBlendSurface(LoftProfile, LoftProfile, BlendOptions)
 Surface.CreateBlendSurface(LoftProfile, LoftProfile, BlendOptions, bool)
 Surface.CreateFilletSurface(ObjectId, Point3d, ObjectId, Point3d, double, FilletTrimMode, Vector3d)
 Surface.CreateFilletSurface(ObjectId, Point3d, ObjectId, Point3d, double, FilletTrimMode, Vector3d, bool)
 Surface.CreateOffsetSurface(Entity, double)
 Surface.CreateOffsetSurface(Entity, double, bool)
 Surface.TrimSurface(ObjectId, ObjectIdCollection, ObjectIdCollection, Vector3dCollection, Point3d, Vector3d, bool, bool)
 Surface.UsesGraphicsCache
 Surface.Perimeter
 Surface.WireframeType
 Surface.VIsoLineDensity
 Surface.UIsoLineDensity
 Surface.ModificationActionBodyIds
 Surface.CreationActionBodyId
 Entity.SetLayerId(ObjectId, bool)
 Entity.SetPropertiesFrom(Entity)
 Entity.GetPlane()
 Entity.AddSubentityPaths(FullSubentityPath[])
 Entity.DeleteSubentityPaths(FullSubentityPath[])
 Entity.TransformSubentityPathsBy(FullSubentityPath[], Matrix3d)
 Entity.GetGripPointsAtSubentityPath(FullSubentityPath, GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.MoveGripPointsAtSubentityPaths(FullSubentityPath[], IntPtr[], Vector3d, MoveGripPointsFlags)
 Entity.GetSubentityGeometricExtents(FullSubentityPath)
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, IntPtr, Point3d, Matrix3d, ObjectId[])
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, long, Point3d, Matrix3d, int, ObjectId[])
 Entity.GetGraphicsMarkersAtSubentityPathIntPtr(FullSubentityPath)
 Entity.Highlight(FullSubentityPath, bool)
 Entity.Highlight()
 Entity.Unhighlight(FullSubentityPath, bool)
 Entity.Unhighlight()
 Entity.PushHighlight(FullSubentityPath, HighlightStyle)
 Entity.PopHighlight(FullSubentityPath)
 Entity.HighlightState(FullSubentityPath)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection, Matrix3d)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection)
 Entity.IsContentSnappable()
 Entity.GetGripPoints(GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.GetGripPoints(Point3dCollection, IntegerCollection, IntegerCollection)
 Entity.MoveGripPointsAt(GripDataCollection, Vector3d, MoveGripPointsFlags)
 Entity.MoveGripPointsAt(IntegerCollection, Vector3d)
 Entity.GetStretchPoints(Point3dCollection)
 Entity.MoveStretchPointsAt(IntegerCollection, Vector3d)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.List()
 Entity.TransformBy(Matrix3d)
 Entity.GetTransformedCopy(Matrix3d)
 Entity.GetSubentity(FullSubentityPath)
 Entity.Explode(DBObjectCollection)
 Entity.RecordGraphicsModified(bool)
 Entity.Draw()
 Entity.SaveAs(WorldDraw, SaveType)
 Entity.SetDatabaseDefaults(Database)
 Entity.SetDatabaseDefaults()
 Entity.SetDragStatus(DragStatus)
 Entity.SetGripStatus(GripStatus)
 Entity.SetSubentityGripStatus(GripStatus, FullSubentityPath)
 Entity.JoinEntity(Entity)
 Entity.JoinEntities(Entity[])
 Entity.EdgeStyleId
 Entity.FaceStyleId
 Entity.VisualStyleId
 Entity.ForceAnnoAllVisible
 Entity.BlockName
 Entity.MaterialMapper
 Entity.MaterialId
 Entity.Material
 Entity.ReceiveShadows
 Entity.CastShadows
 Entity.Hyperlinks
 Entity.CloneMeForDragging
 Entity.CompoundObjectTransform
 Entity.GeometricExtents
 Entity.Ecs
 Entity.IsPlanar
 Entity.CollisionType
 Entity.LineWeight
 Entity.Visible
 Entity.LinetypeScale
 Entity.LinetypeId
 Entity.Linetype
 Entity.LayerId
 Entity.Layer
 Entity.PlotStyleNameId
 Entity.PlotStyleName
 Entity.Transparency
 Entity.EntityColor
 Entity.ColorIndex
 Entity.Color
 Entity.BlockId
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ExtrudedSurface()
public ExtrudedSurface()
 ExtrudedSurface(IntPtr, bool)
protected ExtrudedSurface(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 Height
[UnitType(UnitType.Distance)]
public double Height { get; set; }
Property Value
double
 SweepEntity
public Entity SweepEntity { get; }
Property Value
Entity
 SweepOptions
public SweepOptions SweepOptions { get; set; }
Property Value
SweepOptions
 SweepProfile
public Profile3d SweepProfile { get; }
Property Value
Profile3d
 SweepVec
public Vector3d SweepVec { get; set; }
Property Value
Vector3d
 TaperAngle
[UnitType(UnitType.AngleNotTransformed)]
public double TaperAngle { get; set; }
Property Value
double
Methods
 CreateExtrudedSurface(Entity, Vector3d, SweepOptions)
public virtual void CreateExtrudedSurface(Entity sweepEnt, Vector3d directionVec, SweepOptions sweepOptions)
Parameters
sweepEnt Entity
directionVec Vector3d
sweepOptions SweepOptions
 SetExtrude(Vector3d, SweepOptions)
public void SetExtrude(Vector3d sweepVec, SweepOptions sweepOptions)
Parameters
sweepVec Vector3d
sweepOptions SweepOptions