Table of Contents
 Class AssocObjectTransaction
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocObjectPointer")]
public class AssocObjectTransaction : IDisposable
Inheritance
object
AssocObjectTransaction
Implements
IDisposable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocObjectTransaction(AssocAction)
public AssocObjectTransaction(AssocAction actionBeingEvaluated)
Parameters
actionBeingEvaluated AssocAction
 AssocObjectTransaction(AssocActionBody)
public AssocObjectTransaction(AssocActionBody actionBodyBeingEvaluated)
Parameters
actionBodyBeingEvaluated AssocActionBody
 AssocObjectTransaction(AssocDependency)
public AssocObjectTransaction(AssocDependency dependencyBeingEvaluated)
Parameters
dependencyBeingEvaluated AssocDependency
 AssocObjectTransaction(AssocDependencyBody)
public AssocObjectTransaction(AssocDependencyBody dependencyBodyBeingEvaluated)
Parameters
dependencyBodyBeingEvaluated AssocDependencyBody
Methods
 Dispose()
public override sealed void Dispose()
 Dispose(bool)
protected virtual void Dispose(bool A_0)
Parameters
A_0 bool
 GetDBObject(ObjectId, OpenMode, bool, bool)
public DBObject GetDBObject(ObjectId objectId, OpenMode openMode, bool openErased, bool openOnLockedLayer)
Parameters
objectId ObjectId
openMode OpenMode
openErased bool
openOnLockedLayer bool
Returns
DBObject
 IsSubstituteObject(DBObject)
public bool IsSubstituteObject(DBObject dbObject)
Parameters
dbObject DBObject
Returns
bool