Table of Contents
 Class Device
Namespace
Autodesk.AutoCAD.GraphicsSystem
Assembly
Acdbmgd.dll
[Wrapper("AcGsDevice")]
public class Device : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Device
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Device()
public Device()
 Device(IntPtr)
public Device(IntPtr hwnd)
Parameters
hwnd IntPtr
 Device(IntPtr, DeviceType)
public Device(IntPtr hwnd, DeviceType deviceType)
Parameters
hwnd IntPtr
deviceType DeviceType
 Device(IntPtr, bool)
protected Device(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 BackgroundColor
public Color BackgroundColor { get; set; }
Property Value
Color
 DeviceRenderType
public RendererType DeviceRenderType { get; set; }
Property Value
RendererType
 IsValid
public bool IsValid { get; }
Property Value
bool
Methods
 Add(View)
public bool Add(View view)
Parameters
view View
Returns
bool
 Create(IntPtr, bool)
public static Device Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
Device
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 Erase(View)
public bool Erase(View view)
Parameters
view View
Returns
bool
 EraseAll()
public void EraseAll()
 GetSnapshot(Rectangle)
public Bitmap GetSnapshot(Rectangle rectangle)
Parameters
rectangle Rectangle
Returns
Bitmap
 Invalidate()
public void Invalidate()
 Invalidate(Rectangle)
public void Invalidate(Rectangle rect)
Parameters
rect Rectangle
 OnDisplayChange(int, int, int)
public void OnDisplayChange(int bitsPerPixel, int xRes, int yRes)
Parameters
bitsPerPixel int
xRes int
yRes int
 OnRealizeBackgroundPalette()
public void OnRealizeBackgroundPalette()
 OnRealizeForegroundPalette()
public void OnRealizeForegroundPalette()
 OnSize(Size)
public void OnSize(Size size)
Parameters
size Size
 SetLogicalPalette(Color[])
public void SetLogicalPalette(Color[] palette)
Parameters
palette Color[]
 SetPhysicalPalette(Color[])
public void SetPhysicalPalette(Color[] palette)
Parameters
palette Color[]
 Update()
public void Update()
 Update(Rectangle)
public void Update(Rectangle updatedRect)
Parameters
updatedRect Rectangle