Table of Contents
 Class BulgeVertexCollection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class BulgeVertexCollection : CollectionBase, IList, ICollection, IEnumerable
Inheritance
object
CollectionBase
BulgeVertexCollection
Implements
IList
ICollection
IEnumerable
Inherited Members
 CollectionBase.Clear()
 CollectionBase.RemoveAt(int)
 CollectionBase.GetEnumerator()
 CollectionBase.OnSet(int, object, object)
 CollectionBase.OnInsert(int, object)
 CollectionBase.OnClear()
 CollectionBase.OnRemove(int, object)
 CollectionBase.OnSetComplete(int, object, object)
 CollectionBase.OnInsertComplete(int, object)
 CollectionBase.OnClearComplete()
 CollectionBase.OnRemoveComplete(int, object)
 CollectionBase.InnerList
 CollectionBase.List
 CollectionBase.Capacity
 CollectionBase.Count
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 BulgeVertexCollection()
public BulgeVertexCollection()
 BulgeVertexCollection(AcArray<AcGePoint2d,AcArrayMemCopyReallocator<AcGePoint2d> >*, AcArray<double,AcArrayMemCopyReallocator<double> >*)
protected BulgeVertexCollection(AcArray<AcGePoint2d,AcArrayMemCopyReallocator<AcGePoint2d> >* verts, AcArray<double,AcArrayMemCopyReallocator<double> >* bulges)
Parameters
verts AcArray<AcGePoint2d,AcArrayMemCopyReallocator<AcGePoint2d> >*
bulges AcArray<double,AcArrayMemCopyReallocator<double> >*
Properties
 this[int]
public BulgeVertex this[int index] { get; set; }
Parameters
index int
Property Value
BulgeVertex
Methods
 Add(BulgeVertex)
public int Add(BulgeVertex value)
Parameters
value BulgeVertex
Returns
int
 Contains(BulgeVertex)
public bool Contains(BulgeVertex value)
Parameters
value BulgeVertex
Returns
bool
 CopyTo(BulgeVertex[], int)
public void CopyTo(BulgeVertex[] array, int index)
Parameters
array BulgeVertex[]
index int
 GetArrays(AcArray<AcGePoint2d,AcArrayMemCopyReallocator<AcGePoint2d> >*, AcArray<double,AcArrayMemCopyReallocator<double> >*)
protected void GetArrays(AcArray<AcGePoint2d,AcArrayMemCopyReallocator<AcGePoint2d> >* verts, AcArray<double,AcArrayMemCopyReallocator<double> >* bulges)
Parameters
verts AcArray<AcGePoint2d,AcArrayMemCopyReallocator<AcGePoint2d> >*
bulges AcArray<double,AcArrayMemCopyReallocator<double> >*
 IndexOf(BulgeVertex)
public int IndexOf(BulgeVertex value)
Parameters
value BulgeVertex
Returns
int
 Insert(int, BulgeVertex)
public void Insert(int index, BulgeVertex value)
Parameters
index int
value BulgeVertex
 OnValidate(object)
protected override void OnValidate(object value)
Parameters
value object
 Remove(BulgeVertex)
public void Remove(BulgeVertex value)
Parameters
value BulgeVertex