Table of Contents
 Class ContextualColors
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiContextualColors2")]
public abstract class ContextualColors : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
ContextualColors
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ContextualColors()
protected ContextualColors()
 ContextualColors(IntPtr, bool)
protected ContextualColors(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 CameraClipping
public abstract int CameraClipping { get; }
Property Value
int
 CameraFrustrum
public abstract int CameraFrustrum { get; }
Property Value
int
 CameraGlyphs
public abstract int CameraGlyphs { get; }
Property Value
int
 GridAxisLineTintXYZ
public abstract int GridAxisLineTintXYZ { get; }
Property Value
int
 GridAxisLines
public abstract int GridAxisLines { get; }
Property Value
int
 GridMajorLineTintXYZ
public abstract int GridMajorLineTintXYZ { get; }
Property Value
int
 GridMajorLines
public abstract int GridMajorLines { get; }
Property Value
int
 GridMinorLineTintXYZ
public abstract int GridMinorLineTintXYZ { get; }
Property Value
int
 GridMinorLines
public abstract int GridMinorLines { get; }
Property Value
int
 LightDistanceColor
public abstract Color LightDistanceColor { get; }
Property Value
Color
 LightEndLimit
public abstract int LightEndLimit { get; }
Property Value
int
 LightFalloff
public abstract int LightFalloff { get; }
Property Value
int
 LightGlyphs
public abstract int LightGlyphs { get; }
Property Value
int
 LightHotspot
public abstract int LightHotspot { get; }
Property Value
int
 LightShapeColor
public abstract Color LightShapeColor { get; }
Property Value
Color
 LightStartLimit
public abstract int LightStartLimit { get; }
Property Value
int
 WebMeshColor
public abstract Color WebMeshColor { get; }
Property Value
Color
 WebMeshMissingColor
public abstract Color WebMeshMissingColor { get; }
Property Value
Color
Methods
 FlagsSet(int)
public abstract bool FlagsSet(int flag)
Parameters
flag int
Returns
bool
 SetContextFlags(int, bool)
public abstract void SetContextFlags(int flag, bool set)
Parameters
flag int
set bool