Table of Contents
 Class LayoutManager
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbLayoutManager")]
public class LayoutManager : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
LayoutManager
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 LayoutManager(IntPtr, Database)
protected LayoutManager(IntPtr pImpObj, Database db)
Parameters
pImpObj IntPtr
db Database
Properties
 Current
public static LayoutManager Current { get; }
Property Value
LayoutManager
 CurrentLayout
public string CurrentLayout { get; set; }
Property Value
string
 LayoutCount
public int LayoutCount { get; }
Property Value
int
Methods
 CloneLayout(string, string, int)
public void CloneLayout(string copyName, string newName, int newTabOrder)
Parameters
copyName string
newName string
newTabOrder int
 CopyLayout(string, string)
public void CopyLayout(string copyName, string newName)
Parameters
copyName string
newName string
 CreateLayout(string)
public ObjectId CreateLayout(string newName)
Parameters
newName string
Returns
ObjectId
 DeleteLayout(string)
public void DeleteLayout(string deleteName)
Parameters
deleteName string
 GetLayoutId(string)
public ObjectId GetLayoutId(string name)
Parameters
name string
Returns
ObjectId
 GetNonRectangularViewportIdFromClipId(ObjectId)
public ObjectId GetNonRectangularViewportIdFromClipId(ObjectId clipId)
Parameters
clipId ObjectId
Returns
ObjectId
 RenameLayout(string, string)
public void RenameLayout(string oldName, string newName)
Parameters
oldName string
newName string
 SetCurrentLayoutId(ObjectId)
public void SetCurrentLayoutId(ObjectId layoutId)
Parameters
layoutId ObjectId
Events
 AbortLayoutCopied
public event LayoutEventHandler AbortLayoutCopied
Event Type
LayoutEventHandler
 AbortLayoutRemoved
public event LayoutEventHandler AbortLayoutRemoved
Event Type
LayoutEventHandler
 AbortLayoutRename
public event LayoutRenamedEventHandler AbortLayoutRename
Event Type
LayoutRenamedEventHandler
 LayoutCopied
public event LayoutCopiedEventHandler LayoutCopied
Event Type
LayoutCopiedEventHandler
 LayoutCreated
public event LayoutEventHandler LayoutCreated
Event Type
LayoutEventHandler
 LayoutRemoved
public event LayoutEventHandler LayoutRemoved
Event Type
LayoutEventHandler
 LayoutRenamed
public event LayoutRenamedEventHandler LayoutRenamed
Event Type
LayoutRenamedEventHandler
 LayoutSwitched
public event LayoutEventHandler LayoutSwitched
Event Type
LayoutEventHandler
 LayoutToBeCopied
public event LayoutEventHandler LayoutToBeCopied
Event Type
LayoutEventHandler
 LayoutToBeRemoved
public event LayoutEventHandler LayoutToBeRemoved
Event Type
LayoutEventHandler
 LayoutToBeRenamed
public event LayoutRenamedEventHandler LayoutToBeRenamed
Event Type
LayoutRenamedEventHandler
 LayoutsRefresh
public event EventHandler LayoutsRefresh
Event Type
EventHandler
 LayoutsReordered
public event EventHandler LayoutsReordered
Event Type
EventHandler
 PlotStyleTableChanged
public event PlotStyleTableChangedEventHandler PlotStyleTableChanged
Event Type
PlotStyleTableChangedEventHandler