Table of Contents
 Interface IParameter
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public interface IParameter : IDisposable
Inherited Members
 IDisposable.Dispose()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Angular
bool Angular { get; }
Property Value
bool
 DataType
DxfCode DataType { get; }
Property Value
DxfCode
 Description
string Description { get; set; }
Property Value
string
 Expression
string Expression { get; set; }
Property Value
string
 Name
string Name { get; set; }
Property Value
string
 ParameterObject
DBObject ParameterObject { get; }
Property Value
DBObject
 ReadOnly
bool ReadOnly { get; }
Property Value
bool
 Value
ResultBuffer Value { get; set; }
Property Value
ResultBuffer
 ValueSet
ParameterValueSet ValueSet { get; }
Property Value
ParameterValueSet
Methods
 IsNameUnique(string)
bool IsNameUnique(string name)
Parameters
name string
Returns
bool