Table of Contents
 Class GraphNodeCollection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public sealed class GraphNodeCollection : DisposableWrapper, IDisposable, IList, ICollection, IEnumerable
Inheritance
object
MarshalByRefObject
DisposableWrapper
GraphNodeCollection
Implements
IDisposable
IList
ICollection
IEnumerable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 GraphNodeCollection()
public GraphNodeCollection()
Properties
 Count
public int Count { get; }
Property Value
int
 this[int]
public GraphNode this[int index] { get; set; }
Parameters
index int
Property Value
GraphNode
Methods
 Add(GraphNode)
public int Add(GraphNode value)
Parameters
value GraphNode
Returns
int
 Clear()
public void Clear()
 Contains(GraphNode)
public bool Contains(GraphNode value)
Parameters
value GraphNode
Returns
bool
 CopyTo(GraphNode[], int)
public void CopyTo(GraphNode[] array, int index)
Parameters
array GraphNode[]
index int
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 GetEnumerator()
public IEnumerator GetEnumerator()
Returns
IEnumerator
 IndexOf(GraphNode)
public int IndexOf(GraphNode value)
Parameters
value GraphNode
Returns
int
 Insert(int, GraphNode)
public void Insert(int index, GraphNode value)
Parameters
index int
value GraphNode
 Remove(GraphNode)
public void Remove(GraphNode value)
Parameters
value GraphNode
 RemoveAt(int)
public void RemoveAt(int index)
Parameters
index int