Table of Contents
 Class GripModeCollection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcArray<AcDbMultiModesGripPE::GripMode>")]
public sealed class GripModeCollection : DisposableWrapper, IDisposable, ICollection<GripMode>, IEnumerable<GripMode>, IEnumerable
Inheritance
object
MarshalByRefObject
DisposableWrapper
GripModeCollection
Implements
IDisposable
ICollection<GripMode>
IEnumerable<GripMode>
IEnumerable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 GripModeCollection()
public GripModeCollection()
Properties
 Count
public virtual int Count { get; }
Property Value
int
 IsReadOnly
public virtual bool IsReadOnly { get; }
Property Value
bool
 this[int]
public GripMode this[int i] { get; }
Parameters
i int
Property Value
GripMode
Methods
 Add(GripMode)
public void Add(GripMode gripMode)
Parameters
gripMode GripMode
 Clear()
public void Clear()
 Contains(GripMode)
public bool Contains(GripMode gripMode)
Parameters
gripMode GripMode
Returns
bool
 CopyTo(GripMode[], int)
public void CopyTo(GripMode[] A_0, int A_1)
Parameters
A_0 GripMode[]
A_1 int
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 GetEnumerator()
public IEnumerator<GripMode> GetEnumerator()
Returns
IEnumerator<GripMode>
 Remove(GripMode)
public bool Remove(GripMode gripMode)
Parameters
gripMode GripMode
Returns
bool