Table of Contents
 Class EntityColorCollection
Namespace
Autodesk.AutoCAD.Colors
Assembly
Acdbmgd.dll
[Wrapper("AcCmEntityColorArray")]
public class EntityColorCollection : IList, ICollection, IEnumerable
Inheritance
object
EntityColorCollection
Implements
IList
ICollection
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 EntityColorCollection()
public EntityColorCollection()
 EntityColorCollection(EntityColor[])
public EntityColorCollection(EntityColor[] values)
Parameters
values EntityColor[]
 EntityColorCollection(int)
public EntityColorCollection(int capacity)
Parameters
capacity int
Fields
 DefaultSize
public const int DefaultSize = 10
Field Value
int
Properties
 Capacity
public virtual int Capacity { get; set; }
Property Value
int
 Count
public virtual int Count { get; }
Property Value
int
 IsFixedSize
public virtual bool IsFixedSize { get; }
Property Value
bool
 IsReadOnly
public virtual bool IsReadOnly { get; }
Property Value
bool
 IsSynchronized
public virtual bool IsSynchronized { get; }
Property Value
bool
 this[int]
public virtual EntityColor this[int index] { get; set; }
Parameters
index int
Property Value
EntityColor
 SyncRoot
public virtual object SyncRoot { get; }
Property Value
object
Methods
 Add(EntityColor)
public virtual int Add(EntityColor value)
Parameters
value EntityColor
Returns
int
 AddRange(EntityColor[])
public virtual void AddRange(EntityColor[] range)
Parameters
range EntityColor[]
 Clear()
public virtual void Clear()
 Contains(EntityColor)
public virtual bool Contains(EntityColor value)
Parameters
value EntityColor
Returns
bool
 CopyTo(EntityColor[], int)
public virtual void CopyTo(EntityColor[] array, int index)
Parameters
array EntityColor[]
index int
 GetEnumerator()
public virtual EntityColorCollectionEnumerator GetEnumerator()
Returns
EntityColorCollectionEnumerator
 IndexOf(EntityColor)
public virtual int IndexOf(EntityColor value)
Parameters
value EntityColor
Returns
int
 Insert(int, EntityColor)
public virtual void Insert(int index, EntityColor value)
Parameters
index int
value EntityColor
 Remove(EntityColor)
public virtual void Remove(EntityColor value)
Parameters
value EntityColor
 RemoveAt(int)
public virtual void RemoveAt(int index)
Parameters
index int
 ToArray()
public virtual EntityColor[] ToArray()
Returns
EntityColor[]
 TrimToSize()
public virtual void TrimToSize()