Table of Contents
 Enum ExtractionType
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public enum ExtractionType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AllLine = 1
OutLine = 0