Table of Contents
 Enum DetailSymbolBoundaryType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDetailSymbol::BoundaryType")]
public enum DetailSymbolBoundaryType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CircularBoundary = 0
CustomBoundary = 2
RectangularBoundary = 1