Table of Contents
 Enum PlotPaperUnit
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbPlotSettings::PlotPaperUnits")]
public enum PlotPaperUnit
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Inches = 0
Millimeters = 1
Pixels = 2