Table of Contents
 Enum FlowDirection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[TypeConverter(typeof(EnumConverter))]
[Wrapper("AcDbMText::FlowDirection")]
public enum FlowDirection
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BottomToTop = 4
ByStyle = 5
LeftToRight = 1
NotSet = 0
RightToLeft = 2
TopToBottom = 3