Table of Contents
 Enum XrefOperation
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum XrefOperation
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
XrefAttachOperation = 0
XrefBindOperation = 1
XrefDetachOperation = 2
XrefOverlayOperation = 3
XrefPathOperation = 4
XrefReloadOperation = 5
XrefResolveOperation = 6
XrefUnloadOperation = 7
XrefXBindOperation = 1