Table of Contents
 Enum MoveType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMLeader::MoveType")]
public enum MoveType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
MoveAllExceptArrowHeaderPoints = 1
MoveAllPoints = 0
MoveContentAndDoglegPoints = 2