Table of Contents
 Class PointOnCurve2d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGePointOnCurve2d")]
public sealed class PointOnCurve2d : PointEntity2d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity2d
PointEntity2d
PointOnCurve2d
Implements
IDisposable
ICloneable
Inherited Members
 Entity2d.Clone()
 Entity2d.IsEqualTo(Entity2d)
 Entity2d.IsEqualTo(Entity2d, Tolerance)
 Entity2d.TransformBy(Matrix2d)
 Entity2d.TranslateBy(Vector2d)
 Entity2d.RotateBy(double, Point2d)
 Entity2d.Mirror(Line2d)
 Entity2d.ScaleBy(double, Point2d)
 Entity2d.IsOn(Point2d)
 Entity2d.IsOn(Point2d, Tolerance)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 PointOnCurve2d()
public PointOnCurve2d()
 PointOnCurve2d(Curve2d)
public PointOnCurve2d(Curve2d curve)
Parameters
curve Curve2d
 PointOnCurve2d(Curve2d, double)
public PointOnCurve2d(Curve2d curve, double parameter)
Parameters
curve Curve2d
parameter double
 PointOnCurve2d(IntPtr, bool)
protected PointOnCurve2d(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 Curve
public Curve2d Curve { get; set; }
Property Value
Curve2d
 Parameter
public double Parameter { get; set; }
Property Value
double
 Point
public Point2d Point { get; }
Property Value
Point2d
Methods
 Create(IntPtr, bool)
public static PointOnCurve2d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
PointOnCurve2d
 GetDerivative(int)
public Vector2d GetDerivative(int order)
Parameters
order int
Returns
Vector2d
 GetDerivative(int, Curve2d, double)
public Vector2d GetDerivative(int order, Curve2d curve, double parameter)
Parameters
order int
curve Curve2d
parameter double
Returns
Vector2d
 GetDerivative(int, double)
public Vector2d GetDerivative(int order, double parameter)
Parameters
order int
parameter double
Returns
Vector2d
 GetPointAtParameter(double)
public Point2d GetPointAtParameter(double parameter)
Parameters
parameter double
Returns
Point2d
 GetPointOnCurve(Curve2d, double)
public Point2d GetPointOnCurve(Curve2d curve, double parameter)
Parameters
curve Curve2d
parameter double
Returns
Point2d