Table of Contents
 Struct XrefObjectId
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbXrefObjectId")]
public struct XrefObjectId
Inherited Members
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 XrefObjectId(ObjectId)
public XrefObjectId(ObjectId LocalId)
Parameters
LocalId ObjectId
 XrefObjectId(ObjectId, Handle)
public XrefObjectId(ObjectId XrefBlockTableRecordId, Handle hand)
Parameters
XrefBlockTableRecordId ObjectId
hand Handle
Properties
 Handle
public Handle Handle { get; }
Property Value
Handle
 IsNull
public bool IsNull { get; }
Property Value
bool
 IsValid
public bool IsValid { get; }
Property Value
bool
 IsXref
public bool IsXref { get; }
Property Value
bool
 ObjectId
public ObjectId ObjectId { get; }
Property Value
ObjectId
Methods
 Deserialize(ResultBuffer, out ResultBuffer)
public static XrefObjectId Deserialize(ResultBuffer rbStart, out ResultBuffer rbEnd)
Parameters
rbStart ResultBuffer
rbEnd ResultBuffer
Returns
XrefObjectId
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 ResolveObjectId()
public ObjectId ResolveObjectId()
Returns
ObjectId
 Serialize()
public ResultBuffer Serialize()
Returns
ResultBuffer
Operators
 operator ==(XrefObjectId, XrefObjectId)
public static bool operator ==(XrefObjectId a, XrefObjectId b)
Parameters
a XrefObjectId
b XrefObjectId
Returns
bool
 operator !=(XrefObjectId, XrefObjectId)
public static bool operator !=(XrefObjectId a, XrefObjectId b)
Parameters
a XrefObjectId
b XrefObjectId
Returns
bool