Table of Contents
 Class UnderlayLayerCollection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public sealed class UnderlayLayerCollection : ICollection, IEnumerable
Inheritance
object
UnderlayLayerCollection
Implements
ICollection
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Count
public int Count { get; }
Property Value
int
 this[int]
public UnderlayLayer this[int index] { get; set; }
Parameters
index int
Property Value
UnderlayLayer
Methods
 CopyTo(UnderlayLayer[], int)
public void CopyTo(UnderlayLayer[] array, int index)
Parameters
array UnderlayLayer[]
index int
 GetEnumerator()
public IEnumerator GetEnumerator()
Returns
IEnumerator