Table of Contents
 Class AssocAction
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocAction")]
public class AssocAction : DBObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
AssocAction
Implements
IDisposable
ICloneable
Derived
Assoc2dConstraintGroup
AssocNetwork
AssocVariable
Inherited Members
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocAction()
public AssocAction()
 AssocAction(IntPtr, bool)
protected AssocAction(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 ActionBody
public ObjectId ActionBody { get; set; }
Property Value
ObjectId
 CurrentEvaluationCallback
public AssocEvaluationCallback CurrentEvaluationCallback { get; }
Property Value
AssocEvaluationCallback
 IsActionBodyAProxy
public bool IsActionBodyAProxy { get; }
Property Value
bool
 IsActionEvaluationInProgress
public bool IsActionEvaluationInProgress { get; }
Property Value
bool
 OwningNetwork
public ObjectId OwningNetwork { get; }
Property Value
ObjectId
 Status
public AssocStatus Status { get; set; }
Property Value
AssocStatus
Methods
 AddDependency(ObjectId, bool)
public void AddDependency(ObjectId dependencyId, bool setThisActionAsOwningAction)
Parameters
dependencyId ObjectId
setThisActionAsOwningAction bool
 AddMoreObjectsToDeepClone(IdMapping, ObjectIdCollection)
public void AddMoreObjectsToDeepClone(IdMapping idMap, ObjectIdCollection additionalObjectsToClone)
Parameters
idMap IdMapping
additionalObjectsToClone ObjectIdCollection
 AreDependenciesEqual(AssocDependency, AssocDependency)
public bool AreDependenciesEqual(AssocDependency dependency1, AssocDependency dependency2)
Parameters
dependency1 AssocDependency
dependency2 AssocDependency
Returns
bool
 AreDependenciesOnTheSameThing(AssocDependency, AssocDependency)
public bool AreDependenciesOnTheSameThing(AssocDependency dependency1, AssocDependency dependency2)
Parameters
dependency1 AssocDependency
dependency2 AssocDependency
Returns
bool
 DependentObjectCloned(AssocDependency, DBObject, DBObject)
public void DependentObjectCloned(AssocDependency dependency, DBObject dbObj, DBObject newObj)
Parameters
dependency AssocDependency
dbObj DBObject
newObj DBObject
 DragStatus(DragStatus)
public void DragStatus(DragStatus status)
Parameters
status DragStatus
 Evaluate(AssocEvaluationCallback)
public void Evaluate(AssocEvaluationCallback evaluationCallback)
Parameters
evaluationCallback AssocEvaluationCallback
 EvaluateDependencies()
public void EvaluateDependencies()
 EvaluateDependency(AssocDependency)
public void EvaluateDependency(AssocDependency dependency)
Parameters
dependency AssocDependency
 EvaluationPriority()
public AssocEvaluationPriority EvaluationPriority()
Returns
AssocEvaluationPriority
 GetActionBody(ObjectId)
public static ObjectId GetActionBody(ObjectId actionId)
Parameters
actionId ObjectId
Returns
ObjectId
 GetActionsDependentOnObject(DBObject, bool, bool)
public static ObjectIdCollection GetActionsDependentOnObject(DBObject dbObj, bool readDependenciesWanted, bool writeDependenciesWanted)
Parameters
dbObj DBObject
readDependenciesWanted bool
writeDependenciesWanted bool
Returns
ObjectIdCollection
 GetActionsDependentOnObject(DBObject, bool, bool, ObjectIdCollection)
public static void GetActionsDependentOnObject(DBObject dbObj, bool readDependenciesWanted, bool writeDependenciesWanted, ObjectIdCollection actionIds)
Parameters
dbObj DBObject
readDependenciesWanted bool
writeDependenciesWanted bool
actionIds ObjectIdCollection
 GetDependencies(bool, bool)
public ObjectIdCollection GetDependencies(bool readDependenciesWanted, bool writeDependenciesWanted)
Parameters
readDependenciesWanted bool
writeDependenciesWanted bool
Returns
ObjectIdCollection
 GetDependentActionsToEvaluate(ActionsToEvaluateCallback)
public void GetDependentActionsToEvaluate(ActionsToEvaluateCallback actionsToEvaluateCallback)
Parameters
actionsToEvaluateCallback ActionsToEvaluateCallback
 GetDependentObjects(bool, bool)
public ObjectIdCollection GetDependentObjects(bool readDependenciesWanted, bool writeDependenciesWanted)
Parameters
readDependenciesWanted bool
writeDependenciesWanted bool
Returns
ObjectIdCollection
 HasDependencyCachedValue(AssocDependency)
public bool HasDependencyCachedValue(AssocDependency dependency)
Parameters
dependency AssocDependency
Returns
bool
 IsEqualTo(AssocAction)
public bool IsEqualTo(AssocAction otherAction)
Parameters
otherAction AssocAction
Returns
bool
 IsExternalDependency(AssocDependency)
public bool IsExternalDependency(AssocDependency dependency)
Parameters
dependency AssocDependency
Returns
bool
 IsOwnedDependency(AssocDependency)
public bool IsOwnedDependency(AssocDependency dependency)
Parameters
dependency AssocDependency
Returns
bool
 IsRelevantDependencyChange(AssocDependency)
public bool IsRelevantDependencyChange(AssocDependency dependency)
Parameters
dependency AssocDependency
Returns
bool
 ObjectThatOwnsNetworkInstance()
public ObjectId ObjectThatOwnsNetworkInstance()
Returns
ObjectId
 OwnedDependencyStatusChanged(AssocDependency, AssocStatus)
public void OwnedDependencyStatusChanged(AssocDependency ownedDependency, AssocStatus previousStatus)
Parameters
ownedDependency AssocDependency
previousStatus AssocStatus
 PostProcessAfterDeepClone(IdMapping)
public void PostProcessAfterDeepClone(IdMapping idMap)
Parameters
idMap IdMapping
 PostProcessAfterDeepCloneCancel(IdMapping)
public void PostProcessAfterDeepCloneCancel(IdMapping idMap)
Parameters
idMap IdMapping
 RemoveActionsControllingObject(ObjectId)
public static void RemoveActionsControllingObject(ObjectId objID)
Parameters
objID ObjectId
 RemoveActionsControllingObject(ObjectId, int)
public static void RemoveActionsControllingObject(ObjectId objID, int readOnlyDependencyHandling)
Parameters
objID ObjectId
readOnlyDependencyHandling int
 RemoveActionsControllingObject(ObjectId, int, ObjectId)
public static void RemoveActionsControllingObject(ObjectId objID, int readOnlyDependencyHandling, ObjectId objectToRedirectReadOnlyDependenciesTo)
Parameters
objID ObjectId
readOnlyDependencyHandling int
objectToRedirectReadOnlyDependenciesTo ObjectId
 RemoveAllDependencies(bool)
public void RemoveAllDependencies(bool alsoEraseThem)
Parameters
alsoEraseThem bool
 RemoveDependency(ObjectId, bool)
public void RemoveDependency(ObjectId dependencyId, bool alsoEraseIt)
Parameters
dependencyId ObjectId
alsoEraseIt bool
 SetOwningNetwork(ObjectId, bool)
public void SetOwningNetwork(ObjectId networkId, bool alsoSetAsDatabaseOwner)
Parameters
networkId ObjectId
alsoSetAsDatabaseOwner bool
 SetStatus(AssocStatus, bool, bool)
public void SetStatus(AssocStatus newStatus, bool notifyOwningNetwork, bool setInOwnedActions)
Parameters
newStatus AssocStatus
notifyOwningNetwork bool
setInOwnedActions bool
 TransformActionBy(Matrix3d)
public void TransformActionBy(Matrix3d transform)
Parameters
transform Matrix3d