Table of Contents
 Class KernelDescriptor
Namespace
Autodesk.AutoCAD.GraphicsSystem
Assembly
Acdbmgd.dll
[Wrapper("AcGiKernelDescriptor")]
public class KernelDescriptor : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
KernelDescriptor
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 KernelDescriptor()
public KernelDescriptor()
Fields
 Drawing2D
public static UniqueString Drawing2D
Field Value
UniqueString
 Drawing3D
public static UniqueString Drawing3D
Field Value
UniqueString
 RapidRTRendering3D
public static UniqueString RapidRTRendering3D
Field Value
UniqueString
 Selection3D
public static UniqueString Selection3D
Field Value
UniqueString
Methods
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 GetImpObj()
protected AcGiKernelDescriptor* GetImpObj()
Returns
AcGiKernelDescriptor*
 addRequirement(UniqueString)
public void addRequirement(UniqueString capability)
Parameters
capability UniqueString
 supports(UniqueString)
public bool supports(UniqueString capability)
Parameters
capability UniqueString
Returns
bool