Table of Contents
 Enum VSEdgeStyles
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiVisualStyleProperties::EdgeStyles")]
[Flags]
public enum VSEdgeStyles
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
IntersectionFlag = 8
None = 0
ObscuredFlag = 4
SilhouetteFlag = 2
VisibleFlag = 1