Table of Contents
 Class HighlightStateOverrule
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbHighlightStateOverrule")]
public abstract class HighlightStateOverrule : Overrule, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Overrule
HighlightStateOverrule
Implements
IDisposable
ICloneable
Inherited Members
 Overrule.AddOverrule(RXClass, Overrule, bool)
 Overrule.RemoveOverrule(RXClass, Overrule)
 Overrule.HasOverrule(RXObject, RXClass)
 Overrule.IsApplicable(RXObject)
 Overrule.Overruling
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 HighlightStateOverrule()
protected HighlightStateOverrule()
Methods
 HighlightState(Entity, FullSubentityPath)
public virtual HighlightStyle HighlightState(Entity entity, FullSubentityPath subId)
Parameters
entity Entity
subId FullSubentityPath
Returns
HighlightStyle
 PopHighlight(Entity, FullSubentityPath)
public virtual void PopHighlight(Entity entity, FullSubentityPath subId)
Parameters
entity Entity
subId FullSubentityPath
 PushHighlight(Entity, FullSubentityPath, HighlightStyle)
public virtual void PushHighlight(Entity entity, FullSubentityPath subId, HighlightStyle highlightStyle)
Parameters
entity Entity
subId FullSubentityPath
highlightStyle HighlightStyle
 SetCustomFilter()
public override sealed void SetCustomFilter()
 SetExtensionDictionaryEntryFilter(string)
public override sealed void SetExtensionDictionaryEntryFilter(string entryName)
Parameters
entryName string
 SetIdFilter(ObjectId[])
public override sealed void SetIdFilter(ObjectId[] ids)
Parameters
ids ObjectId[]
 SetNoFilter()
public override sealed void SetNoFilter()
 SetXDataFilter(string)
public override sealed void SetXDataFilter(string registeredApplicationName)
Parameters
registeredApplicationName string