Table of Contents
 Enum Method
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiMaterialColor::Method")]
public enum Method
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Inherit = 0
Override = 1