Table of Contents
 Enum ClipBoundaryType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbRasterImage::ClipBoundaryType")]
public enum ClipBoundaryType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Invalid = 0
Poly = 2
Rectangle = 1