Table of Contents
 Class BoundBlock3d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeBoundBlock3d")]
public sealed class BoundBlock3d : Entity3d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
BoundBlock3d
Implements
IDisposable
ICloneable
Inherited Members
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.IsOn(Point3d)
 Entity3d.IsOn(Point3d, Tolerance)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 BoundBlock3d()
public BoundBlock3d()
 BoundBlock3d(Point3d, Vector3d, Vector3d, Vector3d)
public BoundBlock3d(Point3d point1, Vector3d dir1, Vector3d dir2, Vector3d dir3)
Parameters
point1 Point3d
dir1 Vector3d
dir2 Vector3d
dir3 Vector3d
Properties
 BasePoint
public Point3d BasePoint { get; }
Property Value
Point3d
 Direction1
public Vector3d Direction1 { get; }
Property Value
Vector3d
 Direction2
public Vector3d Direction2 { get; }
Property Value
Vector3d
 Direction3
public Vector3d Direction3 { get; }
Property Value
Vector3d
 IsBox
public bool IsBox { get; set; }
Property Value
bool
Methods
 Contains(Point3d)
public bool Contains(Point3d pointToTest)
Parameters
pointToTest Point3d
Returns
bool
 Create(IntPtr, bool)
public static BoundBlock3d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
BoundBlock3d
 Extend(Point3d)
public void Extend(Point3d pointToInclude)
Parameters
pointToInclude Point3d
 GetMaximumPoint()
public Point3d GetMaximumPoint()
Returns
Point3d
 GetMinimumPoint()
public Point3d GetMinimumPoint()
Returns
Point3d
 IsDisjoint(BoundBlock3d)
public bool IsDisjoint(BoundBlock3d block)
Parameters
block BoundBlock3d
Returns
bool
 Set(Point3d, Point3d)
public void Set(Point3d basePoint, Point3d maximumPoint)
Parameters
basePoint Point3d
maximumPoint Point3d
 Set(Point3d, Vector3d, Vector3d, Vector3d)
public void Set(Point3d basePoint, Vector3d dir1, Vector3d dir2, Vector3d dir3)
Parameters
basePoint Point3d
dir1 Vector3d
dir2 Vector3d
dir3 Vector3d
 Swell(double)
public void Swell(double distance)
Parameters
distance double