Table of Contents
 Enum HighlightStyle
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcGiHighlightStyle")]
public enum HighlightStyle
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Custom = 1
DashedAndThicken = 2
Dim = Custom | DashedAndThicken
Glow = Custom | ThickDim
None = 0
ThickDim = 4