Table of Contents
 Enum SurfaceSurfaceIntersectorConfiguration
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGe::ssiConfig")]
public enum SurfaceSurfaceIntersectorConfiguration
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Coincident = 3
In = 2
Out = 1
Unknown = 0