Table of Contents
 Struct Extents3d
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbExtents")]
public struct Extents3d : IFormattable
Implements
IFormattable
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 Extents3d()
public Extents3d()
 Extents3d(Point3d, Point3d)
public Extents3d(Point3d min, Point3d max)
Parameters
min Point3d
max Point3d
Properties
 MaxPoint
public Point3d MaxPoint { get; }
Property Value
Point3d
 MinPoint
public Point3d MinPoint { get; }
Property Value
Point3d
Methods
 AddBlockExtents(BlockTableRecord)
public void AddBlockExtents(BlockTableRecord pointerToBlockTableRecord)
Parameters
pointerToBlockTableRecord BlockTableRecord
 AddExtents(Extents3d)
public void AddExtents(Extents3d source)
Parameters
source Extents3d
 AddPoint(Point3d)
public void AddPoint(Point3d pt)
Parameters
pt Point3d
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 ExpandBy(Vector3d)
public void ExpandBy(Vector3d vector)
Parameters
vector Vector3d
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 IsEqualTo(Extents3d)
public bool IsEqualTo(Extents3d a)
Parameters
a Extents3d
Returns
bool
 IsEqualTo(Extents3d, Tolerance)
public bool IsEqualTo(Extents3d a, Tolerance tolerance)
Parameters
a Extents3d
tolerance Tolerance
Returns
bool
 Set(Point3d, Point3d)
public void Set(Point3d min, Point3d max)
Parameters
min Point3d
max Point3d
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
 ToString(string, IFormatProvider)
public string ToString(string format, IFormatProvider provider)
Parameters
format string
provider IFormatProvider
Returns
string
 TransformBy(Matrix3d)
public void TransformBy(Matrix3d mat)
Parameters
mat Matrix3d
Operators
 operator ==(Extents3d, Extents3d)
public static bool operator ==(Extents3d a, Extents3d b)
Parameters
a Extents3d
b Extents3d
Returns
bool
 operator !=(Extents3d, Extents3d)
public static bool operator !=(Extents3d a, Extents3d b)
Parameters
a Extents3d
b Extents3d
Returns
bool