Table of Contents
 Class RXObject
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
[Wrapper("AcRxObject")]
public abstract class RXObject : DisposableWrapper, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Implements
IDisposable
ICloneable
Derived
AssocArrayParameters
AssocDependencyPE
AssocPersSubentityId
AssocPersSubentityIdPE
AssocValueProviderPE
CompoundObjectId
ConstraintGroupNode
DataAdapter
DataAdapterManager
DataAdapterProvider
DataCell
DataColumn
DataLinkManager
Database
DbDictionaryEnumerator
DwgFiler
DxfFiler
GeomRef
HostApplicationServices
IdMapping
InterferenceProtocolExtension
LayerStateManager
LayoutManager
MatchProperties
MultiModesGripPE
ObjectContext
ObjectContextCollection
ObjectContextCollectionEnumerator
ObjectContextManager
Profile3d
Transaction
TransactionManager
XrecordEnumerator
CommonDraw
Context
ContextualColors
Drawable
Fill
GdiDrawObject
Geometry
LightAttenuation
Mapper
MaterialColor
MaterialMap
MaterialTexture
ShadowParameters
SkyParameters
SubEntityTraits
TextStyle
ToneOperatorParameters
Viewport
VisualStyle
LayerFilter
Dictionary
DynamicLinker
Overrule
RXClass
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 RXObject(IntPtr, bool)
protected RXObject(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Methods
 Clone()
public virtual object Clone()
Returns
object
 CompareTo(object)
public int CompareTo(object obj)
Parameters
obj object
Returns
int
 CopyFrom(RXObject)
public virtual void CopyFrom(RXObject source)
Parameters
source RXObject
 Create(IntPtr, bool)
public static RXObject Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
RXObject
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 GetClass(Type)
public static RXClass GetClass(Type type)
Parameters
type Type
Returns
RXClass
 GetRXClass()
public RXClass GetRXClass()
Returns
RXClass
 QueryX(RXClass)
public IntPtr QueryX(RXClass protocolClass)
Parameters
protocolClass RXClass
Returns
IntPtr
 X(RXClass)
public IntPtr X(RXClass protocolClass)
Parameters
protocolClass RXClass
Returns
IntPtr