Table of Contents
 Enum ExternalEntityKind
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public enum ExternalEntityKind
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AcisEntity = 0
ExternalEntityUndefined = 1