Table of Contents
 Class Surface
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeSurface")]
public abstract class Surface : Entity3d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
Surface
Implements
IDisposable
ICloneable
Derived
Cone
Cylinder
ExternalBoundedSurface
ExternalSurface
NurbSurface
OffsetSurface
PlanarEntity
Sphere
Torus
Inherited Members
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.IsOn(Point3d)
 Entity3d.IsOn(Point3d, Tolerance)
 Entity3d.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 IsNormalReversed
public bool IsNormalReversed { get; }
Property Value
bool
 ReverseNormal
public Surface ReverseNormal { get; }
Property Value
Surface
Methods
 ClosestPointTo(Point3d)
public Point3d ClosestPointTo(Point3d point)
Parameters
point Point3d
Returns
Point3d
 ClosestPointTo(Point3d, Tolerance)
public Point3d ClosestPointTo(Point3d point, Tolerance tolerance)
Parameters
point Point3d
tolerance Tolerance
Returns
Point3d
 Create(IntPtr, bool)
public static Surface Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
Surface
 DistanceTo(Point3d)
public double DistanceTo(Point3d point)
Parameters
point Point3d
Returns
double
 DistanceTo(Point3d, Tolerance)
public double DistanceTo(Point3d point, Tolerance tolerance)
Parameters
point Point3d
tolerance Tolerance
Returns
double
 EvaluatePoint(Point2d)
public Point3d EvaluatePoint(Point2d parameter)
Parameters
parameter Point2d
Returns
Point3d
 EvaluatePoint(Point2d, int, ref Vector3dCollection)
public Point3d EvaluatePoint(Point2d parameter, int derivOrder, ref Vector3dCollection derivatives)
Parameters
parameter Point2d
derivOrder int
derivatives Vector3dCollection
Returns
Point3d
 EvaluatePoint(Point2d, int, ref Vector3dCollection, ref Vector3d)
public Point3d EvaluatePoint(Point2d parameter, int derivOrder, ref Vector3dCollection derivatives, ref Vector3d normal)
Parameters
parameter Point2d
derivOrder int
derivatives Vector3dCollection
normal Vector3d
Returns
Point3d
 GetClosestPointTo(Point3d)
public PointOnSurface GetClosestPointTo(Point3d point)
Parameters
point Point3d
Returns
PointOnSurface
 GetClosestPointTo(Point3d, Tolerance)
public PointOnSurface GetClosestPointTo(Point3d point, Tolerance tolerance)
Parameters
point Point3d
tolerance Tolerance
Returns
PointOnSurface
 GetEnvelope()
public Interval[] GetEnvelope()
Returns
Interval[]
 IsClosedInU()
public bool IsClosedInU()
Returns
bool
 IsClosedInU(Tolerance)
public bool IsClosedInU(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 IsClosedInV()
public bool IsClosedInV()
Returns
bool
 IsClosedInV(Tolerance)
public bool IsClosedInV(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 IsOn(Point3d, Point2d)
public bool IsOn(Point3d point, Point2d parameterPoint)
Parameters
point Point3d
parameterPoint Point2d
Returns
bool
 IsOn(Point3d, Point2d, Tolerance)
public bool IsOn(Point3d point, Point2d parameterPoint, Tolerance tolerance)
Parameters
point Point3d
parameterPoint Point2d
tolerance Tolerance
Returns
bool
 ParameterOf(Point3d)
public Point2d ParameterOf(Point3d point)
Parameters
point Point3d
Returns
Point2d
 ParameterOf(Point3d, Tolerance)
public Point2d ParameterOf(Point3d point, Tolerance tolerance)
Parameters
point Point3d
tolerance Tolerance
Returns
Point2d