Table of Contents
 Class ParameterValueSetIncrement
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbParameterValueSetIncrement")]
public class ParameterValueSetIncrement : ParameterValueSetMinMax, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
ParameterValueSet
ParameterValueSetMinMax
ParameterValueSetIncrement
Implements
IDisposable
Inherited Members
 ParameterValueSetMinMax.Maximum
 ParameterValueSetMinMax.Minimum
 ParameterValueSet.DeleteUnmanagedObject()
 ParameterValueSet.CopyFrom(RXObject)
 ParameterValueSet.ValueIsLegal(ResultBuffer)
 ParameterValueSet.GetClosestLegalValue(ResultBuffer)
 ParameterValueSet.DataType
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ParameterValueSetIncrement()
public ParameterValueSetIncrement()
 ParameterValueSetIncrement(ParameterValueSetIncrement)
public ParameterValueSetIncrement(ParameterValueSetIncrement other)
Parameters
other ParameterValueSetIncrement
Properties
 Increment
public double Increment { get; set; }
Property Value
double