Table of Contents
 Enum TextVerticalMode
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::TextVertMode")]
public enum TextVerticalMode
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
TextBase = 0
TextBottom = 1
TextTop = 3
TextVerticalMid = 2