Table of Contents
 Enum LeaderType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMLeaderStyle::LeaderType")]
public enum LeaderType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
InVisibleLeader = 0
SplineLeader = 2
StraightLeader = 1