Table of Contents
 Enum VSEdgeLinePattern
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiVisualStyleProperties::EdgeLinePattern")]
public enum VSEdgeLinePattern
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Dashed = 2
Dotted = 3
DoubleLongDash = 9
DoubleMediumDash = 8
DoubleShortDash = 7
LongDash = 6
MediumDash = 5
MediumLongDash = 10
ShortDash = 4
Solid = 1
SparseDot = 11