Table of Contents
 Enum TextAlignment
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbGeoPositionMarker::TextAlignmentType")]
public enum TextAlignment
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CenterAlignment = 1
LeftAlignment = 0
RightAlignment = 2