Table of Contents
 Enum Tiling
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiMapper::Tiling")]
public enum Tiling
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Clamp = 3
Crop = 2
InheritTiling = 0
Mirror = 4
Tile = 1