Table of Contents
 Class MentalRayRenderSettings
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMentalRayRenderSettings")]
public class MentalRayRenderSettings : RenderSettings, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
RenderSettings
MentalRayRenderSettings
Implements
IDisposable
ICloneable
Inherited Members
 RenderSettings.IsPredefined
 RenderSettings.PreviewImageFileName
 RenderSettings.ShadowsEnabled
 RenderSettings.BackFacesEnabled
 RenderSettings.TextureSampling
 RenderSettings.MaterialsEnabled
 RenderSettings.DiagnosticBackgroundEnabled
 RenderSettings.DisplayIndex
 RenderSettings.Description
 RenderSettings.Name
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 MentalRayRenderSettings()
public MentalRayRenderSettings()
 MentalRayRenderSettings(IntPtr, bool)
protected MentalRayRenderSettings(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 DiagnosticBSPMode
public DiagnosticBSPMode DiagnosticBSPMode { get; set; }
Property Value
DiagnosticBSPMode
 DiagnosticGridMode
public MentalRayRenderSettingsTraitsDiagnosticGridModeParameter DiagnosticGridMode { get; set; }
Property Value
MentalRayRenderSettingsTraitsDiagnosticGridModeParameter
 DiagnosticMode
public DiagnosticMode DiagnosticMode { get; set; }
Property Value
DiagnosticMode
 DiagnosticPhotonMode
public DiagnosticPhotonMode DiagnosticPhotonMode { get; set; }
Property Value
DiagnosticPhotonMode
 EnergyMultiplier
public float EnergyMultiplier { get; set; }
Property Value
float
 ExportMIEnabled
public bool ExportMIEnabled { get; set; }
Property Value
bool
 ExportMIFileName
public string ExportMIFileName { get; set; }
Property Value
string
 FGRayCount
public int FGRayCount { get; set; }
Property Value
int
 FGSampleRadius
public MentalRayRenderSettingsTraitsDoubleRangeParameter FGSampleRadius { get; set; }
Property Value
MentalRayRenderSettingsTraitsDoubleRangeParameter
 FGSampleRadiusState
public MentalRayRenderSettingsTraitsBoolParameter FGSampleRadiusState { get; set; }
Property Value
MentalRayRenderSettingsTraitsBoolParameter
 FinalGatheringEnabled
public bool FinalGatheringEnabled { get; set; }
Property Value
bool
 FinalGatheringMode
public FinalGatheringMode FinalGatheringMode { get; set; }
Property Value
FinalGatheringMode
 GIPhotonsPerLight
public int GIPhotonsPerLight { get; set; }
Property Value
int
 GISampleCount
public int GISampleCount { get; set; }
Property Value
int
 GISampleRadius
[UnitType(UnitType.Distance)]
public double GISampleRadius { get; set; }
Property Value
double
 GISampleRadiusEnabled
public bool GISampleRadiusEnabled { get; set; }
Property Value
bool
 GlobalIlluminationEnabled
public bool GlobalIlluminationEnabled { get; set; }
Property Value
bool
 LightLuminanceScale
public double LightLuminanceScale { get; set; }
Property Value
double
 MemoryLimit
public int MemoryLimit { get; set; }
Property Value
int
 PhotonTraceDepth
public MentalRayRenderSettingsTraitsTraceParameter PhotonTraceDepth { get; set; }
Property Value
MentalRayRenderSettingsTraitsTraceParameter
 RayTraceDepth
public MentalRayRenderSettingsTraitsTraceParameter RayTraceDepth { get; set; }
Property Value
MentalRayRenderSettingsTraitsTraceParameter
 RayTracingEnabled
public bool RayTracingEnabled { get; set; }
Property Value
bool
 Sampling
public MentalRayRenderSettingsTraitsIntegerRangeParameter Sampling { get; set; }
Property Value
MentalRayRenderSettingsTraitsIntegerRangeParameter
 SamplingContrastColor
public MentalRayRenderSettingsTraitsFloatParameter SamplingContrastColor { get; set; }
Property Value
MentalRayRenderSettingsTraitsFloatParameter
 SamplingFilter
public MentalRayRenderSettingsTraitsSamplingParameter SamplingFilter { get; set; }
Property Value
MentalRayRenderSettingsTraitsSamplingParameter
 ShadowMapsEnabled
public bool ShadowMapsEnabled { get; set; }
Property Value
bool
 ShadowMode
public ShadowMode ShadowMode { get; set; }
Property Value
ShadowMode
 ShadowSamplingMultiplier
public virtual ShadowSamplingMultiplier ShadowSamplingMultiplier { get; set; }
Property Value
ShadowSamplingMultiplier
 TileOrder
public TileOrder TileOrder { get; set; }
Property Value
TileOrder
 TileSize
public int TileSize { get; set; }
Property Value
int