Table of Contents
 Class CellRange
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class CellRange : ISubObject, IEnumerable<CellReference>, IEnumerable
Inheritance
object
CellRange
Implements
ISubObject
IEnumerable<CellReference>
IEnumerable
Derived
Cell
Column
Row
Inherited Members
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 CellRange(Table, int, int, int, int)
protected CellRange(Table table, int topRow, int leftColumn, int bottomRow, int rightColumn)
Parameters
table Table
topRow int
leftColumn int
bottomRow int
rightColumn int
Properties
 Alignment
public CellAlignment? Alignment { get; set; }
Property Value
CellAlignment?
 BackgroundColor
public Color BackgroundColor { get; set; }
Property Value
Color
 Borders
public CellBorders Borders { get; }
Property Value
CellBorders
 BottomRight
public Cell BottomRight { get; }
Property Value
Cell
 BottomRightPlusOne
public Cell BottomRightPlusOne { get; }
Property Value
Cell
 BottomRow
public int BottomRow { get; }
Property Value
int
 CanDeleteColumns
public bool CanDeleteColumns { get; }
Property Value
bool
 CanDeleteRows
public bool CanDeleteRows { get; }
Property Value
bool
 CanInsertColumn
public bool CanInsertColumn { get; }
Property Value
bool
 CanInsertRow
public bool CanInsertRow { get; }
Property Value
bool
 ContentColor
public Color ContentColor { get; set; }
Property Value
Color
 ContentLayout
public CellContentLayout? ContentLayout { get; set; }
Property Value
CellContentLayout?
 DataFormat
public string DataFormat { get; set; }
Property Value
string
 DataType
public DataTypeParameter? DataType { get; set; }
Property Value
DataTypeParameter?
 IsBackgroundColorNone
public bool? IsBackgroundColorNone { get; set; }
Property Value
bool?
 IsContentEditable
public bool? IsContentEditable { get; }
Property Value
bool?
 IsEmpty
public bool? IsEmpty { get; }
Property Value
bool?
 IsFormatEditable
public bool? IsFormatEditable { get; }
Property Value
bool?
 IsLinked
public bool? IsLinked { get; }
Property Value
bool?
 IsMergeAllEnabled
public bool? IsMergeAllEnabled { get; set; }
Property Value
bool?
 IsMerged
public bool? IsMerged { get; }
Property Value
bool?
 IsNull
public bool IsNull { get; }
Property Value
bool
 IsSingleCell
public bool IsSingleCell { get; }
Property Value
bool
 this[int, int]
public Cell this[int row, int column] { get; }
Parameters
row int
column int
Property Value
Cell
 LeftColumn
public int LeftColumn { get; }
Property Value
int
 ParentTable
public Table ParentTable { get; }
Property Value
Table
 RightColumn
public int RightColumn { get; }
Property Value
int
 State
public CellStates? State { get; set; }
Property Value
CellStates?
 Style
public string Style { get; set; }
Property Value
string
 TextHeight
public double? TextHeight { get; set; }
Property Value
double?
 TextStyleId
public ObjectId? TextStyleId { get; set; }
Property Value
ObjectId?
 TopLeft
public Cell TopLeft { get; }
Property Value
Cell
 TopRow
public int TopRow { get; }
Property Value
int
Methods
 ClearStyleOverrides()
public void ClearStyleOverrides()
 Create(Table, int, int, int, int)
public static CellRange Create(Table table, int topRow, int leftColumn, int bottomRow, int rightColumn)
Parameters
table Table
topRow int
leftColumn int
bottomRow int
rightColumn int
Returns
CellRange
 DeleteContent()
public void DeleteContent()
 Equals(object)
public override bool Equals(object pRange)
Parameters
pRange object
Returns
bool
 GetCustomData(string)
public object GetCustomData(string key)
Parameters
key string
Returns
object
 GetDataLink()
public ObjectIdCollection GetDataLink()
Returns
ObjectIdCollection
 GetEnumerator()
public virtual IEnumerator<CellReference> GetEnumerator()
Returns
IEnumerator<CellReference>
 GetHashCode()
public override int GetHashCode()
Returns
int
 GetStyleOverrides()
public TableStyleOverride[] GetStyleOverrides()
Returns
TableStyleOverride[]
 SetCustomData(string, object)
public void SetCustomData(string key, object value)
Parameters
key string
value object
 SetDataLink(ObjectId, bool)
public void SetDataLink(ObjectId dataLinkId, bool bUpdate)
Parameters
dataLinkId ObjectId
bUpdate bool
Operators
 operator ==(CellRange, CellRange)
public static bool operator ==(CellRange t1, CellRange t2)
Parameters
t1 CellRange
t2 CellRange
Returns
bool
 operator !=(CellRange, CellRange)
public static bool operator !=(CellRange t1, CellRange t2)
Parameters
t1 CellRange
t2 CellRange
Returns
bool
Explicit Interface Implementations
 IEnumerableGetEnumerator()
IEnumerator IEnumerableGetEnumerator()
Returns
IEnumerator