Table of Contents
 Class ClipBoundary
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiClipBoundary")]
public sealed class ClipBoundary : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
ClipBoundary
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ClipBoundary()
public ClipBoundary()
Properties
 BackClipZ
public double BackClipZ { get; set; }
Property Value
double
 ClippingBack
public bool ClippingBack { get; set; }
Property Value
bool
 ClippingFront
public bool ClippingFront { get; set; }
Property Value
bool
 DrawBoundary
public bool DrawBoundary { get; set; }
Property Value
bool
 FrontClipZ
public double FrontClipZ { get; set; }
Property Value
double
 NormalVector
public Vector3d NormalVector { get; set; }
Property Value
Vector3d
 Point
public Point3d Point { get; set; }
Property Value
Point3d
 TransformInverseBlockRefXForm
public Matrix3d TransformInverseBlockRefXForm { get; set; }
Property Value
Matrix3d
 TransformToClipSpace
public Matrix3d TransformToClipSpace { get; set; }
Property Value
Matrix3d
Methods
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 GetAptPoints()
public Point2dCollection GetAptPoints()
Returns
Point2dCollection
 SetAptPoints(Point2dCollection)
public void SetAptPoints(Point2dCollection point)
Parameters
point Point2dCollection