Table of Contents
 Enum PointCloudCropType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum PointCloudCropType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Circular = 3
Invalid = 0
Polygonal = 2
Rectangular = 1