Table of Contents
 Class DataCell
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDataCell")]
public sealed class DataCell : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
DataCell
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DataCell()
public DataCell()
Properties
 CellType
public CellType CellType { get; }
Property Value
CellType
 Value
public object Value { get; }
Property Value
object
Methods
 Init()
public void Init()
 SetBool(bool)
public void SetBool(bool value)
Parameters
value bool
 SetDouble(double)
public void SetDouble(double value)
Parameters
value double
 SetHardOwnershipId(ObjectId)
public void SetHardOwnershipId(ObjectId value)
Parameters
value ObjectId
 SetHardPointerId(ObjectId)
public void SetHardPointerId(ObjectId value)
Parameters
value ObjectId
 SetInteger(int)
public void SetInteger(int value)
Parameters
value int
 SetObjectId(ObjectId)
public void SetObjectId(ObjectId value)
Parameters
value ObjectId
 SetPoint(Point3d)
public void SetPoint(Point3d value)
Parameters
value Point3d
 SetSoftOwnershipId(ObjectId)
public void SetSoftOwnershipId(ObjectId value)
Parameters
value ObjectId
 SetSoftPointerId(ObjectId)
public void SetSoftPointerId(ObjectId value)
Parameters
value ObjectId
 SetString(string)
public void SetString(string value)
Parameters
value string
 SetVector(Vector3d)
public void SetVector(Vector3d value)
Parameters
value Vector3d