Table of Contents
 Class Group
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbGroup")]
public class Group : DBObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
Group
Implements
IDisposable
ICloneable
Inherited Members
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Group()
public Group()
 Group(IntPtr, bool)
protected Group(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
 Group(string, bool)
public Group(string description, bool selectable)
Parameters
description string
selectable bool
Properties
 Description
public string Description { get; set; }
Property Value
string
 IsAnonymous
public bool IsAnonymous { get; }
Property Value
bool
 IsNotAccessible
public bool IsNotAccessible { get; }
Property Value
bool
 Name
public string Name { get; set; }
Property Value
string
 NumEntities
public int NumEntities { get; }
Property Value
int
 Selectable
public bool Selectable { get; set; }
Property Value
bool
Methods
 Append(ObjectId)
public void Append(ObjectId id)
Parameters
id ObjectId
 Append(ObjectIdCollection)
public void Append(ObjectIdCollection ids)
Parameters
ids ObjectIdCollection
 Clear()
public void Clear()
 GetAllEntityIds()
public ObjectId[] GetAllEntityIds()
Returns
ObjectId[]
 GetIndex(ObjectId)
public int GetIndex(ObjectId id)
Parameters
id ObjectId
Returns
int
 Has(Entity)
public bool Has(Entity entity)
Parameters
entity Entity
Returns
bool
 InsertAt(int, ObjectId)
public void InsertAt(int index, ObjectId id)
Parameters
index int
id ObjectId
 InsertAt(int, ObjectIdCollection)
public void InsertAt(int index, ObjectIdCollection ids)
Parameters
index int
ids ObjectIdCollection
 Prepend(ObjectId)
public void Prepend(ObjectId id)
Parameters
id ObjectId
 Prepend(ObjectIdCollection)
public void Prepend(ObjectIdCollection ids)
Parameters
ids ObjectIdCollection
 Remove(ObjectId)
public void Remove(ObjectId id)
Parameters
id ObjectId
 Remove(ObjectIdCollection)
public void Remove(ObjectIdCollection ids)
Parameters
ids ObjectIdCollection
 RemoveAt(int)
public void RemoveAt(int index)
Parameters
index int
 RemoveAt(int, ObjectIdCollection)
public void RemoveAt(int index, ObjectIdCollection ids)
Parameters
index int
ids ObjectIdCollection
 Replace(ObjectId, ObjectId)
public void Replace(ObjectId oldId, ObjectId newId)
Parameters
oldId ObjectId
newId ObjectId
 Reverse()
public void Reverse()
 SetAnonymous()
public void SetAnonymous()
 SetColor(Color)
public void SetColor(Color color)
Parameters
color Color
 SetColorIndex(int)
public void SetColorIndex(int color)
Parameters
color int
 SetHighlight(bool)
public void SetHighlight(bool value)
Parameters
value bool
 SetLayer(ObjectId)
public void SetLayer(ObjectId value)
Parameters
value ObjectId
 SetLayer(string)
public void SetLayer(string value)
Parameters
value string
 SetLinetype(ObjectId)
public void SetLinetype(ObjectId value)
Parameters
value ObjectId
 SetLinetype(string)
public void SetLinetype(string value)
Parameters
value string
 SetLinetypeScale(double)
public void SetLinetypeScale(double value)
Parameters
value double
 SetVisibility(bool)
public void SetVisibility(bool value)
Parameters
value bool
 Transfer(int, int, int)
public void Transfer(int fromIndex, int toIndex, int numItems)
Parameters
fromIndex int
toIndex int
numItems int