Table of Contents
 Enum Variable.TypeFlagsInfo
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public enum Variable.TypeFlagsInfo
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Chatty = 8
DotMeansEmpty = 2
NoUndo = 4
None = 0
SpacesAllowed = 1