Table of Contents
 Class HyperLinkCollection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbHyperlinkCollection")]
public sealed class HyperLinkCollection : DisposableWrapper, IDisposable, IList, ICollection, IEnumerable
Inheritance
object
MarshalByRefObject
DisposableWrapper
HyperLinkCollection
Implements
IDisposable
IList
ICollection
IEnumerable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Count
public int Count { get; }
Property Value
int
 this[int]
public HyperLink this[int index] { get; set; }
Parameters
index int
Property Value
HyperLink
Methods
 Add(HyperLink)
public int Add(HyperLink value)
Parameters
value HyperLink
Returns
int
 Clear()
public void Clear()
 Contains(HyperLink)
public bool Contains(HyperLink value)
Parameters
value HyperLink
Returns
bool
 CopyTo(HyperLink[], int)
public void CopyTo(HyperLink[] array, int index)
Parameters
array HyperLink[]
index int
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 GetEnumerator()
public IEnumerator GetEnumerator()
Returns
IEnumerator
 IndexOf(HyperLink)
public int IndexOf(HyperLink value)
Parameters
value HyperLink
Returns
int
 Insert(int, HyperLink)
public void Insert(int index, HyperLink value)
Parameters
index int
value HyperLink
 Remove(HyperLink)
public void Remove(HyperLink value)
Parameters
value HyperLink
 RemoveAt(int)
public void RemoveAt(int index)
Parameters
index int