Table of Contents
 Enum ExtendedLightShape
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiShadowParameters::ExtendedLightShape")]
public enum ExtendedLightShape
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Cylinder = 3
Disk = 2
Linear = 0
Rectangle = 1
Sphere = 4