Table of Contents
 Class Hatch
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbHatch")]
public class Hatch : Entity, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
Entity
Hatch
Implements
IDisposable
ICloneable
Inherited Members
 Entity.SetLayerId(ObjectId, bool)
 Entity.SetPropertiesFrom(Entity)
 Entity.GetPlane()
 Entity.AddSubentityPaths(FullSubentityPath[])
 Entity.DeleteSubentityPaths(FullSubentityPath[])
 Entity.TransformSubentityPathsBy(FullSubentityPath[], Matrix3d)
 Entity.GetGripPointsAtSubentityPath(FullSubentityPath, GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.MoveGripPointsAtSubentityPaths(FullSubentityPath[], IntPtr[], Vector3d, MoveGripPointsFlags)
 Entity.GetSubentityGeometricExtents(FullSubentityPath)
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, IntPtr, Point3d, Matrix3d, ObjectId[])
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, long, Point3d, Matrix3d, int, ObjectId[])
 Entity.GetGraphicsMarkersAtSubentityPathIntPtr(FullSubentityPath)
 Entity.Highlight(FullSubentityPath, bool)
 Entity.Highlight()
 Entity.Unhighlight(FullSubentityPath, bool)
 Entity.Unhighlight()
 Entity.PushHighlight(FullSubentityPath, HighlightStyle)
 Entity.PopHighlight(FullSubentityPath)
 Entity.HighlightState(FullSubentityPath)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection, Matrix3d)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection)
 Entity.IsContentSnappable()
 Entity.GetGripPoints(GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.GetGripPoints(Point3dCollection, IntegerCollection, IntegerCollection)
 Entity.MoveGripPointsAt(GripDataCollection, Vector3d, MoveGripPointsFlags)
 Entity.MoveGripPointsAt(IntegerCollection, Vector3d)
 Entity.GetStretchPoints(Point3dCollection)
 Entity.MoveStretchPointsAt(IntegerCollection, Vector3d)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.List()
 Entity.TransformBy(Matrix3d)
 Entity.GetTransformedCopy(Matrix3d)
 Entity.GetSubentity(FullSubentityPath)
 Entity.Explode(DBObjectCollection)
 Entity.RecordGraphicsModified(bool)
 Entity.Draw()
 Entity.SaveAs(WorldDraw, SaveType)
 Entity.SetDatabaseDefaults(Database)
 Entity.SetDatabaseDefaults()
 Entity.SetDragStatus(DragStatus)
 Entity.SetGripStatus(GripStatus)
 Entity.SetSubentityGripStatus(GripStatus, FullSubentityPath)
 Entity.JoinEntity(Entity)
 Entity.JoinEntities(Entity[])
 Entity.EdgeStyleId
 Entity.FaceStyleId
 Entity.VisualStyleId
 Entity.ForceAnnoAllVisible
 Entity.BlockName
 Entity.MaterialMapper
 Entity.MaterialId
 Entity.Material
 Entity.ReceiveShadows
 Entity.CastShadows
 Entity.Hyperlinks
 Entity.CloneMeForDragging
 Entity.CompoundObjectTransform
 Entity.GeometricExtents
 Entity.Ecs
 Entity.IsPlanar
 Entity.CollisionType
 Entity.LineWeight
 Entity.Visible
 Entity.LinetypeScale
 Entity.LinetypeId
 Entity.Linetype
 Entity.LayerId
 Entity.Layer
 Entity.PlotStyleNameId
 Entity.PlotStyleName
 Entity.Transparency
 Entity.EntityColor
 Entity.ColorIndex
 Entity.Color
 Entity.BlockId
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Hatch()
public Hatch()
 Hatch(IntPtr, bool)
protected Hatch(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 Area
[UnitType(UnitType.Area)]
public double Area { get; }
Property Value
double
 Associative
public bool Associative { get; set; }
Property Value
bool
 BackgroundColor
public Color BackgroundColor { get; set; }
Property Value
Color
 Elevation
[UnitType(UnitType.Distance)]
public double Elevation { get; set; }
Property Value
double
 GradientAngle
[UnitType(UnitType.Angle)]
public double GradientAngle { get; set; }
Property Value
double
 GradientName
public string GradientName { get; }
Property Value
string
 GradientOneColorMode
public bool GradientOneColorMode { get; set; }
Property Value
bool
 GradientShift
public float GradientShift { get; set; }
Property Value
float
 GradientType
public GradientPatternType GradientType { get; }
Property Value
GradientPatternType
 HatchObjectType
public HatchObjectType HatchObjectType { get; set; }
Property Value
HatchObjectType
 HatchStyle
public HatchStyle HatchStyle { get; set; }
Property Value
HatchStyle
 IsGradient
public virtual bool IsGradient { get; }
Property Value
bool
 IsHatch
public virtual bool IsHatch { get; }
Property Value
bool
 IsSolidFill
public bool IsSolidFill { get; }
Property Value
bool
 Normal
public Vector3d Normal { get; set; }
Property Value
Vector3d
 NumberOfHatchLines
public int NumberOfHatchLines { get; }
Property Value
int
 NumberOfLoops
public int NumberOfLoops { get; }
Property Value
int
 NumberOfPatternDefinitions
public int NumberOfPatternDefinitions { get; }
Property Value
int
 Origin
public Point2d Origin { get; set; }
Property Value
Point2d
 PatternAngle
[UnitType(UnitType.Angle)]
public double PatternAngle { get; set; }
Property Value
double
 PatternDouble
public bool PatternDouble { get; set; }
Property Value
bool
 PatternName
public string PatternName { get; }
Property Value
string
 PatternScale
[UnitType(UnitType.Distance)]
public double PatternScale { get; set; }
Property Value
double
 PatternSpace
[UnitType(UnitType.Distance)]
public double PatternSpace { get; set; }
Property Value
double
 PatternType
public HatchPatternType PatternType { get; }
Property Value
HatchPatternType
 ShadeTintValue
public float ShadeTintValue { get; set; }
Property Value
float
Methods
 AppendLoop(HatchLoop)
public void AppendLoop(HatchLoop hatchLoop)
Parameters
hatchLoop HatchLoop
 AppendLoop(HatchLoopTypes, ObjectIdCollection)
public void AppendLoop(HatchLoopTypes loopType, ObjectIdCollection dbObjIds)
Parameters
loopType HatchLoopTypes
dbObjIds ObjectIdCollection
 AppendLoop(HatchLoopTypes, Curve2dCollection, IntegerCollection)
public void AppendLoop(HatchLoopTypes loopType, Curve2dCollection edgePtrCollection, IntegerCollection edgeTypeCollection)
Parameters
loopType HatchLoopTypes
edgePtrCollection Curve2dCollection
edgeTypeCollection IntegerCollection
 AppendLoop(HatchLoopTypes, Point2dCollection, DoubleCollection)
public void AppendLoop(HatchLoopTypes loopType, Point2dCollection vertexCollection, DoubleCollection bulgeCollection)
Parameters
loopType HatchLoopTypes
vertexCollection Point2dCollection
bulgeCollection DoubleCollection
 EvaluateGradientColorAt(float)
public Color EvaluateGradientColorAt(float value)
Parameters
value float
Returns
Color
 EvaluateHatch(bool)
public void EvaluateHatch(bool underEstimateNumLines)
Parameters
underEstimateNumLines bool
 GetAssociatedObjectIds()
public ObjectIdCollection GetAssociatedObjectIds()
Returns
ObjectIdCollection
 GetAssociatedObjectIdsAt(int)
public ObjectIdCollection GetAssociatedObjectIdsAt(int loopIndex)
Parameters
loopIndex int
Returns
ObjectIdCollection
 GetGradientColors()
public GradientColor[] GetGradientColors()
Returns
GradientColor[]
 GetHatchLineDataAt(int)
public Line2d GetHatchLineDataAt(int index)
Parameters
index int
Returns
Line2d
 GetHatchLinesData()
public Line2dCollection GetHatchLinesData()
Returns
Line2dCollection
 GetLoopAt(int)
public HatchLoop GetLoopAt(int loopIndex)
Parameters
loopIndex int
Returns
HatchLoop
 GetPatternDefinitionAt(int)
public PatternDefinition GetPatternDefinitionAt(int index)
Parameters
index int
Returns
PatternDefinition
 InsertLoopAt(int, HatchLoop)
public void InsertLoopAt(int loopIndex, HatchLoop hatchLoop)
Parameters
loopIndex int
hatchLoop HatchLoop
 InsertLoopAt(int, HatchLoopTypes, ObjectIdCollection)
public void InsertLoopAt(int loopIndex, HatchLoopTypes loopType, ObjectIdCollection dbObjIds)
Parameters
loopIndex int
loopType HatchLoopTypes
dbObjIds ObjectIdCollection
 LoopTypeAt(int)
public HatchLoopTypes LoopTypeAt(int loopIndex)
Parameters
loopIndex int
Returns
HatchLoopTypes
 RemoveAssociatedObjectIds()
public void RemoveAssociatedObjectIds()
 RemoveLoopAt(int)
public void RemoveLoopAt(int loopIndex)
Parameters
loopIndex int
 SetGradient(GradientPatternType, string)
public void SetGradient(GradientPatternType gradientType, string gradientName)
Parameters
gradientType GradientPatternType
gradientName string
 SetGradientColors(GradientColor[])
public void SetGradientColors(GradientColor[] value)
Parameters
value GradientColor[]
 SetHatchPattern(HatchPatternType, string)
public void SetHatchPattern(HatchPatternType patternType, string patternName)
Parameters
patternType HatchPatternType
patternName string