Table of Contents
 Enum HatchLoopTypes
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcDbHatch::HatchLoopType")]
public enum HatchLoopTypes
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Default = 0
Derived = 4
Duplicate = 256
External = 1
NotClosed = 32
Outermost = 16
Polyline = 2
SelfIntersecting = 64
TextIsland = 128
Textbox = 8