Table of Contents
 Enum ImageOrg
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiImageOrg")]
public enum ImageOrg
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ABGR = 6
ARGB = 5
BGR = 7
BGRA = 4
Bitonal = 0
Gray = 2
Palette = 1
RGB = 8
RGBA = 3