Table of Contents
 Enum DimArrowFlag
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::DimArrowFlags")]
public enum DimArrowFlag
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
FirstArrow = 0
SecondArrow = 1