Table of Contents
 Class PointCloudClassificationColorRamp
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbPointCloudClassificationColorRamp")]
public class PointCloudClassificationColorRamp : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
PointCloudClassificationColorRamp
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 PointCloudClassificationColorRamp()
public PointCloudClassificationColorRamp()
 PointCloudClassificationColorRamp(IntPtr, bool)
protected PointCloudClassificationColorRamp(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 Name
public virtual string Name { get; set; }
Property Value
string
 NumColors
public virtual int NumColors { get; }
Property Value
int
Methods
 Color(int)
public virtual EntityColor Color(int c)
Parameters
c int
Returns
EntityColor
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 SetColor(int, EntityColor)
public virtual void SetColor(int c, EntityColor color)
Parameters
c int
color EntityColor
 SetFrom(PointCloudClassificationColorRamp)
public virtual void SetFrom(PointCloudClassificationColorRamp source)
Parameters
source PointCloudClassificationColorRamp
 SetVisibility(int, bool)
public virtual void SetVisibility(int c, bool bVisible)
Parameters
c int
bVisible bool
 Visibility(int)
public virtual bool Visibility(int c)
Parameters
c int
Returns
bool