Table of Contents
 Enum LineWeight
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::LineWeight")]
[TypeConverter(typeof(LineWeightConverter))]
public enum LineWeight
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ByBlock = -2
ByLayer = -1
ByLineWeightDefault = -3
LineWeight000 = 0
LineWeight005 = 5
LineWeight009 = 9
LineWeight013 = 13
LineWeight015 = 15
LineWeight018 = 18
LineWeight020 = 20
LineWeight025 = 25
LineWeight030 = 30
LineWeight035 = 35
LineWeight040 = 40
LineWeight050 = 50
LineWeight053 = 53
LineWeight060 = 60
LineWeight070 = 70
LineWeight080 = 80
LineWeight090 = 90
LineWeight100 = 100
LineWeight106 = 106
LineWeight120 = 120
LineWeight140 = 140
LineWeight158 = 158
LineWeight200 = 200
LineWeight211 = 211