Table of Contents
 Enum TimeZone
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum TimeZone
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AbuDhabi = 4000
Adelaide = 9300
Alaska = -9000
Almaty = 6000
Arizona = -7001
Athens = 2000
AtlanticCanada = -4000
Azores = -1000
Baghdad = 3002
Bangkok = 7000
Beijing = 8000
Berlin = 1000
Bogota = -5002
Brasilia = -3000
Brisbane = 10002
BuenosAires = -3001
Cairo = 2002
CapeVerde = -1001
Caracas = -4001
Caucasus = 4001
Central = -6000
CentralAmerica = -6001
Darwin = 9301
Dhaka = 6001
EastAfrica = 3003
Eastern = -5000
EasternEurope = 2001
Ekaterinburg = 5000
Fiji = 12001
GMT = 1
Greenland = -3002
Guam = 10001
Harare = 2003
Hawaii = -10000
Helsinki = 2004
Hobart = 10003
Indiana = -5001
InternationalDateLine = -12000
Irkutsk = 8003
Islamabad = 5001
Jerusalem = 2005
Kabul = 4300
Kathmandu = 5450
Kolkata = 5300
Krasnoyarsk = 7001
Magadan = 11000
Mazatlan = -7002
MexicoCity = -6002
MidAtlantic = -2000
MidwayIsland = -11000
Monrovia = 2
Moscow = 3000
Mountain = -7000
Newfoundland = -3300
Pacific = -8000
Paris = 1001
Perth = 8004
Prague = 1002
Rangoon = 6300
Riyadh = 3001
Santiago = -4002
Sarajevo = 1003
Saskatchewan = -6003
Seoul = 9001
Singapore = 8001
SriLanka = 6002
Sydney = 10000
Taipei = 8002
Tehran = 3300
Tokyo = 9000
Tonga = 13000
UTC = 0
Vladivostock = 10004
Wellington = 12000
WestCentralAfrica = 1004
Yakutsk = 9002