Table of Contents
 Class PointOnSurface
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGePointOnSurface")]
public sealed class PointOnSurface : PointEntity3d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
PointEntity3d
PointOnSurface
Implements
IDisposable
ICloneable
Inherited Members
 PointEntity3d.GetPoint()
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.IsOn(Point3d)
 Entity3d.IsOn(Point3d, Tolerance)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 PointOnSurface()
public PointOnSurface()
 PointOnSurface(Surface, Point2d)
public PointOnSurface(Surface surf, Point2d point)
Parameters
surf Surface
point Point2d
Properties
 Parameter
public Point2d Parameter { get; set; }
Property Value
Point2d
 Surface
public Surface Surface { get; set; }
Property Value
Surface
Methods
 Create(IntPtr, bool)
public static PointOnSurface Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
PointOnSurface
 GetInverseTangentVector(Vector3d)
public Vector2d GetInverseTangentVector(Vector3d vector)
Parameters
vector Vector3d
Returns
Vector2d
 GetInverseTangentVector(Vector3d, Point2d)
public Vector2d GetInverseTangentVector(Vector3d vector, Point2d point)
Parameters
vector Vector3d
point Point2d
Returns
Vector2d
 GetInverseTangentVector(Vector3d, Surface, Point2d)
public static Vector2d GetInverseTangentVector(Vector3d vector, Surface surf, Point2d point)
Parameters
vector Vector3d
surf Surface
point Point2d
Returns
Vector2d
 GetMixedPartial()
public Vector3d GetMixedPartial()
Returns
Vector3d
 GetMixedPartial(Point2d)
public Vector3d GetMixedPartial(Point2d point)
Parameters
point Point2d
Returns
Vector3d
 GetMixedPartial(Surface, Point2d)
public static Vector3d GetMixedPartial(Surface surf, Point2d point)
Parameters
surf Surface
point Point2d
Returns
Vector3d
 GetNormal()
public Vector3d GetNormal()
Returns
Vector3d
 GetNormal(Point2d)
public Vector3d GetNormal(Point2d point)
Parameters
point Point2d
Returns
Vector3d
 GetNormal(Surface, Point2d)
public static Vector3d GetNormal(Surface surf, Point2d point)
Parameters
surf Surface
point Point2d
Returns
Vector3d
 GetPoint(Point2d)
public Point3d GetPoint(Point2d point)
Parameters
point Point2d
Returns
Point3d
 GetPoint(Surface, Point2d)
public static Point3d GetPoint(Surface surface, Point2d point)
Parameters
surface Surface
point Point2d
Returns
Point3d
 GetTangentVector(Vector2d)
public Vector3d GetTangentVector(Vector2d vector)
Parameters
vector Vector2d
Returns
Vector3d
 GetTangentVector(Vector2d, Point2d)
public Vector3d GetTangentVector(Vector2d vector, Point2d point)
Parameters
vector Vector2d
point Point2d
Returns
Vector3d
 GetTangentVector(Vector2d, Surface, Point2d)
public static Vector3d GetTangentVector(Vector2d vector, Surface vectorSurface, Point2d pointer)
Parameters
vector Vector2d
vectorSurface Surface
pointer Point2d
Returns
Vector3d
 GetUDerivative(int)
public Vector3d GetUDerivative(int order)
Parameters
order int
Returns
Vector3d
 GetUDerivative(int, Point2d)
public Vector3d GetUDerivative(int order, Point2d point)
Parameters
order int
point Point2d
Returns
Vector3d
 GetUDerivative(int, Surface, Point2d)
public static Vector3d GetUDerivative(int order, Surface surface, Point2d point)
Parameters
order int
surface Surface
point Point2d
Returns
Vector3d
 GetVDerivative(int)
public Vector3d GetVDerivative(int order)
Parameters
order int
Returns
Vector3d
 GetVDerivative(int, Point2d)
public Vector3d GetVDerivative(int order, Point2d point)
Parameters
order int
point Point2d
Returns
Vector3d
 GetVDerivative(int, Surface, Point2d)
public static Vector3d GetVDerivative(int order, Surface surface, Point2d point)
Parameters
order int
surface Surface
point Point2d
Returns
Vector3d