Table of Contents
 Class MultiModesGripPE
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMultiModesGripPE")]
public abstract class MultiModesGripPE : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
MultiModesGripPE
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 MultiModesGripPE()
public MultiModesGripPE()
Methods
 CurrentMode(Entity, GripData)
public virtual GripMode CurrentMode(Entity entity, GripData gripData)
Parameters
entity Entity
gripData GripData
Returns
GripMode
 CurrentModeId(Entity, GripData)
public virtual uint CurrentModeId(Entity entity, GripData gripData)
Parameters
entity Entity
gripData GripData
Returns
uint
 GetGripModes(Entity, GripData, GripModeCollection, ref uint)
public virtual bool GetGripModes(Entity entity, GripData gripData, GripModeCollection modes, ref uint curMode)
Parameters
entity Entity
gripData GripData
modes GripModeCollection
curMode uint
Returns
bool
 GetGripType(Entity, GripData)
public virtual MultiModesGripPE.GripType GetGripType(Entity entity, GripData gripData)
Parameters
entity Entity
gripData GripData
Returns
MultiModesGripPE.GripType
 Reset(Entity)
public virtual void Reset(Entity entity)
Parameters
entity Entity
 SetCurrentMode(Entity, GripData, uint)
public virtual bool SetCurrentMode(Entity entity, GripData gripData, uint curMode)
Parameters
entity Entity
gripData GripData
curMode uint
Returns
bool