Table of Contents
 Enum ViewStyleType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("ViewBorder::ViewStyleType")]
public enum ViewStyleType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
FromBase = 0
ShadedHiddenEdges = 4
ShadedVisibleEdges = 3
WireframeHiddenEdges = 2
WireframeVisibleEdges = 1