Table of Contents
 Struct CoordinateSystem3d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public struct CoordinateSystem3d : IFormattable
Implements
IFormattable
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 CoordinateSystem3d(Point3d, Vector3d, Vector3d)
public CoordinateSystem3d(Point3d o, Vector3d x, Vector3d y)
Parameters
o Point3d
x Vector3d
y Vector3d
Properties
 Origin
public Point3d Origin { get; }
Property Value
Point3d
 Xaxis
public Vector3d Xaxis { get; }
Property Value
Vector3d
 Yaxis
public Vector3d Yaxis { get; }
Property Value
Vector3d
 Zaxis
public Vector3d Zaxis { get; }
Property Value
Vector3d
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 IsEqualTo(CoordinateSystem3d)
public bool IsEqualTo(CoordinateSystem3d a)
Parameters
a CoordinateSystem3d
Returns
bool
 IsEqualTo(CoordinateSystem3d, Tolerance)
public bool IsEqualTo(CoordinateSystem3d a, Tolerance tolerance)
Parameters
a CoordinateSystem3d
tolerance Tolerance
Returns
bool
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
 ToString(string, IFormatProvider)
public string ToString(string format, IFormatProvider provider)
Parameters
format string
provider IFormatProvider
Returns
string
Operators
 operator ==(CoordinateSystem3d, CoordinateSystem3d)
public static bool operator ==(CoordinateSystem3d a, CoordinateSystem3d b)
Parameters
a CoordinateSystem3d
b CoordinateSystem3d
Returns
bool
 operator !=(CoordinateSystem3d, CoordinateSystem3d)
public static bool operator !=(CoordinateSystem3d a, CoordinateSystem3d b)
Parameters
a CoordinateSystem3d
b CoordinateSystem3d
Returns
bool