Table of Contents
 Class AssocGeomDependency
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocGeomDependency")]
public class AssocGeomDependency : AssocDependency, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
AssocDependency
AssocGeomDependency
Implements
IDisposable
ICloneable
Inherited Members
 AssocDependency.SetStatus(AssocStatus, bool)
 AssocDependency.AttachToObject(CompoundObjectId)
 AssocDependency.DetachFromObject()
 AssocDependency.UpdateDependentOnObject()
 AssocDependency.SetDependentOnObject(CompoundObjectId)
 AssocDependency.GetFirstDependencyOnObject(DBObject)
 AssocDependency.GetDependenciesOnObject(DBObject, bool, bool)
 AssocDependency.NotifyDependenciesOnObject(DBObject, AssocStatus)
 AssocDependency.IsDependentOnTheSameThingAs(AssocDependency)
 AssocDependency.IsEqualTo(AssocDependency)
 AssocDependency.Evaluate()
 AssocDependency.CurrentEvaluationCallback
 AssocDependency.IsActionEvaluationInProgress
 AssocDependency.IsDependentOnObjectReadOnly
 AssocDependency.IsRelevantChange
 AssocDependency.HasCachedValue
 AssocDependency.IsDelegatingToOwningAction
 AssocDependency.DependentOnObjectStatus
 AssocDependency.IsAttachedToObject
 AssocDependency.NextDependencyOnObject
 AssocDependency.PrevDependencyOnObject
 AssocDependency.IsDependentOnCompoundObject
 AssocDependency.DependentOnCompoundObject
 AssocDependency.DependentOnObject
 AssocDependency.OwningAction
 AssocDependency.Order
 AssocDependency.IsObjectStateDependent
 AssocDependency.IsWriteDependency
 AssocDependency.IsReadDependency
 AssocDependency.Status
 AssocDependency.DependencyBody
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocGeomDependency()
public AssocGeomDependency()
 AssocGeomDependency(IntPtr, bool)
protected AssocGeomDependency(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 EdgeSubentityGeometry
public Curve3d[] EdgeSubentityGeometry { get; set; }
Property Value
Curve3d[]
 FaceSubentityGeometry
public Surface[] FaceSubentityGeometry { get; set; }
Property Value
Surface[]
 IsCachingSubentityGeometry
public bool IsCachingSubentityGeometry { get; set; }
Property Value
bool
 PersistentSubentId
public AssocPersSubentityId PersistentSubentId { get; }
Property Value
AssocPersSubentityId
 Subentity
public SubentityId Subentity { set; }
Property Value
SubentityId
 SubentityType
public uint SubentityType { get; }
Property Value
uint
 TransientSubentCount
public int TransientSubentCount { get; }
Property Value
int
 TransientSubentIds
public SubentityId[] TransientSubentIds { get; }
Property Value
SubentityId[]
 VertexSubentityGeometry
public Point3d[] VertexSubentityGeometry { get; set; }
Property Value
Point3d[]
Methods
 DependentOnObjectMirrored()
public void DependentOnObjectMirrored()
 RedirectToAnotherSubentity(ObjectId, SubentityId, ObjectId, SubentityId)
public static void RedirectToAnotherSubentity(ObjectId oldObjectId, SubentityId oldSubentId, ObjectId newObjectId, SubentityId newSubentId)
Parameters
oldObjectId ObjectId
oldSubentId SubentityId
newObjectId ObjectId
newSubentId SubentityId