Table of Contents
 Class CurveCurveIntersector3d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeCurveCurveInt3d")]
public sealed class CurveCurveIntersector3d : Entity3d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
CurveCurveIntersector3d
Implements
IDisposable
ICloneable
Inherited Members
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.IsOn(Point3d)
 Entity3d.IsOn(Point3d, Tolerance)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 CurveCurveIntersector3d()
public CurveCurveIntersector3d()
 CurveCurveIntersector3d(Curve3d, Curve3d, Interval, Interval, Vector3d)
public CurveCurveIntersector3d(Curve3d curve1, Curve3d curve2, Interval range1, Interval range2, Vector3d planeNormal)
Parameters
curve1 Curve3d
curve2 Curve3d
range1 Interval
range2 Interval
planeNormal Vector3d
 CurveCurveIntersector3d(Curve3d, Curve3d, Interval, Interval, Vector3d, Tolerance)
public CurveCurveIntersector3d(Curve3d curve1, Curve3d curve2, Interval range1, Interval range2, Vector3d planeNormal, Tolerance tolerance)
Parameters
curve1 Curve3d
curve2 Curve3d
range1 Interval
range2 Interval
planeNormal Vector3d
tolerance Tolerance
 CurveCurveIntersector3d(Curve3d, Curve3d, Vector3d)
public CurveCurveIntersector3d(Curve3d curve1, Curve3d curve2, Vector3d planeNormal)
Parameters
curve1 Curve3d
curve2 Curve3d
planeNormal Vector3d
 CurveCurveIntersector3d(Curve3d, Curve3d, Vector3d, Tolerance)
public CurveCurveIntersector3d(Curve3d curve1, Curve3d curve2, Vector3d planeNormal, Tolerance tolerance)
Parameters
curve1 Curve3d
curve2 Curve3d
planeNormal Vector3d
tolerance Tolerance
Properties
 Curve1
public Curve3d Curve1 { get; }
Property Value
Curve3d
 Curve2
public Curve3d Curve2 { get; }
Property Value
Curve3d
 NumberOfIntersectionPoints
public int NumberOfIntersectionPoints { get; }
Property Value
int
 PlaneNormal
public Vector3d PlaneNormal { get; }
Property Value
Vector3d
 Tolerance
public Tolerance Tolerance { get; }
Property Value
Tolerance
Methods
 ChangeCurveOrder()
public void ChangeCurveOrder()
 Create(IntPtr, bool)
public static CurveCurveIntersector3d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
CurveCurveIntersector3d
 GetIntersectionParameters(int)
public double[] GetIntersectionParameters(int intersection)
Parameters
intersection int
Returns
double[]
 GetIntersectionPoint(int)
public Point3d GetIntersectionPoint(int intersection)
Parameters
intersection int
Returns
Point3d
 GetIntersectionPointTolerance(int)
public double GetIntersectionPointTolerance(int intersection)
Parameters
intersection int
Returns
double
 GetIntersectionRanges()
public Interval[] GetIntersectionRanges()
Returns
Interval[]
 GetOverlapRanges(int)
public Interval[] GetOverlapRanges(int overlap)
Parameters
overlap int
Returns
Interval[]
 GetPointOnCurve1(int)
public PointOnCurve3d GetPointOnCurve1(int intersection)
Parameters
intersection int
Returns
PointOnCurve3d
 GetPointOnCurve2(int)
public PointOnCurve3d GetPointOnCurve2(int intersection)
Parameters
intersection int
Returns
PointOnCurve3d
 IsTangential(int)
public bool IsTangential(int intersection)
Parameters
intersection int
Returns
bool
 IsTransversal(int)
public bool IsTransversal(int intersection)
Parameters
intersection int
Returns
bool
 OrderWithRegardsTo1()
public void OrderWithRegardsTo1()
 OrderWithRegardsTo2()
public void OrderWithRegardsTo2()
 OverlapCount()
public int OverlapCount()
Returns
int
 OverlapDirection()
public bool OverlapDirection()
Returns
bool
 Set(Curve3d, Curve3d, Interval, Interval, Vector3d)
public void Set(Curve3d curve1, Curve3d curve2, Interval range1, Interval range2, Vector3d planeNormal)
Parameters
curve1 Curve3d
curve2 Curve3d
range1 Interval
range2 Interval
planeNormal Vector3d
 Set(Curve3d, Curve3d, Interval, Interval, Vector3d, Tolerance)
public void Set(Curve3d curve1, Curve3d curve2, Interval range1, Interval range2, Vector3d planeNormal, Tolerance tolerance)
Parameters
curve1 Curve3d
curve2 Curve3d
range1 Interval
range2 Interval
planeNormal Vector3d
tolerance Tolerance
 Set(Curve3d, Curve3d, Vector3d)
public void Set(Curve3d curve1, Curve3d curve2, Vector3d planeNormal)
Parameters
curve1 Curve3d
curve2 Curve3d
planeNormal Vector3d
 Set(Curve3d, Curve3d, Vector3d, Tolerance)
public void Set(Curve3d curve1, Curve3d curve2, Vector3d planeNormal, Tolerance tolerance)
Parameters
curve1 Curve3d
curve2 Curve3d
planeNormal Vector3d
tolerance Tolerance