Table of Contents
 Class DisposableWrapper
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public abstract class DisposableWrapper : MarshalByRefObject, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Implements
IDisposable
Derived
Color
AuditInfo
BlendOptions
BlockPropertiesTable.AuditError
BlockTableRecordEnumerator
CustomObjectSnapMode
DBObjectCollection
DataCellCollection
DbHomeView
DynamicBlockReferencePropertyCollection
DynamicDimensionData
DynamicDimensionDataCollection
FileDependencyManager
FilteredBlockIterator
IndexUpdateData
GeoCoordinateCategory
GeoCoordinateSystem
GeoCoordinateTransformer
Graph
GraphNode
GraphNodeCollection
GripData
GripDataCollection
GripMode
GripModeCollection
HyperLink
HyperLinkCollection
LoftOptions
MTextFragment
ObjectIdCollection
ParameterValueSet
PlotSettingsValidator
PointCloudClassificationColorRamp
PointCloudColorRamp
ResultBuffer
RevolveOptions
SurfaceTrimInfo
SweepOptions
SymbolTableEnumerator
TableEnumerator
TextEditor
TextEditorColumn
TextEditorColumns
TextEditorLocation
TextEditorParagraph
TextEditorSelectionbase
TextEditorWipeout
UnderlayFile
UnderlayItem
UnderlayLayer
Curve2dCollection
Curve3dCollection
CurveBoundary
Entity2d
Entity3d
Interval
KnotCollection
Point3dCollection
ClipBoundary
HatchPatternDefinition
ImageBGRA32
LinetypeCollection
Polyline
PolylineCollection
TransientManager
Configuration
Device
GraphicsKernel
KernelDescriptor
Model
Node
View
PointCloudExtractor
ProfileCurve2d
ProgressMeter
RXObject
Variable
Variable.RangeInfo
Variables
UniqueString
Inherited Members
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DisposableWrapper()
protected DisposableWrapper()
 DisposableWrapper(IntPtr, bool)
protected DisposableWrapper(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 AutoDelete
public bool AutoDelete { get; }
Property Value
bool
 IsDisposed
public bool IsDisposed { get; }
Property Value
bool
 UnmanagedObject
public IntPtr UnmanagedObject { get; }
Property Value
IntPtr
Methods
 Create(Type, IntPtr, bool)
public static DisposableWrapper Create(Type type, IntPtr unmanagedPointer, bool autoDelete)
Parameters
type Type
unmanagedPointer IntPtr
autoDelete bool
Returns
DisposableWrapper
 DeleteUnmanagedObject()
protected abstract void DeleteUnmanagedObject()
 Dispose()
public override sealed void Dispose()
 Dispose(bool)
[HandleProcessCorruptedStateExceptions]
protected virtual void Dispose(bool A_0)
Parameters
A_0 bool
 Equals(object)
public override bool Equals(object obj)
Parameters
obj object
Returns
bool
 ~DisposableWrapper()
protected ~DisposableWrapper()
 GetHashCode()
public override int GetHashCode()
Returns
int
Operators
 operator ==(DisposableWrapper, DisposableWrapper)
public static bool operator ==(DisposableWrapper a, DisposableWrapper b)
Parameters
a DisposableWrapper
b DisposableWrapper
Returns
bool
 operator !=(DisposableWrapper, DisposableWrapper)
public static bool operator !=(DisposableWrapper a, DisposableWrapper b)
Parameters
a DisposableWrapper
b DisposableWrapper
Returns
bool