Table of Contents
 Enum HatchEdgeType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbHatch::HatchEdgeType")]
public enum HatchEdgeType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CircularArc = 2
EllipticalArc = 3
Line = 1
Spline = 4