Table of Contents
 Class LayerStateManager
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbLayerStateManager")]
public sealed class LayerStateManager : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
LayerStateManager
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 LayerStateManager(Database)
public LayerStateManager(Database database)
Parameters
database Database
Properties
 LastRestoredLayerState
public string LastRestoredLayerState { get; }
Property Value
string
Methods
 CompareLayerStateToDb(string, ObjectId)
public bool CompareLayerStateToDb(string name, ObjectId idVp)
Parameters
name string
idVp ObjectId
Returns
bool
 DeleteLayerState(string)
public void DeleteLayerState(string name)
Parameters
name string
 ExportLayerState(string, string)
public void ExportLayerState(string nameToExport, string fileName)
Parameters
nameToExport string
fileName string
 GetLayerStateDescription(string)
public string GetLayerStateDescription(string name)
Parameters
name string
Returns
string
 GetLayerStateLayers(string, bool)
public ArrayList GetLayerStateLayers(string name, bool bInvert)
Parameters
name string
bInvert bool
Returns
ArrayList
 GetLayerStateMask(string)
public LayerStateMasks GetLayerStateMask(string name)
Parameters
name string
Returns
LayerStateMasks
 GetLayerStateNames(bool, bool)
public ArrayList GetLayerStateNames(bool bIncludeHidden, bool bIncludeXref)
Parameters
bIncludeHidden bool
bIncludeXref bool
Returns
ArrayList
 HasLayerState(string)
public bool HasLayerState(string name)
Parameters
name string
Returns
bool
 ImportLayerState(string)
public void ImportLayerState(string fileName)
Parameters
fileName string
 ImportLayerStateFromDb(string, Database)
public void ImportLayerStateFromDb(string name, Database database)
Parameters
name string
database Database
 LayerStateHasViewportData(string)
public bool LayerStateHasViewportData(string name)
Parameters
name string
Returns
bool
 LayerStatesDictionaryId(bool)
public ObjectId LayerStatesDictionaryId(bool createIfNotPresent)
Parameters
createIfNotPresent bool
Returns
ObjectId
 RenameLayerState(string, string)
public void RenameLayerState(string name, string newName)
Parameters
name string
newName string
 RestoreLayerState(string, ObjectId, int, LayerStateMasks)
public void RestoreLayerState(string name, ObjectId id, int undefinedLayerStatePolicy, LayerStateMasks clientMask)
Parameters
name string
id ObjectId
undefinedLayerStatePolicy int
clientMask LayerStateMasks
 SaveLayerState(string, LayerStateMasks, ObjectId)
public void SaveLayerState(string name, LayerStateMasks mask, ObjectId id)
Parameters
name string
mask LayerStateMasks
id ObjectId
 SetLayerStateDescription(string, string)
public void SetLayerStateDescription(string name, string description)
Parameters
name string
description string
 SetLayerStateMask(string, LayerStateMasks)
public void SetLayerStateMask(string name, LayerStateMasks mask)
Parameters
name string
mask LayerStateMasks
Events
 AbortLayerStateDelete
public event LayerStateEventHandler AbortLayerStateDelete
Event Type
LayerStateEventHandler
 AbortLayerStateRename
public event LayerStateRenameEventHandler AbortLayerStateRename
Event Type
LayerStateRenameEventHandler
 AbortLayerStateRestore
public event LayerStateEventHandler AbortLayerStateRestore
Event Type
LayerStateEventHandler
 LayerStateCompareFailed
public event LayerStateEventHandler LayerStateCompareFailed
Event Type
LayerStateEventHandler
 LayerStateCreated
public event LayerStateEventHandler LayerStateCreated
Event Type
LayerStateEventHandler
 LayerStateDeleted
public event LayerStateDeletedEventHandler LayerStateDeleted
Event Type
LayerStateDeletedEventHandler
 LayerStateRenamed
public event LayerStateRenameEventHandler LayerStateRenamed
Event Type
LayerStateRenameEventHandler
 LayerStateRestored
public event LayerStateEventHandler LayerStateRestored
Event Type
LayerStateEventHandler
 LayerStateToBeDeleted
public event LayerStateEventHandler LayerStateToBeDeleted
Event Type
LayerStateEventHandler
 LayerStateToBeRenamed
public event LayerStateRenameEventHandler LayerStateToBeRenamed
Event Type
LayerStateRenameEventHandler
 LayerStateToBeRestored
public event LayerStateEventHandler LayerStateToBeRestored
Event Type
LayerStateEventHandler