Table of Contents
 Class ObjectOverrule
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbObjectOverrule")]
public abstract class ObjectOverrule : Overrule, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Overrule
ObjectOverrule
Implements
IDisposable
ICloneable
Inherited Members
 Overrule.AddOverrule(RXClass, Overrule, bool)
 Overrule.RemoveOverrule(RXClass, Overrule)
 Overrule.HasOverrule(RXObject, RXClass)
 Overrule.IsApplicable(RXObject)
 Overrule.Overruling
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ObjectOverrule()
protected ObjectOverrule()
Methods
 Cancel(DBObject)
public virtual void Cancel(DBObject dbObject)
Parameters
dbObject DBObject
 Close(DBObject)
public virtual void Close(DBObject dbObject)
Parameters
dbObject DBObject
 DeepClone(DBObject, DBObject, IdMapping, bool)
public virtual DBObject DeepClone(DBObject dbObject, DBObject ownerObject, IdMapping idMap, bool isPrimary)
Parameters
dbObject DBObject
ownerObject DBObject
idMap IdMapping
isPrimary bool
Returns
DBObject
 Erase(DBObject, bool)
public virtual void Erase(DBObject dbObject, bool erasing)
Parameters
dbObject DBObject
erasing bool
 Open(DBObject, OpenMode)
public virtual void Open(DBObject dbObject, OpenMode mode)
Parameters
dbObject DBObject
mode OpenMode
 SetCustomFilter()
public override sealed void SetCustomFilter()
 SetExtensionDictionaryEntryFilter(string)
public override sealed void SetExtensionDictionaryEntryFilter(string entryName)
Parameters
entryName string
 SetIdFilter(ObjectId[])
public override sealed void SetIdFilter(ObjectId[] ids)
Parameters
ids ObjectId[]
 SetNoFilter()
public override sealed void SetNoFilter()
 SetXDataFilter(string)
public override sealed void SetXDataFilter(string registeredApplicationName)
Parameters
registeredApplicationName string
 WblockClone(DBObject, RXObject, IdMapping, bool)
public virtual DBObject WblockClone(DBObject dbObject, RXObject ownerObject, IdMapping idMap, bool isPrimary)
Parameters
dbObject DBObject
ownerObject RXObject
idMap IdMapping
isPrimary bool
Returns
DBObject