Table of Contents
 Class XrefGraphNode
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbXrefGraphNode")]
public class XrefGraphNode : GraphNode, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
GraphNode
XrefGraphNode
Implements
IDisposable
Inherited Members
 GraphNode.Create(IntPtr, bool)
 GraphNode.In(int)
 GraphNode.Out(int)
 GraphNode.CycleIn(int)
 GraphNode.CycleOut(int)
 GraphNode.AddRefTo(GraphNode)
 GraphNode.RemoveRefTo(GraphNode)
 GraphNode.DisconnectAll()
 GraphNode.IsMarkedAs(int)
 GraphNode.MarkAs(byte)
 GraphNode.Clear(byte)
 GraphNode.MarkTree(byte, GraphNodeCollection)
 GraphNode.SetEdgeGrowthRate(int, int)
 GraphNode.DeleteUnmanagedObject()
 GraphNode.IsCycleNode
 GraphNode.NumCycleIn
 GraphNode.NumCycleOut
 GraphNode.Owner
 GraphNode.NextCycleNode
 GraphNode.NumIn
 GraphNode.NumOut
 GraphNode.Data
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 XrefGraphNode(IntPtr, bool)
protected XrefGraphNode(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 BlockTableRecordId
public ObjectId BlockTableRecordId { get; }
Property Value
ObjectId
 Database
public Database Database { get; }
Property Value
Database
 IsNested
public bool IsNested { get; }
Property Value
bool
 Name
public string Name { get; }
Property Value
string
 XrefNotificationStatus
public XrefNotificationStatus XrefNotificationStatus { get; }
Property Value
XrefNotificationStatus
 XrefStatus
public XrefStatus XrefStatus { get; }
Property Value
XrefStatus