Table of Contents
 Enum GradientPatternType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbHatch::GradientPatternType")]
public enum GradientPatternType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
PreDefinedGradient = 0
UserDefinedGradient = 1