Table of Contents
 Enum ProceduralTextureType
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiProceduralTexture::Type")]
public enum ProceduralTextureType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Generic = 2
Marble = 1
Wood = 0