Table of Contents
 Struct Scale3d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeScale3d")]
public struct Scale3d
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 Scale3d(double)
public Scale3d(double factor)
Parameters
factor double
 Scale3d(double, double, double)
public Scale3d(double x, double y, double z)
Parameters
x double
y double
z double
 Scale3d(double[])
public Scale3d(double[] xyz)
Parameters
xyz double[]
Properties
 this[int]
public double this[int i] { get; }
Parameters
i int
Property Value
double
 X
public double X { get; }
Property Value
double
 Y
public double Y { get; }
Property Value
double
 Z
public double Z { get; }
Property Value
double
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 ExtractScale(Matrix3d)
public static Scale3d ExtractScale(Matrix3d mat)
Parameters
mat Matrix3d
Returns
Scale3d
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 GetMatrix()
public Matrix3d GetMatrix()
Returns
Matrix3d
 Inverse()
public Scale3d Inverse()
Returns
Scale3d
 IsEqualTo(Scale3d)
public bool IsEqualTo(Scale3d scaleVector)
Parameters
scaleVector Scale3d
Returns
bool
 IsEqualTo(Scale3d, Tolerance)
public bool IsEqualTo(Scale3d scaleVector, Tolerance tolerance)
Parameters
scaleVector Scale3d
tolerance Tolerance
Returns
bool
 IsProportional()
public bool IsProportional()
Returns
bool
 IsProportional(Tolerance)
public bool IsProportional(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 MultiplyBy(double)
public Scale3d MultiplyBy(double s)
Parameters
s double
Returns
Scale3d
 PostMultiplyBy(Scale3d)
public Scale3d PostMultiplyBy(Scale3d rightSide)
Parameters
rightSide Scale3d
Returns
Scale3d
 PreMultiplyBy(Scale3d)
public Scale3d PreMultiplyBy(Scale3d leftSide)
Parameters
leftSide Scale3d
Returns
Scale3d
 RemoveScale(Matrix3d)
public static Scale3d RemoveScale(Matrix3d mat)
Parameters
mat Matrix3d
Returns
Scale3d
 ToArray()
public double[] ToArray()
Returns
double[]
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
Operators
 operator ==(Scale3d, Scale3d)
public static bool operator ==(Scale3d a, Scale3d b)
Parameters
a Scale3d
b Scale3d
Returns
bool
 operator !=(Scale3d, Scale3d)
public static bool operator !=(Scale3d a, Scale3d b)
Parameters
a Scale3d
b Scale3d
Returns
bool
 operator *(Scale3d, Scale3d)
public static Scale3d operator *(Scale3d a, Scale3d b)
Parameters
a Scale3d
b Scale3d
Returns
Scale3d
 operator *(Scale3d, double)
public static Scale3d operator *(Scale3d a, double factor)
Parameters
a Scale3d
factor double
Returns
Scale3d
 operator *(double, Scale3d)
public static Scale3d operator *(double factor, Scale3d a)
Parameters
factor double
a Scale3d
Returns
Scale3d