Table of Contents
 Class Viewport
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiViewport")]
public abstract class Viewport : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Viewport
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Viewport()
protected Viewport()
 Viewport(IntPtr, bool)
protected Viewport(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 AcadWindowId
public abstract int AcadWindowId { get; }
Property Value
int
 CameraLocation
public abstract Point3d CameraLocation { get; }
Property Value
Point3d
 CameraTarget
public abstract Point3d CameraTarget { get; }
Property Value
Point3d
 CameraUpVector
public abstract Vector3d CameraUpVector { get; }
Property Value
Vector3d
 DeviceContextViewportCorners
public abstract Extents2d DeviceContextViewportCorners { get; }
Property Value
Extents2d
 EyeToModelTransform
public abstract Matrix3d EyeToModelTransform { get; }
Property Value
Matrix3d
 EyeToWorldTransform
public abstract Matrix3d EyeToWorldTransform { get; }
Property Value
Matrix3d
 FrontAndBackClipping
public abstract FrontAndBackClipping FrontAndBackClipping { get; }
Property Value
FrontAndBackClipping
 IsPerspective
public abstract bool IsPerspective { get; }
Property Value
bool
 LinetypeGenerationCriteria
public abstract double LinetypeGenerationCriteria { get; }
Property Value
double
 LinetypeScaleMultiplier
public abstract double LinetypeScaleMultiplier { get; }
Property Value
double
 ModelToEyeTransform
public abstract Matrix3d ModelToEyeTransform { get; }
Property Value
Matrix3d
 ViewDirection
public virtual Vector3d ViewDirection { get; }
Property Value
Vector3d
 ViewportId
public abstract IntPtr ViewportId { get; }
Property Value
IntPtr
 WorldToEyeTransform
public abstract Matrix3d WorldToEyeTransform { get; }
Property Value
Matrix3d
Methods
 DoInversePerspective(Point3d)
public abstract Point3d DoInversePerspective(Point3d value)
Parameters
value Point3d
Returns
Point3d
 DoPerspective(Point3d)
public abstract Point3d DoPerspective(Point3d value)
Parameters
value Point3d
Returns
Point3d
 GetNumPixelsInUnitSquare(Point3d)
public abstract Point2d GetNumPixelsInUnitSquare(Point3d givenWorldPoint)
Parameters
givenWorldPoint Point3d
Returns
Point2d
 LayerVisible(ObjectId)
public virtual bool LayerVisible(ObjectId idLayer)
Parameters
idLayer ObjectId
Returns
bool