Table of Contents
 Enum RotationAngle
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::RotationAngle")]
public enum RotationAngle
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Degrees000 = 0
Degrees090 = 1
Degrees180 = 2
Degrees270 = 3
DegreesUnknown = -1