Table of Contents
 Class RevolveOptionsBuilder
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class RevolveOptionsBuilder
Inheritance
object
RevolveOptionsBuilder
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 RevolveOptionsBuilder()
public RevolveOptionsBuilder()
 RevolveOptionsBuilder(RevolveOptions)
public RevolveOptionsBuilder(RevolveOptions value)
Parameters
value RevolveOptions
Properties
 CloseToAxis
public bool CloseToAxis { get; set; }
Property Value
bool
 DraftAngle
[UnitType(UnitType.Angle)]
public double DraftAngle { get; set; }
Property Value
double
 TwistAngle
[UnitType(UnitType.Angle)]
public double TwistAngle { get; set; }
Property Value
double
Methods
 ToRevolveOptions()
public RevolveOptions ToRevolveOptions()
Returns
RevolveOptions