Table of Contents
 Enum ShadowFlags
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcGiSubEntityTraits::ShadowFlags")]
public enum ShadowFlags
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ShadowsCastAndReceive = 0
ShadowsDoesNotCast = 1
ShadowsDoesNotReceive = 2
ShadowsIgnore = ShadowsDoesNotCast | ShadowsDoesNotReceive