Table of Contents
 Class CircularArc3d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeCircArc3d")]
public sealed class CircularArc3d : Curve3d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
Curve3d
CircularArc3d
Implements
IDisposable
ICloneable
Inherited Members
 Curve3d.GetInterval()
 Curve3d.SetInterval(Interval)
 Curve3d.GetReverseParameterCurve()
 Curve3d.GetDistanceTo(Curve3d)
 Curve3d.GetDistanceTo(Curve3d, Tolerance)
 Curve3d.GetDistanceTo(Point3d)
 Curve3d.GetDistanceTo(Point3d, Tolerance)
 Curve3d.GetClosestPointTo(Curve3d)
 Curve3d.GetClosestPointTo(Curve3d, Tolerance)
 Curve3d.GetClosestPointTo(Point3d)
 Curve3d.GetClosestPointTo(Point3d, Tolerance)
 Curve3d.GetProjectedClosestPointTo(Curve3d, Vector3d)
 Curve3d.GetProjectedClosestPointTo(Curve3d, Vector3d, Tolerance)
 Curve3d.GetProjectedClosestPointTo(Point3d, Vector3d)
 Curve3d.GetProjectedClosestPointTo(Point3d, Vector3d, Tolerance)
 Curve3d.GetNormalPoint(Point3d)
 Curve3d.GetNormalPoint(Point3d, Tolerance)
 Curve3d.GetBoundBlockOf(Interval)
 Curve3d.GetOrthoBoundBlockOf(Interval)
 Curve3d.GetProjectedEntity(Plane, Vector3d)
 Curve3d.GetProjectedEntity(Plane, Vector3d, Tolerance)
 Curve3d.GetOrthoProjectEntity(Plane)
 Curve3d.GetOrthoProjectEntity(Plane, Tolerance)
 Curve3d.IsOn(double)
 Curve3d.IsOn(double, Tolerance)
 Curve3d.IsOn(Point3d, out double)
 Curve3d.IsOn(Point3d, out double, Tolerance)
 Curve3d.IsOn(Point3d)
 Curve3d.IsOn(Point3d, Tolerance)
 Curve3d.GetParameterOf(Point3d)
 Curve3d.GetParameterOf(Point3d, Tolerance)
 Curve3d.GetTrimmedOffset(double, Vector3d, OffsetCurveExtensionType)
 Curve3d.GetTrimmedOffset(double, Vector3d, OffsetCurveExtensionType, Tolerance)
 Curve3d.IsClosed()
 Curve3d.IsClosed(Tolerance)
 Curve3d.IsPlanar(out Plane)
 Curve3d.IsPlanar(out Plane, Tolerance)
 Curve3d.IsLinear(out Line3d)
 Curve3d.IsLinear(out Line3d, Tolerance)
 Curve3d.IsCoplanarWith(Curve3d, out Plane)
 Curve3d.IsCoplanarWith(Curve3d, out Plane, Tolerance)
 Curve3d.IsPeriodic(out double)
 Curve3d.IsDegenerate(out Entity3d)
 Curve3d.IsDegenerate(out Entity3d, Tolerance)
 Curve3d.GetLength(double, double, double)
 Curve3d.GetParameterAtLength(double, double, bool, double)
 Curve3d.GetArea(double, double)
 Curve3d.GetArea(double, double, Tolerance)
 Curve3d.GetSplitCurves(double)
 Curve3d.Explode(Interval)
 Curve3d.EvaluatePoint(double)
 Curve3d.GetSamplePoints(int)
 Curve3d.GetSamplePoints(double, double, double)
 Curve3d.GetNewSamplePoints(double, double, double)
 Curve3d.HasEndPoint
 Curve3d.HasStartPoint
 Curve3d.OrthoBoundBlock
 Curve3d.BoundBlock
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 CircularArc3d()
public CircularArc3d()
 CircularArc3d(Point3d, Point3d, Point3d)
public CircularArc3d(Point3d startPoint, Point3d pointOnArc, Point3d endPoint)
Parameters
startPoint Point3d
pointOnArc Point3d
endPoint Point3d
 CircularArc3d(Point3d, Vector3d, Vector3d, double, double, double)
public CircularArc3d(Point3d center, Vector3d normal, Vector3d referenceVector, double radius, double startAngle, double endAngle)
Parameters
center Point3d
normal Vector3d
referenceVector Vector3d
radius double
startAngle double
endAngle double
 CircularArc3d(Point3d, Vector3d, double)
public CircularArc3d(Point3d center, Vector3d normal, double radius)
Parameters
center Point3d
normal Vector3d
radius double
Properties
 Center
public Point3d Center { get; set; }
Property Value
Point3d
 EndAngle
public double EndAngle { get; }
Property Value
double
 EndPoint
public Point3d EndPoint { get; }
Property Value
Point3d
 Normal
public Vector3d Normal { get; }
Property Value
Vector3d
 Radius
public double Radius { get; set; }
Property Value
double
 ReferenceVector
public Vector3d ReferenceVector { get; }
Property Value
Vector3d
 StartAngle
public double StartAngle { get; }
Property Value
double
 StartPoint
public Point3d StartPoint { get; }
Property Value
Point3d
Methods
 ClosestPointToPlane(PlanarEntity)
public Point3d[] ClosestPointToPlane(PlanarEntity plane)
Parameters
plane PlanarEntity
Returns
Point3d[]
 ClosestPointToPlane(PlanarEntity, Tolerance)
public Point3d[] ClosestPointToPlane(PlanarEntity plane, Tolerance tolerance)
Parameters
plane PlanarEntity
tolerance Tolerance
Returns
Point3d[]
 Create(IntPtr, bool)
public static CircularArc3d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
CircularArc3d
 GetPlane()
public Plane GetPlane()
Returns
Plane
 GetTangent(Point3d)
public Line3d GetTangent(Point3d pointValue)
Parameters
pointValue Point3d
Returns
Line3d
 GetTangent(Point3d, Tolerance)
public Line3d GetTangent(Point3d pointValue, Tolerance tolerance)
Parameters
pointValue Point3d
tolerance Tolerance
Returns
Line3d
 IntersectWith(CircularArc3d)
public Point3d[] IntersectWith(CircularArc3d arc)
Parameters
arc CircularArc3d
Returns
Point3d[]
 IntersectWith(CircularArc3d, Tolerance)
public Point3d[] IntersectWith(CircularArc3d arc, Tolerance tolerance)
Parameters
arc CircularArc3d
tolerance Tolerance
Returns
Point3d[]
 IntersectWith(LinearEntity3d)
public Point3d[] IntersectWith(LinearEntity3d line)
Parameters
line LinearEntity3d
Returns
Point3d[]
 IntersectWith(LinearEntity3d, Tolerance)
public Point3d[] IntersectWith(LinearEntity3d line, Tolerance tolerance)
Parameters
line LinearEntity3d
tolerance Tolerance
Returns
Point3d[]
 IntersectWith(PlanarEntity)
public Point3d[] IntersectWith(PlanarEntity plane)
Parameters
plane PlanarEntity
Returns
Point3d[]
 IntersectWith(PlanarEntity, Tolerance)
public Point3d[] IntersectWith(PlanarEntity plane, Tolerance tolerance)
Parameters
plane PlanarEntity
tolerance Tolerance
Returns
Point3d[]
 IsInside(Point3d)
public bool IsInside(Point3d pointValue)
Parameters
pointValue Point3d
Returns
bool
 IsInside(Point3d, Tolerance)
public bool IsInside(Point3d pointValue, Tolerance tolerance)
Parameters
pointValue Point3d
tolerance Tolerance
Returns
bool
 ProjectedIntersectWith(LinearEntity3d, Vector3d)
public Point3d[] ProjectedIntersectWith(LinearEntity3d line, Vector3d projectionDirection)
Parameters
line LinearEntity3d
projectionDirection Vector3d
Returns
Point3d[]
 ProjectedIntersectWith(LinearEntity3d, Vector3d, Tolerance)
public Point3d[] ProjectedIntersectWith(LinearEntity3d line, Vector3d projectionDirection, Tolerance tolerance)
Parameters
line LinearEntity3d
projectionDirection Vector3d
tolerance Tolerance
Returns
Point3d[]
 Set(Curve3d, Curve3d, Curve3d, double, double, double)
public void Set(Curve3d curve1, Curve3d curve2, Curve3d curve3, double param1, double param2, double param3)
Parameters
curve1 Curve3d
curve2 Curve3d
curve3 Curve3d
param1 double
param2 double
param3 double
 Set(Curve3d, Curve3d, double, double, double)
public void Set(Curve3d curve1, Curve3d curve2, double radius, double param1, double param2)
Parameters
curve1 Curve3d
curve2 Curve3d
radius double
param1 double
param2 double
 Set(Point3d, Point3d, Point3d)
public void Set(Point3d startPoint, Point3d pointOnArc, Point3d endPoint)
Parameters
startPoint Point3d
pointOnArc Point3d
endPoint Point3d
 Set(Point3d, Vector3d, Vector3d, double, double, double)
public void Set(Point3d center, Vector3d normal, Vector3d referenceVector, double radius, double startAngle, double endAngle)
Parameters
center Point3d
normal Vector3d
referenceVector Vector3d
radius double
startAngle double
endAngle double
 Set(Point3d, Vector3d, double)
public void Set(Point3d center, Vector3d normal, double radius)
Parameters
center Point3d
normal Vector3d
radius double
 SetAngles(double, double)
public void SetAngles(double startAngle, double endAngle)
Parameters
startAngle double
endAngle double
 SetAxes(Vector3d, Vector3d)
public void SetAxes(Vector3d normal, Vector3d referenceVector)
Parameters
normal Vector3d
referenceVector Vector3d