Table of Contents
 Enum FieldEvaluationOptions
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
public enum FieldEvaluationOptions
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Automatic = OnOpen | OnSave | OnPlot | OnEtransmit | OnRegen | OnDemand
Disable = 0
OnDemand = 32
OnEtransmit = 8
OnOpen = 1
OnPlot = 4
OnRegen = 16
OnSave = 2