Table of Contents
 Enum Intersect
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::Intersect")]
public enum Intersect
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ExtendArgument = 2
ExtendBoth = 3
ExtendThis = 1
OnBothOperands = 0