Table of Contents
 Class AssocPersSubentityIdPE
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocPersSubentIdPE")]
public class AssocPersSubentityIdPE : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
AssocPersSubentityIdPE
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocPersSubentityIdPE()
public AssocPersSubentityIdPE()
 AssocPersSubentityIdPE(IntPtr, bool)
protected AssocPersSubentityIdPE(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Methods
 CreateNewPersSubent(Entity, CompoundObjectId, SubentityId)
public virtual AssocPersSubentityId CreateNewPersSubent(Entity entity, CompoundObjectId compId, SubentityId subentId)
Parameters
entity Entity
compId CompoundObjectId
subentId SubentityId
Returns
AssocPersSubentityId
 GetAllSubentities(Entity, SubentityType)
public virtual SubentityId[] GetAllSubentities(Entity entity, SubentityType subentType)
Parameters
entity Entity
subentType SubentityType
Returns
SubentityId[]
 GetEdgeSubentityGeometry(Entity, SubentityId)
public virtual Curve3d GetEdgeSubentityGeometry(Entity entity, SubentityId edgeSubentId)
Parameters
entity Entity
edgeSubentId SubentityId
Returns
Curve3d
 GetEdgeVertexSubentities(Entity, SubentityId, ref SubentityId, ref SubentityId, ref SubentityId[])
public virtual void GetEdgeVertexSubentities(Entity entity, SubentityId edgeSubentId, ref SubentityId startVertexSubentId, ref SubentityId endVertexSubentId, ref SubentityId[] otherVertexSubentIds)
Parameters
entity Entity
edgeSubentId SubentityId
startVertexSubentId SubentityId
endVertexSubentId SubentityId
otherVertexSubentIds SubentityId[]
 GetFaceSubentityGeometry(Entity, SubentityId)
public virtual Surface GetFaceSubentityGeometry(Entity entity, SubentityId faceSubentId)
Parameters
entity Entity
faceSubentId SubentityId
Returns
Surface
 GetRigidSetState(Entity)
public virtual int GetRigidSetState(Entity entity)
Parameters
entity Entity
Returns
int
 GetRigidSetTransform(Entity)
public virtual Matrix3d GetRigidSetTransform(Entity entity)
Parameters
entity Entity
Returns
Matrix3d
 GetSplineEdgeVertexSubentities(Entity, SubentityId, ref SubentityId, ref SubentityId, ref SubentityId[], ref SubentityId[])
public virtual void GetSplineEdgeVertexSubentities(Entity entity, SubentityId edgeSubentId, ref SubentityId startVertexSubentId, ref SubentityId endVertexSubentId, ref SubentityId[] controlPointSubentIds, ref SubentityId[] fitPointSubentIds)
Parameters
entity Entity
edgeSubentId SubentityId
startVertexSubentId SubentityId
endVertexSubentId SubentityId
controlPointSubentIds SubentityId[]
fitPointSubentIds SubentityId[]
 GetSubentGeometryXform(Entity, ObjectId[])
public virtual Matrix3d GetSubentGeometryXform(Entity entity, ObjectId[] fullSubentPath)
Parameters
entity Entity
fullSubentPath ObjectId[]
Returns
Matrix3d
 GetTransientSubentityIds(Entity, AssocPersSubentityId)
public virtual SubentityId[] GetTransientSubentityIds(Entity entity, AssocPersSubentityId perSubentId)
Parameters
entity Entity
perSubentId AssocPersSubentityId
Returns
SubentityId[]
 GetVertexSubentityGeometry(Entity, SubentityId)
public virtual Point3d GetVertexSubentityGeometry(Entity entity, SubentityId vertexSubentId)
Parameters
entity Entity
vertexSubentId SubentityId
Returns
Point3d
 MirrorPersSubent(Entity, AssocPersSubentityId)
public virtual void MirrorPersSubent(Entity mirroredEntity, AssocPersSubentityId persSubentIdToMirror)
Parameters
mirroredEntity Entity
persSubentIdToMirror AssocPersSubentityId
 SetEdgeSubentityGeometry(Entity, SubentityId, Curve3d)
public virtual void SetEdgeSubentityGeometry(Entity entity, SubentityId edgeSubentId, Curve3d newEdgeCurve)
Parameters
entity Entity
edgeSubentId SubentityId
newEdgeCurve Curve3d
 SetFaceSubentityGeometry(Entity, SubentityId, Surface)
public virtual void SetFaceSubentityGeometry(Entity entity, SubentityId faceSubentId, Surface newFaceSurface)
Parameters
entity Entity
faceSubentId SubentityId
newFaceSurface Surface
 SetRigidSetTransform(Entity, Matrix3d)
public virtual void SetRigidSetTransform(Entity entity, Matrix3d trans)
Parameters
entity Entity
trans Matrix3d
 SetVertexSubentityGeometry(Entity, SubentityId, Point3d)
public virtual void SetVertexSubentityGeometry(Entity entity, SubentityId vertexSubentId, Point3d newVertexPosition)
Parameters
entity Entity
vertexSubentId SubentityId
newVertexPosition Point3d