Table of Contents
 Class LightAttenuation
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiLightAttenuation")]
public sealed class LightAttenuation : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
LightAttenuation
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 LightAttenuation()
public LightAttenuation()
 LightAttenuation(IntPtr, bool)
protected LightAttenuation(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 AttenuationType
public AttenuationType AttenuationType { get; set; }
Property Value
AttenuationType
 EndLimit
public double EndLimit { get; }
Property Value
double
 StartLimit
public double StartLimit { get; }
Property Value
double
 UseLimits
public bool UseLimits { get; set; }
Property Value
bool
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 SetLimits(double, double)
public void SetLimits(double startLimit, double endLimit)
Parameters
startLimit double
endLimit double