Table of Contents
 Enum CellMargins
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::CellMargin")]
[Flags]
public enum CellMargins
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Bottom = 4
Left = 2
Right = 8
Top = 1