Table of Contents
 Enum FileOpenMode
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDatabase::OpenMode")]
public enum FileOpenMode
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
OpenForReadAndAllShare = 3
OpenForReadAndReadShare = 1
OpenForReadAndWriteNoShare = 2
OpenTryForReadShare = 4