Table of Contents
 Class FileDependencyInfo
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcFileDependencyInfo")]
public class FileDependencyInfo
Inheritance
object
FileDependencyInfo
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Feature
public string Feature { get; }
Property Value
string
 FileName
public string FileName { get; }
Property Value
string
 FileSize
public int FileSize { get; }
Property Value
int
 FingerprintGuid
public string FingerprintGuid { get; }
Property Value
string
 FoundPath
public string FoundPath { get; }
Property Value
string
 FullFileName
public string FullFileName { get; }
Property Value
string
 Index
public int Index { get; }
Property Value
int
 IsAffectsGraphics
public bool IsAffectsGraphics { get; }
Property Value
bool
 IsModified
public bool IsModified { get; }
Property Value
bool
 ReferenceCount
public int ReferenceCount { get; }
Property Value
int
 TimeStamp
public int TimeStamp { get; }
Property Value
int
 VersionGuid
public string VersionGuid { get; }
Property Value
string
Methods
 ToString()
public override string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string