Table of Contents
 Struct MeshDataCollection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct MeshDataCollection
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 MeshDataCollection(Point3dCollection, Int32Collection, EntityColorCollection, ObjectIdCollection)
public MeshDataCollection(Point3dCollection pts, Int32Collection faces, EntityColorCollection colors, ObjectIdCollection materialIds)
Parameters
pts Point3dCollection
faces Int32Collection
colors EntityColorCollection
materialIds ObjectIdCollection
Properties
 ColorArray
public EntityColorCollection ColorArray { get; set; }
Property Value
EntityColorCollection
 FaceArray
public Int32Collection FaceArray { get; set; }
Property Value
Int32Collection
 MaterialIdArray
public ObjectIdCollection MaterialIdArray { get; set; }
Property Value
ObjectIdCollection
 VertexArray
public Point3dCollection VertexArray { get; set; }
Property Value
Point3dCollection