Table of Contents
 Enum DrawableTraits.HighlightProperty
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcGiDrawableTraits::HighlightProperty")]
public enum DrawableTraits.HighlightProperty
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
VertexRolloverHighlightSize = 0