Table of Contents
 Enum ScaleEstimationMethod
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbGeoData::ScaleEstimationMethod")]
public enum ScaleEstimationMethod
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ScaleEstMethodPrismoidal = 4
ScaleEstMethodReferencePoint = 3
ScaleEstMethodUnity = 1
ScaleEstMethodUserDefined = 2