Table of Contents
 Enum SubentityType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::SubentType")]
[TypeConverter(typeof(EnumConverter))]
public enum SubentityType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Class = 5
Edge = 2
Face = 1
MlineCache = 4
Null = 0
Vertex = 3