Table of Contents
 Enum FormatOption
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcValue::FormatOption")]
public enum FormatOption
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ForEditing = 1
ForExpression = 2
FormatOptionNone = 0
IgnoreMtextFormat = 8
UseMaximumPrecision = 4