Table of Contents
 Class FilteredBlockIterator
Namespace
Autodesk.AutoCAD.DatabaseServices.Filters
Assembly
Acdbmgd.dll
[Wrapper("AcDbFilteredBlockIterator")]
public sealed class FilteredBlockIterator : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
FilteredBlockIterator
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 BuffersForComposition
public bool BuffersForComposition { get; }
Property Value
bool
 EstimatedHitFraction
public double EstimatedHitFraction { get; }
Property Value
double
 Id
public ObjectId Id { get; }
Property Value
ObjectId
 Next
public ObjectId Next { get; }
Property Value
ObjectId
Methods
 Accepts(ObjectId)
public bool Accepts(ObjectId id)
Parameters
id ObjectId
Returns
bool
 AddToBuffer(ObjectId)
public void AddToBuffer(ObjectId id)
Parameters
id ObjectId
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 Seek(ObjectId)
public void Seek(ObjectId id)
Parameters
id ObjectId
 Start()
public void Start()