Table of Contents
 Class Geometry
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiGeometry")]
public abstract class Geometry : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Geometry
Implements
IDisposable
ICloneable
Derived
ViewportGeometry
WorldGeometry
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Geometry(IntPtr, bool)
protected Geometry(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 ModelToWorldTransform
public abstract Matrix3d ModelToWorldTransform { get; }
Property Value
Matrix3d
 WorldToModelTransform
public abstract Matrix3d WorldToModelTransform { get; }
Property Value
Matrix3d
Methods
 Circle(Point3d, Point3d, Point3d)
public abstract bool Circle(Point3d firstPoint, Point3d secondPoint, Point3d thirdPoint)
Parameters
firstPoint Point3d
secondPoint Point3d
thirdPoint Point3d
Returns
bool
 Circle(Point3d, double, Vector3d)
public abstract bool Circle(Point3d center, double radius, Vector3d normal)
Parameters
center Point3d
radius double
normal Vector3d
Returns
bool
 CircularArc(Point3d, Point3d, Point3d, ArcType)
public abstract bool CircularArc(Point3d start, Point3d point, Point3d endingPoint, ArcType arcType)
Parameters
start Point3d
point Point3d
endingPoint Point3d
arcType ArcType
Returns
bool
 CircularArc(Point3d, double, Vector3d, Vector3d, double, ArcType)
public abstract bool CircularArc(Point3d center, double radius, Vector3d normal, Vector3d startVector, double sweepAngle, ArcType arcType)
Parameters
center Point3d
radius double
normal Vector3d
startVector Vector3d
sweepAngle double
arcType ArcType
Returns
bool
 Draw(Drawable)
public abstract bool Draw(Drawable value)
Parameters
value Drawable
Returns
bool
 Edge(Curve2dCollection)
public abstract bool Edge(Curve2dCollection e)
Parameters
e Curve2dCollection
Returns
bool
 EllipticalArc(Point3d, Vector3d, double, double, double, double, double, ArcType)
public abstract bool EllipticalArc(Point3d center, Vector3d normal, double majorAxisLength, double minorAxisLength, double startDegreeInRads, double endDegreeInRads, double tiltDegreeInRads, ArcType arcType)
Parameters
center Point3d
normal Vector3d
majorAxisLength double
minorAxisLength double
startDegreeInRads double
endDegreeInRads double
tiltDegreeInRads double
arcType ArcType
Returns
bool
 Image(ImageBGRA32, Point3d, Vector3d, Vector3d)
public abstract bool Image(ImageBGRA32 imageSource, Point3d position, Vector3d u, Vector3d v)
Parameters
imageSource ImageBGRA32
position Point3d
u Vector3d
v Vector3d
Returns
bool
 Image(ImageBGRA32, Point3d, Vector3d, Vector3d, TransparencyMode)
public abstract bool Image(ImageBGRA32 imageSource, Point3d position, Vector3d u, Vector3d v, TransparencyMode transparencyMode)
Parameters
imageSource ImageBGRA32
position Point3d
u Vector3d
v Vector3d
transparencyMode TransparencyMode
Returns
bool
 Mesh(int, int, Point3dCollection, EdgeData, FaceData, VertexData, bool)
public abstract bool Mesh(int rows, int columns, Point3dCollection points, EdgeData edgeData, FaceData faceData, VertexData vertexData, bool bAutoGenerateNormals)
Parameters
rows int
columns int
points Point3dCollection
edgeData EdgeData
faceData FaceData
vertexData VertexData
bAutoGenerateNormals bool
Returns
bool
 OwnerDraw(GdiDrawObject, Point3d, Vector3d, Vector3d)
public abstract bool OwnerDraw(GdiDrawObject gdiDrawObject, Point3d position, Vector3d u, Vector3d v)
Parameters
gdiDrawObject GdiDrawObject
position Point3d
u Vector3d
v Vector3d
Returns
bool
 PolyPolygon(UInt32Collection, Point3dCollection, UInt32Collection, Point3dCollection, EntityColorCollection, LinetypeCollection, EntityColorCollection, TransparencyCollection)
public abstract bool PolyPolygon(UInt32Collection numPolygonPositions, Point3dCollection polygonPositions, UInt32Collection numPolygonPoints, Point3dCollection polygonPoints, EntityColorCollection outlineColors, LinetypeCollection outlineTypes, EntityColorCollection fillColors, TransparencyCollection fillOpacities)
Parameters
numPolygonPositions UInt32Collection
polygonPositions Point3dCollection
numPolygonPoints UInt32Collection
polygonPoints Point3dCollection
outlineColors EntityColorCollection
outlineTypes LinetypeCollection
fillColors EntityColorCollection
fillOpacities TransparencyCollection
Returns
bool
 PolyPolyline(PolylineCollection)
public abstract bool PolyPolyline(PolylineCollection polylineCollection)
Parameters
polylineCollection PolylineCollection
Returns
bool
 Polygon(Point3dCollection)
public abstract bool Polygon(Point3dCollection points)
Parameters
points Point3dCollection
Returns
bool
 Polyline(Polyline, int, int)
public abstract bool Polyline(Polyline value, int fromIndex, int segments)
Parameters
value Polyline
fromIndex int
segments int
Returns
bool
 Polyline(Point3dCollection, Vector3d, IntPtr)
public abstract bool Polyline(Point3dCollection points, Vector3d normal, IntPtr subEntityMarker)
Parameters
points Point3dCollection
normal Vector3d
subEntityMarker IntPtr
Returns
bool
 Polyline(Polyline)
public abstract bool Polyline(Polyline polylineObj)
Parameters
polylineObj Polyline
Returns
bool
 Polypoint(Point3dCollection, Vector3dCollection, IntPtrCollection)
public abstract bool Polypoint(Point3dCollection points, Vector3dCollection normals, IntPtrCollection subentityMarkers)
Parameters
points Point3dCollection
normals Vector3dCollection
subentityMarkers IntPtrCollection
Returns
bool
 PopClipBoundary()
public abstract void PopClipBoundary()
 PopModelTransform()
public abstract bool PopModelTransform()
Returns
bool
 PushClipBoundary(ClipBoundary)
public abstract bool PushClipBoundary(ClipBoundary boundary)
Parameters
boundary ClipBoundary
Returns
bool
 PushModelTransform(Matrix3d)
public abstract bool PushModelTransform(Matrix3d matrix)
Parameters
matrix Matrix3d
Returns
bool
 PushModelTransform(Vector3d)
public abstract bool PushModelTransform(Vector3d normal)
Parameters
normal Vector3d
Returns
bool
 PushOrientationTransform(OrientationBehavior)
public abstract Matrix3d PushOrientationTransform(OrientationBehavior behavior)
Parameters
behavior OrientationBehavior
Returns
Matrix3d
 PushPositionTransform(PositionBehavior, Point2d)
public abstract Matrix3d PushPositionTransform(PositionBehavior behavior, Point2d offset)
Parameters
behavior PositionBehavior
offset Point2d
Returns
Matrix3d
 PushPositionTransform(PositionBehavior, Point3d)
public abstract Matrix3d PushPositionTransform(PositionBehavior behavior, Point3d offset)
Parameters
behavior PositionBehavior
offset Point3d
Returns
Matrix3d
 PushScaleTransform(ScaleBehavior, Point2d)
public abstract Matrix3d PushScaleTransform(ScaleBehavior behavior, Point2d extents)
Parameters
behavior ScaleBehavior
extents Point2d
Returns
Matrix3d
 PushScaleTransform(ScaleBehavior, Point3d)
public abstract Matrix3d PushScaleTransform(ScaleBehavior behavior, Point3d extents)
Parameters
behavior ScaleBehavior
extents Point3d
Returns
Matrix3d
 Ray(Point3d, Point3d)
public abstract bool Ray(Point3d point1, Point3d point2)
Parameters
point1 Point3d
point2 Point3d
Returns
bool
 RowOfDots(int, Point3d, Vector3d)
public abstract bool RowOfDots(int count, Point3d start, Vector3d step)
Parameters
count int
start Point3d
step Vector3d
Returns
bool
 Shell(Point3dCollection, IntegerCollection, EdgeData, FaceData, VertexData, bool)
public abstract bool Shell(Point3dCollection points, IntegerCollection faces, EdgeData edgeData, FaceData faceData, VertexData vertexData, bool bAutoGenerateNormals)
Parameters
points Point3dCollection
faces IntegerCollection
edgeData EdgeData
faceData FaceData
vertexData VertexData
bAutoGenerateNormals bool
Returns
bool
 Text(Point3d, Vector3d, Vector3d, double, double, double, string)
public abstract bool Text(Point3d position, Vector3d normal, Vector3d direction, double height, double width, double oblique, string message)
Parameters
position Point3d
normal Vector3d
direction Vector3d
height double
width double
oblique double
message string
Returns
bool
 Text(Point3d, Vector3d, Vector3d, string, bool, TextStyle)
public abstract bool Text(Point3d position, Vector3d normal, Vector3d direction, string message, bool raw, TextStyle textStyle)
Parameters
position Point3d
normal Vector3d
direction Vector3d
message string
raw bool
textStyle TextStyle
Returns
bool
 WorldLine(Point3d, Point3d)
public abstract bool WorldLine(Point3d startPoint, Point3d endPoint)
Parameters
startPoint Point3d
endPoint Point3d
Returns
bool
 Xline(Point3d, Point3d)
public abstract bool Xline(Point3d point1, Point3d point2)
Parameters
point1 Point3d
point2 Point3d
Returns
bool