Table of Contents
 Enum TextEditor.TextFindFlags
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
public enum TextEditor.TextFindFlags
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
HalfFullForm = 4
IgnoreAccent = 8
MatchCase = 1
UseWildcards = 16
WholeWord = 2