Table of Contents
 Class LinearEntity2d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeLinearEnt2d")]
public abstract class LinearEntity2d : Curve2d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity2d
Curve2d
LinearEntity2d
Implements
IDisposable
ICloneable
Derived
Line2d
LineSegment2d
Ray2d
Inherited Members
 Curve2d.GetInterval()
 Curve2d.SetInterval(Interval)
 Curve2d.GetReverseParameterCurve()
 Curve2d.GetDistanceTo(Curve2d)
 Curve2d.GetDistanceTo(Curve2d, Tolerance)
 Curve2d.GetDistanceTo(Point2d)
 Curve2d.GetDistanceTo(Point2d, Tolerance)
 Curve2d.GetClosestPointTo(Curve2d)
 Curve2d.GetClosestPointTo(Curve2d, Tolerance)
 Curve2d.GetClosestPointTo(Point2d)
 Curve2d.GetClosestPointTo(Point2d, Tolerance)
 Curve2d.GetNormalPoint(Point2d)
 Curve2d.GetNormalPoint(Point2d, Tolerance)
 Curve2d.IsOn(double)
 Curve2d.IsOn(double, Tolerance)
 Curve2d.IsOn(Point2d, out double)
 Curve2d.IsOn(Point2d, out double, Tolerance)
 Curve2d.IsOn(Point2d)
 Curve2d.IsOn(Point2d, Tolerance)
 Curve2d.GetParameterOf(Point2d)
 Curve2d.GetParameterOf(Point2d, Tolerance)
 Curve2d.GetTrimmedOffset(double, OffsetCurveExtensionType)
 Curve2d.GetTrimmedOffset(double, OffsetCurveExtensionType, Tolerance)
 Curve2d.IsClosed()
 Curve2d.IsClosed(Tolerance)
 Curve2d.IsPeriodic(out double)
 Curve2d.IsLinear(out Line2d)
 Curve2d.IsLinear(out Line2d, Tolerance)
 Curve2d.GetLength(double, double)
 Curve2d.GetLength(double, double, Tolerance)
 Curve2d.GetParameterAtLength(double, double, bool)
 Curve2d.GetParameterAtLength(double, double, bool, Tolerance)
 Curve2d.GetArea(double, double)
 Curve2d.GetArea(double, double, Tolerance)
 Curve2d.IsDegenerate(out Entity2d)
 Curve2d.IsDegenerate(out Entity2d, Tolerance)
 Curve2d.GetSplitCurves(double)
 Curve2d.Explode(Interval)
 Curve2d.GetBoundBlockOf(Interval)
 Curve2d.GetOrthoBoundBlockOf(Interval)
 Curve2d.EvaluatePoint(double)
 Curve2d.GetSamplePoints(int)
 Curve2d.GetSamplePoints(double, double, double)
 Curve2d.EndPoint
 Curve2d.StartPoint
 Curve2d.HasEndPoint
 Curve2d.HasStartPoint
 Curve2d.OrthoBoundBlock
 Curve2d.BoundBlock
 Entity2d.Clone()
 Entity2d.IsEqualTo(Entity2d)
 Entity2d.IsEqualTo(Entity2d, Tolerance)
 Entity2d.TransformBy(Matrix2d)
 Entity2d.TranslateBy(Vector2d)
 Entity2d.RotateBy(double, Point2d)
 Entity2d.Mirror(Line2d)
 Entity2d.ScaleBy(double, Point2d)
 Entity2d.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Direction
public Vector2d Direction { get; }
Property Value
Vector2d
 PointOnLine
public Point2d PointOnLine { get; }
Property Value
Point2d
Methods
 Create(IntPtr, bool)
public static LinearEntity2d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
LinearEntity2d
 GetLine()
public Line2d GetLine()
Returns
Line2d
 GetPerpendicularLine(Point2d)
public Line2d GetPerpendicularLine(Point2d point)
Parameters
point Point2d
Returns
Line2d
 IntersectWith(LinearEntity2d)
public Point2d[] IntersectWith(LinearEntity2d line)
Parameters
line LinearEntity2d
Returns
Point2d[]
 IntersectWith(LinearEntity2d, Tolerance)
public Point2d[] IntersectWith(LinearEntity2d line, Tolerance tolerance)
Parameters
line LinearEntity2d
tolerance Tolerance
Returns
Point2d[]
 IsColinearTo(LinearEntity2d)
public bool IsColinearTo(LinearEntity2d line)
Parameters
line LinearEntity2d
Returns
bool
 IsColinearTo(LinearEntity2d, Tolerance)
public bool IsColinearTo(LinearEntity2d line, Tolerance tolerance)
Parameters
line LinearEntity2d
tolerance Tolerance
Returns
bool
 IsParallelTo(LinearEntity2d)
public bool IsParallelTo(LinearEntity2d line)
Parameters
line LinearEntity2d
Returns
bool
 IsParallelTo(LinearEntity2d, Tolerance)
public bool IsParallelTo(LinearEntity2d line, Tolerance tolerance)
Parameters
line LinearEntity2d
tolerance Tolerance
Returns
bool
 IsPerpendicularTo(LinearEntity2d)
public bool IsPerpendicularTo(LinearEntity2d line)
Parameters
line LinearEntity2d
Returns
bool
 IsPerpendicularTo(LinearEntity2d, Tolerance)
public bool IsPerpendicularTo(LinearEntity2d line, Tolerance tolerance)
Parameters
line LinearEntity2d
tolerance Tolerance
Returns
bool
 Overlap(LinearEntity2d)
public LinearEntity2d Overlap(LinearEntity2d line)
Parameters
line LinearEntity2d
Returns
LinearEntity2d
 Overlap(LinearEntity2d, Tolerance)
public LinearEntity2d Overlap(LinearEntity2d line, Tolerance tolerance)
Parameters
line LinearEntity2d
tolerance Tolerance
Returns
LinearEntity2d