Table of Contents
 Class ToneOperatorParameters
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiToneOperatorParameters")]
public class ToneOperatorParameters : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
ToneOperatorParameters
Implements
IDisposable
ICloneable
Derived
PhotographicExposureParameters
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ToneOperatorParameters()
public ToneOperatorParameters()
 ToneOperatorParameters(IntPtr, bool)
protected ToneOperatorParameters(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 Brightness
public double Brightness { get; set; }
Property Value
double
 ChromaticAdaptation
public bool ChromaticAdaptation { get; set; }
Property Value
bool
 ColorDifferentiation
public bool ColorDifferentiation { get; set; }
Property Value
bool
 Contrast
public double Contrast { get; set; }
Property Value
double
 ExteriorDaylight
public ExteriorDaylightMode ExteriorDaylight { get; set; }
Property Value
ExteriorDaylightMode
 IsActive
public bool IsActive { get; set; }
Property Value
bool
 MidTones
public double MidTones { get; set; }
Property Value
double
 ProcessBackground
public bool ProcessBackground { get; set; }
Property Value
bool
 WhiteColor
public Color WhiteColor { get; set; }
Property Value
Color
Methods
 CopyFrom(RXObject)
public override void CopyFrom(RXObject source)
Parameters
source RXObject
 Equals(object)
public override bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override int GetHashCode()
Returns
int
Operators
 operator ==(ToneOperatorParameters, ToneOperatorParameters)
public static bool operator ==(ToneOperatorParameters a, ToneOperatorParameters b)
Parameters
a ToneOperatorParameters
b ToneOperatorParameters
Returns
bool
 operator !=(ToneOperatorParameters, ToneOperatorParameters)
public static bool operator !=(ToneOperatorParameters a, ToneOperatorParameters b)
Parameters
a ToneOperatorParameters
b ToneOperatorParameters
Returns
bool