Table of Contents
 Enum ParseOption
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcValue::ParseOption")]
public enum ParseOption
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ParseOptionNone = 0
PreserveMtextFormat = 2
SetDefaultFormat = 1