Table of Contents
 Class TextEditorColumns
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbTextEditorColumns")]
public class TextEditorColumns : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
TextEditorColumns
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 AutoHeight
public bool AutoHeight { get; set; }
Property Value
bool
 Count
public virtual int Count { get; set; }
Property Value
int
 Gutter
public double Gutter { get; set; }
Property Value
double
 IsFlowReversed
public bool IsFlowReversed { get; set; }
Property Value
bool
 this[int]
public TextEditorColumn this[int index] { get; }
Parameters
index int
Property Value
TextEditorColumn
 MaxCount
public int MaxCount { get; }
Property Value
int
 TotalWidth
public double TotalWidth { get; set; }
Property Value
double
 Type
public ColumnType Type { get; set; }
Property Value
ColumnType
 Width
public double Width { get; set; }
Property Value
double
Methods
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()