Table of Contents
 Enum VisualStyleType
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiVisualStyle::Type")]
public enum VisualStyleType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Basic = 7
Brighten = 12
ColorChange = 16
Conceptual = 9
Custom = 10
Dim = 11
DisplayOnly = 19
EdgeColorOff = 22
EdgeOnly = 18
EmptyStyle = 31
FaceOnly = 17
FacePattern = 15
Flat = 0
FlatWithEdges = 1
Gouraud = 2
GouraudWithEdges = 3
Hidden = 6
JitterOff = 20
LinePattern = 14
OverhangOff = 21
Realistic = 8
Shaded = 27
ShadedWithEdges = 26
ShadesOfGray = 23
Sketchy = 24
Thicken = 13
Wireframe2D = 4
Wireframe3D = 5
XRay = 25