Table of Contents
 Enum BooleanOperationType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::BoolOperType")]
public enum BooleanOperationType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BoolIntersect = 1
BoolSubtract = 2
BoolUnite = 0