Table of Contents
 Class EdgeData
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiEdgeData")]
public class EdgeData
Inheritance
object
EdgeData
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 EdgeData()
public EdgeData()
Methods
 GetColors()
public short[] GetColors()
Returns
short[]
 GetLayers()
public ObjectId[] GetLayers()
Returns
ObjectId[]
 GetLineTypes()
public ObjectId[] GetLineTypes()
Returns
ObjectId[]
 GetSelectionMarkers()
public IntPtr[] GetSelectionMarkers()
Returns
IntPtr[]
 GetTrueColors()
public EntityColor[] GetTrueColors()
Returns
EntityColor[]
 GetVisibility()
public byte[] GetVisibility()
Returns
byte[]
 SetColors(short[])
public void SetColors(short[] colors)
Parameters
colors short[]
 SetLayers(ObjectId[])
public void SetLayers(ObjectId[] layers)
Parameters
layers ObjectId[]
 SetLineTypes(ObjectId[])
public void SetLineTypes(ObjectId[] lineTypes)
Parameters
lineTypes ObjectId[]
 SetSelectionMarkers(IntPtr[])
public void SetSelectionMarkers(IntPtr[] selectionMarkers)
Parameters
selectionMarkers IntPtr[]
 SetTrueColors(EntityColor[])
public void SetTrueColors(EntityColor[] colors)
Parameters
colors EntityColor[]
 SetVisibility(byte[])
public void SetVisibility(byte[] visibility)
Parameters
visibility byte[]