Table of Contents
 Class PointCloudCrop
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class PointCloudCrop : IDisposable
Inheritance
object
PointCloudCrop
Implements
IDisposable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 CropPlane
public Plane CropPlane { get; set; }
Property Value
Plane
 CropType
public PointCloudCropType CropType { get; set; }
Property Value
PointCloudCropType
 Inside
public bool Inside { get; set; }
Property Value
bool
 Inverted
public bool Inverted { get; set; }
Property Value
bool
 Vertices
public Point3dCollection Vertices { get; set; }
Property Value
Point3dCollection
Methods
 Clear()
public void Clear()
 Create(IntPtr)
public static PointCloudCrop Create(IntPtr unmanagedObjPtr)
Parameters
unmanagedObjPtr IntPtr
Returns
PointCloudCrop
 Dispose()
public override sealed void Dispose()
 Dispose(bool)
protected virtual void Dispose(bool A_0)
Parameters
A_0 bool
 IsValid()
public bool IsValid()
Returns
bool