Table of Contents
 Class NurbSurface
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbNurbSurface")]
public class NurbSurface : Surface, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
Entity
Surface
NurbSurface
Implements
IDisposable
ICloneable
Inherited Members
 Surface.CreateFrom(Entity)
 Surface.ConvertToRegion()
 Surface.Thicken(double, bool)
 Surface.GetArea()
 Surface.CreateInterferenceObjects(Entity, int)
 Surface.BooleanUnion(Surface)
 Surface.BooleanSubtract(Solid3d)
 Surface.BooleanSubtract(Surface)
 Surface.BooleanIntersect(Solid3d)
 Surface.BooleanIntersect(Surface)
 Surface.ImprintEntity(Entity)
 Surface.CreateSectionObjects(Plane)
 Surface.SliceByPlane(Plane)
 Surface.SliceBySurface(Surface)
 Surface.ChamferEdges(SubentityId[], SubentityId, double, double, bool)
 Surface.ChamferEdges(SubentityId[], SubentityId, double, double)
 Surface.FilletEdges(SubentityId[], double, bool)
 Surface.FilletEdges(SubentityId[], DoubleCollection, DoubleCollection, DoubleCollection)
 Surface.SetSubentityColor(SubentityId, Color)
 Surface.GetSubentityColor(SubentityId)
 Surface.SetSubentityMaterial(SubentityId, ObjectId)
 Surface.GetSubentityMaterial(SubentityId)
 Surface.SetSubentityMaterialMapper(SubentityId, Mapper)
 Surface.GetSubentityMaterialMapper(SubentityId)
 Surface.ProjectOnToSurface(Entity, Vector3d)
 Surface.RayTest(Point3d, Vector3d, double, out SubentityId[], out DoubleCollection)
 Surface.ConvertToNurbSurface()
 Surface.ExtendEdges(FullSubentityPath[], double, Surface.EdgeExtensionType, bool)
 Surface.CreateExtendSurface(ObjectId, SubentityId[], double, Surface.EdgeExtensionType, bool)
 Surface.CreateExtrudedSurface(Profile3d, Vector3d, SweepOptions)
 Surface.CreateExtrudedSurface(Profile3d, Vector3d, SweepOptions, bool)
 Surface.CreateRevolvedSurface(Profile3d, Profile3d, bool, double, double, RevolveOptions)
 Surface.CreateRevolvedSurface(Profile3d, Profile3d, bool, double, double, RevolveOptions, bool)
 Surface.CreateRevolvedSurface(Profile3d, Point3d, Vector3d, double, double, RevolveOptions)
 Surface.CreateRevolvedSurface(Profile3d, Point3d, Vector3d, double, double, RevolveOptions, bool)
 Surface.CreateSweptSurface(Profile3d, Profile3d, SweepOptions)
 Surface.CreateSweptSurface(Profile3d, Profile3d, SweepOptions, bool)
 Surface.CreateLoftedSurface(LoftProfile[], LoftProfile[], LoftProfile, LoftOptions)
 Surface.CreateLoftedSurface(LoftProfile[], LoftProfile[], LoftProfile, LoftOptions, bool)
 Surface.CreateNetworkSurface(Profile3d[], Profile3d[])
 Surface.CreateNetworkSurface(Profile3d[], Profile3d[], bool)
 Surface.CreatePatchSurface(PathRef, ObjectIdCollection, int, double)
 Surface.CreatePatchSurface(PathRef, ObjectIdCollection, int, double, bool)
 Surface.CreateBlendSurface(LoftProfile, LoftProfile, BlendOptions)
 Surface.CreateBlendSurface(LoftProfile, LoftProfile, BlendOptions, bool)
 Surface.CreateFilletSurface(ObjectId, Point3d, ObjectId, Point3d, double, FilletTrimMode, Vector3d)
 Surface.CreateFilletSurface(ObjectId, Point3d, ObjectId, Point3d, double, FilletTrimMode, Vector3d, bool)
 Surface.CreateOffsetSurface(Entity, double)
 Surface.CreateOffsetSurface(Entity, double, bool)
 Surface.TrimSurface(ObjectId, ObjectIdCollection, ObjectIdCollection, Vector3dCollection, Point3d, Vector3d, bool, bool)
 Surface.UsesGraphicsCache
 Surface.Perimeter
 Surface.WireframeType
 Surface.VIsoLineDensity
 Surface.UIsoLineDensity
 Surface.ModificationActionBodyIds
 Surface.CreationActionBodyId
 Entity.SetLayerId(ObjectId, bool)
 Entity.SetPropertiesFrom(Entity)
 Entity.GetPlane()
 Entity.AddSubentityPaths(FullSubentityPath[])
 Entity.DeleteSubentityPaths(FullSubentityPath[])
 Entity.TransformSubentityPathsBy(FullSubentityPath[], Matrix3d)
 Entity.GetGripPointsAtSubentityPath(FullSubentityPath, GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.MoveGripPointsAtSubentityPaths(FullSubentityPath[], IntPtr[], Vector3d, MoveGripPointsFlags)
 Entity.GetSubentityGeometricExtents(FullSubentityPath)
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, IntPtr, Point3d, Matrix3d, ObjectId[])
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, long, Point3d, Matrix3d, int, ObjectId[])
 Entity.GetGraphicsMarkersAtSubentityPathIntPtr(FullSubentityPath)
 Entity.Highlight(FullSubentityPath, bool)
 Entity.Highlight()
 Entity.Unhighlight(FullSubentityPath, bool)
 Entity.Unhighlight()
 Entity.PushHighlight(FullSubentityPath, HighlightStyle)
 Entity.PopHighlight(FullSubentityPath)
 Entity.HighlightState(FullSubentityPath)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection, Matrix3d)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection)
 Entity.IsContentSnappable()
 Entity.GetGripPoints(GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.GetGripPoints(Point3dCollection, IntegerCollection, IntegerCollection)
 Entity.MoveGripPointsAt(GripDataCollection, Vector3d, MoveGripPointsFlags)
 Entity.MoveGripPointsAt(IntegerCollection, Vector3d)
 Entity.GetStretchPoints(Point3dCollection)
 Entity.MoveStretchPointsAt(IntegerCollection, Vector3d)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.List()
 Entity.TransformBy(Matrix3d)
 Entity.GetTransformedCopy(Matrix3d)
 Entity.GetSubentity(FullSubentityPath)
 Entity.Explode(DBObjectCollection)
 Entity.RecordGraphicsModified(bool)
 Entity.Draw()
 Entity.SaveAs(WorldDraw, SaveType)
 Entity.SetDatabaseDefaults(Database)
 Entity.SetDatabaseDefaults()
 Entity.SetDragStatus(DragStatus)
 Entity.SetGripStatus(GripStatus)
 Entity.SetSubentityGripStatus(GripStatus, FullSubentityPath)
 Entity.JoinEntity(Entity)
 Entity.JoinEntities(Entity[])
 Entity.EdgeStyleId
 Entity.FaceStyleId
 Entity.VisualStyleId
 Entity.ForceAnnoAllVisible
 Entity.BlockName
 Entity.MaterialMapper
 Entity.MaterialId
 Entity.Material
 Entity.ReceiveShadows
 Entity.CastShadows
 Entity.Hyperlinks
 Entity.CloneMeForDragging
 Entity.CompoundObjectTransform
 Entity.GeometricExtents
 Entity.Ecs
 Entity.IsPlanar
 Entity.CollisionType
 Entity.LineWeight
 Entity.Visible
 Entity.LinetypeScale
 Entity.LinetypeId
 Entity.Linetype
 Entity.LayerId
 Entity.Layer
 Entity.PlotStyleNameId
 Entity.PlotStyleName
 Entity.Transparency
 Entity.EntityColor
 Entity.ColorIndex
 Entity.Color
 Entity.BlockId
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 NurbSurface()
public NurbSurface()
 NurbSurface(int, int, bool, int, int, Point3dCollection, DoubleCollection, KnotCollection, KnotCollection)
public NurbSurface(int uDegree, int vDegree, bool rational, int uNumControlPoints, int vNumControlPoints, Point3dCollection ctrlPts, DoubleCollection weights, KnotCollection uKnots, KnotCollection vKnots)
Parameters
uDegree int
vDegree int
rational bool
uNumControlPoints int
vNumControlPoints int
ctrlPts Point3dCollection
weights DoubleCollection
uKnots KnotCollection
vKnots KnotCollection
 NurbSurface(IntPtr, bool)
protected NurbSurface(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 ControlPoints
public Point3dCollection ControlPoints { get; }
Property Value
Point3dCollection
 DegreeInU
public int DegreeInU { get; }
Property Value
int
 DegreeInV
public int DegreeInV { get; }
Property Value
int
 IsClosedInU
public bool IsClosedInU { get; }
Property Value
bool
 IsClosedInV
public bool IsClosedInV { get; }
Property Value
bool
 IsPeriodicInU
public bool IsPeriodicInU { get; }
Property Value
bool
 IsPeriodicInV
public bool IsPeriodicInV { get; }
Property Value
bool
 IsRational
public bool IsRational { get; }
Property Value
bool
 NumberOfControlPointsInU
public int NumberOfControlPointsInU { get; }
Property Value
int
 NumberOfControlPointsInV
public int NumberOfControlPointsInV { get; }
Property Value
int
 NumberOfKnotsInU
public int NumberOfKnotsInU { get; }
Property Value
int
 NumberOfKnotsInV
public int NumberOfKnotsInV { get; }
Property Value
int
 NumberOfSpansInU
public int NumberOfSpansInU { get; }
Property Value
int
 NumberOfSpansInV
public int NumberOfSpansInV { get; }
Property Value
int
 PeriodInU
public double PeriodInU { get; }
Property Value
double
 PeriodInV
public double PeriodInV { get; }
Property Value
double
 UKnots
public KnotCollection UKnots { get; }
Property Value
KnotCollection
 VKnots
public KnotCollection VKnots { get; }
Property Value
KnotCollection
Methods
 Evaluate(double, double)
public Point3d Evaluate(double u, double v)
Parameters
u double
v double
Returns
Point3d
 Evaluate(double, double, ref Point3d, ref Vector3d, ref Vector3d)
public void Evaluate(double u, double v, ref Point3d pos, ref Vector3d uDeriv, ref Vector3d vDeriv)
Parameters
u double
v double
pos Point3d
uDeriv Vector3d
vDeriv Vector3d
 Evaluate(double, double, ref Point3d, ref Vector3d, ref Vector3d, ref Vector3d, ref Vector3d, ref Vector3d)
public void Evaluate(double u, double v, ref Point3d pos, ref Vector3d uDeriv, ref Vector3d vDeriv, ref Vector3d uuDeriv, ref Vector3d uvDeriv, ref Vector3d vvDeriv)
Parameters
u double
v double
pos Point3d
uDeriv Vector3d
vDeriv Vector3d
uuDeriv Vector3d
uvDeriv Vector3d
vvDeriv Vector3d
 Evaluate(double, double, int, ref Point3d, ref Vector3dCollection)
public void Evaluate(double u, double v, int derivDegree, ref Point3d point, ref Vector3dCollection derivatives)
Parameters
u double
v double
derivDegree int
point Point3d
derivatives Vector3dCollection
 GetControlPointAt(int, int)
public Point3d GetControlPointAt(int uIndex, int vIndex)
Parameters
uIndex int
vIndex int
Returns
Point3d
 GetIsolineAtU(double)
public Curve[] GetIsolineAtU(double u)
Parameters
u double
Returns
Curve[]
 GetIsolineAtV(double)
public Curve[] GetIsolineAtV(double v)
Parameters
v double
Returns
Curve[]
 GetNormal(double, double)
public Vector3d GetNormal(double u, double v)
Parameters
u double
v double
Returns
Vector3d
 GetParameterOfPoint(Point3d, out double, out double)
public void GetParameterOfPoint(Point3d point, out double u, out double v)
Parameters
point Point3d
u double
v double
 GetWeight(int, int)
public double GetWeight(int uIndex, int vIndex)
Parameters
uIndex int
vIndex int
Returns
double
 InsertControlPointsAtU(double, Point3dCollection, DoubleCollection)
public void InsertControlPointsAtU(double u, Point3dCollection vCtrlPts, DoubleCollection vWeights)
Parameters
u double
vCtrlPts Point3dCollection
vWeights DoubleCollection
 InsertControlPointsAtV(double, Point3dCollection, DoubleCollection)
public void InsertControlPointsAtV(double v, Point3dCollection uCtrlPts, DoubleCollection uWeights)
Parameters
v double
uCtrlPts Point3dCollection
uWeights DoubleCollection
 InsertKnotAtU(double)
public void InsertKnotAtU(double u)
Parameters
u double
 InsertKnotAtV(double)
public void InsertKnotAtV(double v)
Parameters
v double
 IsPlanar(out Point3d, out Vector3d)
public bool IsPlanar(out Point3d ptOnSurface, out Vector3d normal)
Parameters
ptOnSurface Point3d
normal Vector3d
Returns
bool
 IsPointOnSurface(Point3d)
public bool IsPointOnSurface(Point3d point)
Parameters
point Point3d
Returns
bool
 ModifyPosition(double, double, Point3d)
public void ModifyPosition(double u, double v, Point3d point)
Parameters
u double
v double
point Point3d
 ModifyPositionAndTangent(double, double, Point3d, Vector3d, Vector3d)
public void ModifyPositionAndTangent(double u, double v, Point3d point, Vector3d uDeriv, Vector3d vDeriv)
Parameters
u double
v double
point Point3d
uDeriv Vector3d
vDeriv Vector3d
 Rebuild(int, int, int, int)
public void Rebuild(int uDegree, int vDegree, int numUCtrlPts, int numVCtrlPts)
Parameters
uDegree int
vDegree int
numUCtrlPts int
numVCtrlPts int
 Rebuild(int, int, int, int, bool)
public void Rebuild(int uDegree, int vDegree, int numUCtrlPts, int numVCtrlPts, bool bRestore)
Parameters
uDegree int
vDegree int
numUCtrlPts int
numVCtrlPts int
bRestore bool
 RemoveControlPointsAtU(int)
public void RemoveControlPointsAtU(int uIndex)
Parameters
uIndex int
 RemoveControlPointsAtV(int)
public void RemoveControlPointsAtV(int vIndex)
Parameters
vIndex int
 Set(int, int, bool, int, int, Point3dCollection, DoubleCollection, KnotCollection, KnotCollection)
public void Set(int uDegree, int vDegree, bool rational, int uNumControlPoints, int vNumControlPoints, Point3dCollection ctrlPts, DoubleCollection weights, KnotCollection uKnots, KnotCollection vKnots)
Parameters
uDegree int
vDegree int
rational bool
uNumControlPoints int
vNumControlPoints int
ctrlPts Point3dCollection
weights DoubleCollection
uKnots KnotCollection
vKnots KnotCollection
 SetControlPointAt(int, int, Point3d)
public void SetControlPointAt(int uIndex, int vIndex, Point3d point)
Parameters
uIndex int
vIndex int
point Point3d
 SetControlPoints(int, int, Point3dCollection)
public void SetControlPoints(int uCount, int vCount, Point3dCollection points)
Parameters
uCount int
vCount int
points Point3dCollection
 SetWeight(int, int, double)
public void SetWeight(int uIndex, int vIndex, double weight)
Parameters
uIndex int
vIndex int
weight double