Table of Contents
 Struct SpatialFilterDefinition
Namespace
Autodesk.AutoCAD.DatabaseServices.Filters
Assembly
Acdbmgd.dll
public struct SpatialFilterDefinition
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 SpatialFilterDefinition(Point2dCollection, Vector3d, double, double, double, bool)
public SpatialFilterDefinition(Point2dCollection pts, Vector3d normal, double elevation, double frontClip, double backClip, bool enabled)
Parameters
pts Point2dCollection
normal Vector3d
elevation double
frontClip double
backClip double
enabled bool
Properties
 BackClip
public double BackClip { get; }
Property Value
double
 Elevation
public double Elevation { get; }
Property Value
double
 Enabled
public bool Enabled { get; }
Property Value
bool
 FrontClip
public double FrontClip { get; }
Property Value
double
 Normal
public Vector3d Normal { get; }
Property Value
Vector3d
Methods
 GetPoints()
public Point2dCollection GetPoints()
Returns
Point2dCollection