Table of Contents
 Class LayerViewportProperties
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public sealed class LayerViewportProperties
Inheritance
object
LayerViewportProperties
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Color
public Color Color { get; set; }
Property Value
Color
 IsColorOverridden
public bool IsColorOverridden { get; set; }
Property Value
bool
 IsLineWeightOverridden
public bool IsLineWeightOverridden { get; set; }
Property Value
bool
 IsLinetypeOverridden
public bool IsLinetypeOverridden { get; set; }
Property Value
bool
 IsPlotStyleOverridden
public bool IsPlotStyleOverridden { get; set; }
Property Value
bool
 IsTransparencyOverridden
public bool IsTransparencyOverridden { get; set; }
Property Value
bool
 LineWeight
public LineWeight LineWeight { get; set; }
Property Value
LineWeight
 LinetypeObjectId
public ObjectId LinetypeObjectId { get; set; }
Property Value
ObjectId
 PlotStyleName
public string PlotStyleName { get; set; }
Property Value
string
 PlotStyleNameId
public ObjectId PlotStyleNameId { get; set; }
Property Value
ObjectId
 Transparency
public Transparency Transparency { get; set; }
Property Value
Transparency
Methods
 RemoveOverrides()
public void RemoveOverrides()