Table of Contents
 Enum RapidRTFilterType
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiFilterType")]
public enum RapidRTFilterType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Box = 0
Gaussian = 2
Lanczos = 3
Mitchell = 4
Triangle = 1