Table of Contents
 Class DatabaseSummaryInfoBuilder
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class DatabaseSummaryInfoBuilder
Inheritance
object
DatabaseSummaryInfoBuilder
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DatabaseSummaryInfoBuilder()
public DatabaseSummaryInfoBuilder()
 DatabaseSummaryInfoBuilder(DatabaseSummaryInfo)
public DatabaseSummaryInfoBuilder(DatabaseSummaryInfo value)
Parameters
value DatabaseSummaryInfo
Properties
 Author
public string Author { get; set; }
Property Value
string
 Comments
public string Comments { get; set; }
Property Value
string
 CustomProperties
[Obsolete("Use CustomPropertyTable instead")]
public StringDictionary CustomProperties { get; }
Property Value
StringDictionary
 CustomPropertyTable
public IDictionary CustomPropertyTable { get; }
Property Value
IDictionary
 HyperlinkBase
public string HyperlinkBase { get; set; }
Property Value
string
 Keywords
public string Keywords { get; set; }
Property Value
string
 LastSavedBy
public string LastSavedBy { get; set; }
Property Value
string
 RevisionNumber
public string RevisionNumber { get; set; }
Property Value
string
 Subject
public string Subject { get; set; }
Property Value
string
 Title
public string Title { get; set; }
Property Value
string
Methods
 ToDatabaseSummaryInfo()
public DatabaseSummaryInfo ToDatabaseSummaryInfo()
Returns
DatabaseSummaryInfo