Table of Contents
 Struct Handle
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbHandle")]
public struct Handle
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 Handle(long)
public Handle(long value)
Parameters
value long
Properties
 IsOne
public bool IsOne { get; }
Property Value
bool
 Value
public long Value { get; }
Property Value
long
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
Operators
 operator ==(Handle, Handle)
public static bool operator ==(Handle a, Handle b)
Parameters
a Handle
b Handle
Returns
bool
 operator !=(Handle, Handle)
public static bool operator !=(Handle a, Handle b)
Parameters
a Handle
b Handle
Returns
bool