Table of Contents
 Enum Linetype
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiLineType")]
public enum Linetype
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
DashDot = 3
Dashed = 1
Dotted = 2
ISODash = 17
ISODashDot = 25
ISODashDoubleDot = 27
ISODashSpace = 18
ISODashTripleDot = 29
ISODot = 22
ISODoubleDashDot = 26
ISODoubleDashDoubleDot = 28
ISODoubleDashTripleDot = 30
ISOLongDashDot = 19
ISOLongDashDoubleDot = 20
ISOLongDashDoubleShortDash = 24
ISOLongDashShortDash = 23
ISOLongDashTripleDot = 21
LineTypeNone = 31
LongDash = 6
LongDashDot = 14
LongDashDotDot = 13
LongDashShortDash = 12
LongDashX2 = 9
MediumDash = 5
MediumDashDotShortDashDot = 15
MediumDashShortDashShortDash = 11
MediumDashX2 = 8
MediumLongDash = 10
ShortDash = 4
ShortDashX2 = 7
Solid = 0
Solid6PixelsBlank6Pixels = 32
SparseDot = 16