Table of Contents
 Class AuditInfo
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAuditInfo")]
public sealed class AuditInfo : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
AuditInfo
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 AuditPass
public AuditPass AuditPass { get; }
Property Value
AuditPass
 FixErrors
public bool FixErrors { get; }
Property Value
bool
 NumEntities
public int NumEntities { get; }
Property Value
int
 NumErrors
public int NumErrors { get; }
Property Value
int
 NumFixes
public int NumFixes { get; }
Property Value
int
Methods
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 ErrorsFixed(int)
public void ErrorsFixed(int count)
Parameters
count int
 ErrorsFound(int)
public void ErrorsFound(int count)
Parameters
count int
 IncNumEntities()
public void IncNumEntities()
 PrintError(DBObject, string, string, string)
public void PrintError(DBObject value, string value2, string validation, string defaultValue)
Parameters
value DBObject
value2 string
validation string
defaultValue string
 PrintError(string, string, string, string)
public void PrintError(string name, string value, string validation, string defaultValue)
Parameters
name string
value string
validation string
defaultValue string
 PrintNumEntities(string)
public void PrintNumEntities(string msg)
Parameters
msg string
 RequestRegen()
public void RequestRegen()
 ResetNumEntities()
public void ResetNumEntities()