Table of Contents
 Enum FieldCodeFlags
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
public enum FieldCodeFlags
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AddMarkers = 16
EscapeBackslash = 32
EvaluatedChildren = 4
EvaluatedText = 2
FieldCode = 1
ObjectReference = 8
PreserveFields = 128
StripOptions = 64
TextField = 256