Table of Contents
 Enum SectionSubItem
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbSection::SubItem")]
public enum SectionSubItem
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BackLine = 8
BackLineBottom = 32
BackLineTop = 16
SectionLine = 1
SectionLineBottom = 4
SectionLineTop = 2
SectionSubItemNone = 0
VerticalLineBottom = 128
VerticalLineTop = 64