Table of Contents
 Class AssocDependencyBody
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocDependencyBody")]
public abstract class AssocDependencyBody : DBObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
AssocDependencyBody
Implements
IDisposable
ICloneable
Derived
AssocDimDependencyBodyBase
Inherited Members
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocDependencyBody()
public AssocDependencyBody()
 AssocDependencyBody(IntPtr, bool)
protected AssocDependencyBody(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 DependentOnObject
public ObjectId DependentOnObject { get; }
Property Value
ObjectId
 HasCachedValueOverride
public virtual bool HasCachedValueOverride { get; }
Property Value
bool
 IsActionEvaluationInProgress
public bool IsActionEvaluationInProgress { get; }
Property Value
bool
 IsAttachedToObject
public bool IsAttachedToObject { get; }
Property Value
bool
 IsRelevantChangeOverride
public virtual bool IsRelevantChangeOverride { get; }
Property Value
bool
 OwningAction
public ObjectId OwningAction { get; }
Property Value
ObjectId
 ParentDependency
public ObjectId ParentDependency { get; }
Property Value
ObjectId
 Status
public AssocStatus Status { get; }
Property Value
AssocStatus
Methods
 ClonedOverride(DBObject, DBObject)
public virtual void ClonedOverride(DBObject dbObj, DBObject newObj)
Parameters
dbObj DBObject
newObj DBObject
 DwgInFields(DwgFiler)
public virtual ErrorStatus DwgInFields(DwgFiler filer)
Parameters
filer DwgFiler
Returns
ErrorStatus
 DwgOutFields(DwgFiler)
public virtual ErrorStatus DwgOutFields(DwgFiler filer)
Parameters
filer DwgFiler
Returns
ErrorStatus
 DxfInFields(DxfFiler)
public virtual ErrorStatus DxfInFields(DxfFiler filer)
Parameters
filer DxfFiler
Returns
ErrorStatus
 DxfOutFields(DxfFiler)
public virtual ErrorStatus DxfOutFields(DxfFiler filer)
Parameters
filer DxfFiler
Returns
ErrorStatus
 ErasedOverride(DBObject, int)
public virtual void ErasedOverride(DBObject dbObj, int IsErasing)
Parameters
dbObj DBObject
IsErasing int
 EvaluateOverride()
public abstract void EvaluateOverride()
 IsDependentOnTheSameThingAsOverride(AssocDependency)
public virtual bool IsDependentOnTheSameThingAsOverride(AssocDependency otherDependency)
Parameters
otherDependency AssocDependency
Returns
bool
 IsEqualToOverride(AssocDependency)
public virtual bool IsEqualToOverride(AssocDependency otherDependency)
Parameters
otherDependency AssocDependency
Returns
bool
 ModifiedOverride(DBObject)
public virtual void ModifiedOverride(DBObject dbObj)
Parameters
dbObj DBObject
 SetStatus(AssocStatus, bool)
public void SetStatus(AssocStatus newStatus, bool notifyOwningAction)
Parameters
newStatus AssocStatus
notifyOwningAction bool
 UpdateDependentOnObjectOverride()
public virtual void UpdateDependentOnObjectOverride()
 currentEvaluationCallback()
public AssocEvaluationCallback currentEvaluationCallback()
Returns
AssocEvaluationCallback