Table of Contents
 Enum GripData.Status
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum GripData.Status
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
DimFocusChanged = 8
GripAbort = 2
GripEnd = 1
GripStart = 0
Mirror = 7
Move = 4
PopUpMenu = 9
Rotate = 5
Scale = 6
Stretch = 3