Table of Contents
 Class ObjectIdGraphNode
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbObjectIdGraphNode")]
public sealed class ObjectIdGraphNode : GraphNode, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
GraphNode
ObjectIdGraphNode
Implements
IDisposable
Inherited Members
 GraphNode.In(int)
 GraphNode.Out(int)
 GraphNode.CycleIn(int)
 GraphNode.CycleOut(int)
 GraphNode.AddRefTo(GraphNode)
 GraphNode.RemoveRefTo(GraphNode)
 GraphNode.DisconnectAll()
 GraphNode.IsMarkedAs(int)
 GraphNode.MarkAs(byte)
 GraphNode.Clear(byte)
 GraphNode.MarkTree(byte, GraphNodeCollection)
 GraphNode.SetEdgeGrowthRate(int, int)
 GraphNode.IsCycleNode
 GraphNode.NumCycleIn
 GraphNode.NumCycleOut
 GraphNode.Owner
 GraphNode.NextCycleNode
 GraphNode.NumIn
 GraphNode.NumOut
 GraphNode.Data
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ObjectIdGraphNode(ObjectId)
public ObjectIdGraphNode(ObjectId id)
Parameters
id ObjectId
Properties
 Id
public ObjectId Id { get; }
Property Value
ObjectId
Methods
 Create(IntPtr, bool)
public static ObjectIdGraphNode Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
ObjectIdGraphNode