Table of Contents
 Class HostApplicationServices
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbHostApplicationServices")]
public abstract class HostApplicationServices : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
HostApplicationServices
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 HostApplicationServices()
protected HostApplicationServices()
Properties
 AllUsersRootFolder
public virtual string AllUsersRootFolder { get; }
Property Value
string
 AlternateFontName
public virtual string AlternateFontName { get; }
Property Value
string
 ColorBookLocation
public virtual string ColorBookLocation { get; }
Property Value
string
 CompanyName
public virtual string CompanyName { get; }
Property Value
string
 Current
public static HostApplicationServices Current { get; set; }
Property Value
HostApplicationServices
 FontMapFileName
public virtual string FontMapFileName { get; }
Property Value
string
 LocalRootFolder
public virtual string LocalRootFolder { get; }
Property Value
string
 MachineRegistryProductRootKey
public virtual string MachineRegistryProductRootKey { get; }
Property Value
string
 ModelerFlavor
public virtual ModelerFlavor ModelerFlavor { get; }
Property Value
ModelerFlavor
 Product
public virtual string Product { get; }
Property Value
string
 Program
public virtual string Program { get; }
Property Value
string
 RoamableRootFolder
public virtual string RoamableRootFolder { get; }
Property Value
string
 UserRegistryProductRootKey
public virtual string UserRegistryProductRootKey { get; }
Property Value
string
 WorkingDatabase
public static Database WorkingDatabase { get; set; }
Property Value
Database
 releaseMarketVersion
public virtual string releaseMarketVersion { get; }
Property Value
string
Methods
 FatalError(string)
public virtual void FatalError(string message)
Parameters
message string
 FindFile(string, Database, FindFileHint)
public abstract string FindFile(string fileName, Database database, FindFileHint hint)
Parameters
fileName string
database Database
hint FindFileHint
Returns
string
 GetEnvironmentVariable(string)
public virtual string GetEnvironmentVariable(string name)
Parameters
name string
Returns
string
 GetPassword(string, PasswordOptions)
public virtual string GetPassword(string dwgName, PasswordOptions options)
Parameters
dwgName string
options PasswordOptions
Returns
string
 GetRemoteFile(Uri, bool)
public virtual string GetRemoteFile(Uri url, bool ignoreCache)
Parameters
url Uri
ignoreCache bool
Returns
string
 GetUrl(string)
public virtual Uri GetUrl(string localFile)
Parameters
localFile string
Returns
Uri
 IsCloudFile(string)
public virtual bool IsCloudFile(string filePath)
Parameters
filePath string
Returns
bool
 IsUrl(string)
public virtual bool IsUrl(string filePath)
Parameters
filePath string
Returns
bool
 LoadApplication(string, ApplicationLoadReasons, bool, bool)
public virtual void LoadApplication(string appName, ApplicationLoadReasons why, bool printIt, bool asCmd)
Parameters
appName string
why ApplicationLoadReasons
printIt bool
asCmd bool
 NotifyCorruptDrawingFoundOnOpen(ObjectId, ErrorStatus)
public virtual bool NotifyCorruptDrawingFoundOnOpen(ObjectId id, ErrorStatus es)
Parameters
id ObjectId
es ErrorStatus
Returns
bool
 PutRemoteFile(Uri, string)
public virtual void PutRemoteFile(Uri url, string localFile)
Parameters
url Uri
localFile string
 UserBreak()
public virtual bool UserBreak()
Returns
bool