Table of Contents
 Enum PathOption
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::PathOption")]
public enum PathOption
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AbsolutePath = 3
NoPath = 1
PathAndFile = 4
RelativePath = 2