Table of Contents
 Class WebLightTraits
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiWebLightTraits")]
public abstract class WebLightTraits : PointLightTraits, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
SubEntityTraits
DrawableTraits
NonEntityTraits
LightTraits
StandardLightTraits
PointLightTraits
WebLightTraits
Implements
IDisposable
ICloneable
Inherited Members
 PointLightTraits.HasTarget
 PointLightTraits.TargetLocation
 PointLightTraits.LampColor
 PointLightTraits.PhysicalIntensity
 PointLightTraits.Attenuation
 PointLightTraits.Position
 StandardLightTraits.Shadow
 StandardLightTraits.LightColor
 StandardLightTraits.Intensity
 LightTraits.On
 NonEntityTraits.SetupForEntity(Entity)
 NonEntityTraits.SetSelectionMarker(IntPtr)
 NonEntityTraits.AddLight(ObjectId)
 NonEntityTraits.SetLayerFlags(DrawableTraits.LayerFlags)
 NonEntityTraits.SetHighlightProperty(DrawableTraits.HighlightProperty, object)
 NonEntityTraits.GetHighlightProperty(DrawableTraits.HighlightProperty)
 NonEntityTraits.SelectionFlags
 NonEntityTraits.LinePattern
 NonEntityTraits.Fill
 NonEntityTraits.SelectionOnlyGeometry
 NonEntityTraits.ShadowFlags
 NonEntityTraits.DrawFlags
 NonEntityTraits.VisualStyle
 NonEntityTraits.Sectionable
 NonEntityTraits.Mapper
 NonEntityTraits.Material
 NonEntityTraits.PlotStyleDescriptor
 NonEntityTraits.Thickness
 NonEntityTraits.LineTypeScale
 NonEntityTraits.LineWeight
 NonEntityTraits.FillType
 NonEntityTraits.LineType
 NonEntityTraits.Layer
 NonEntityTraits.Transparency
 NonEntityTraits.TrueColor
 NonEntityTraits.Color
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 WebLightTraits()
public WebLightTraits()
 WebLightTraits(IntPtr, bool)
protected WebLightTraits(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 WebFile
public abstract string WebFile { get; set; }
Property Value
string
 WebFileType
public abstract WebFileType WebFileType { get; set; }
Property Value
WebFileType
 WebFlux
public abstract double WebFlux { get; set; }
Property Value
double
 WebHorzAng90to270
public abstract bool WebHorzAng90to270 { get; set; }
Property Value
bool
 WebRotation
public abstract Vector3d WebRotation { get; set; }
Property Value
Vector3d
 WebSymmetry
public abstract WebSymmetry WebSymmetry { get; set; }
Property Value
WebSymmetry