Table of Contents
 Class LinearEntity3d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeLinearEnt3d")]
public abstract class LinearEntity3d : Curve3d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
Curve3d
LinearEntity3d
Implements
IDisposable
ICloneable
Derived
Line3d
LineSegment3d
Ray3d
Inherited Members
 Curve3d.GetInterval()
 Curve3d.SetInterval(Interval)
 Curve3d.GetReverseParameterCurve()
 Curve3d.GetDistanceTo(Curve3d)
 Curve3d.GetDistanceTo(Curve3d, Tolerance)
 Curve3d.GetDistanceTo(Point3d)
 Curve3d.GetDistanceTo(Point3d, Tolerance)
 Curve3d.GetClosestPointTo(Curve3d)
 Curve3d.GetClosestPointTo(Curve3d, Tolerance)
 Curve3d.GetClosestPointTo(Point3d)
 Curve3d.GetClosestPointTo(Point3d, Tolerance)
 Curve3d.GetProjectedClosestPointTo(Curve3d, Vector3d)
 Curve3d.GetProjectedClosestPointTo(Curve3d, Vector3d, Tolerance)
 Curve3d.GetProjectedClosestPointTo(Point3d, Vector3d)
 Curve3d.GetProjectedClosestPointTo(Point3d, Vector3d, Tolerance)
 Curve3d.GetNormalPoint(Point3d)
 Curve3d.GetNormalPoint(Point3d, Tolerance)
 Curve3d.GetBoundBlockOf(Interval)
 Curve3d.GetOrthoBoundBlockOf(Interval)
 Curve3d.GetProjectedEntity(Plane, Vector3d)
 Curve3d.GetProjectedEntity(Plane, Vector3d, Tolerance)
 Curve3d.GetOrthoProjectEntity(Plane)
 Curve3d.GetOrthoProjectEntity(Plane, Tolerance)
 Curve3d.IsOn(double)
 Curve3d.IsOn(double, Tolerance)
 Curve3d.IsOn(Point3d, out double)
 Curve3d.IsOn(Point3d, out double, Tolerance)
 Curve3d.IsOn(Point3d)
 Curve3d.IsOn(Point3d, Tolerance)
 Curve3d.GetParameterOf(Point3d)
 Curve3d.GetParameterOf(Point3d, Tolerance)
 Curve3d.GetTrimmedOffset(double, Vector3d, OffsetCurveExtensionType)
 Curve3d.GetTrimmedOffset(double, Vector3d, OffsetCurveExtensionType, Tolerance)
 Curve3d.IsClosed()
 Curve3d.IsClosed(Tolerance)
 Curve3d.IsPlanar(out Plane)
 Curve3d.IsPlanar(out Plane, Tolerance)
 Curve3d.IsLinear(out Line3d)
 Curve3d.IsLinear(out Line3d, Tolerance)
 Curve3d.IsCoplanarWith(Curve3d, out Plane)
 Curve3d.IsCoplanarWith(Curve3d, out Plane, Tolerance)
 Curve3d.IsPeriodic(out double)
 Curve3d.IsDegenerate(out Entity3d)
 Curve3d.IsDegenerate(out Entity3d, Tolerance)
 Curve3d.GetLength(double, double, double)
 Curve3d.GetParameterAtLength(double, double, bool, double)
 Curve3d.GetArea(double, double)
 Curve3d.GetArea(double, double, Tolerance)
 Curve3d.GetSplitCurves(double)
 Curve3d.Explode(Interval)
 Curve3d.EvaluatePoint(double)
 Curve3d.GetSamplePoints(int)
 Curve3d.GetSamplePoints(double, double, double)
 Curve3d.GetNewSamplePoints(double, double, double)
 Curve3d.EndPoint
 Curve3d.StartPoint
 Curve3d.HasEndPoint
 Curve3d.HasStartPoint
 Curve3d.OrthoBoundBlock
 Curve3d.BoundBlock
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Direction
public Vector3d Direction { get; }
Property Value
Vector3d
 PointOnLine
public Point3d PointOnLine { get; }
Property Value
Point3d
Methods
 Create(IntPtr, bool)
public static LinearEntity3d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
LinearEntity3d
 GetLine()
public Line3d GetLine()
Returns
Line3d
 GetPerpendicularPlane(Point3d)
public Plane GetPerpendicularPlane(Point3d intersectionPoint)
Parameters
intersectionPoint Point3d
Returns
Plane
 IntersectWith(LinearEntity3d)
public Point3d[] IntersectWith(LinearEntity3d line)
Parameters
line LinearEntity3d
Returns
Point3d[]
 IntersectWith(LinearEntity3d, Tolerance)
public Point3d[] IntersectWith(LinearEntity3d line, Tolerance tolerance)
Parameters
line LinearEntity3d
tolerance Tolerance
Returns
Point3d[]
 IntersectWith(PlanarEntity)
public Point3d[] IntersectWith(PlanarEntity plane)
Parameters
plane PlanarEntity
Returns
Point3d[]
 IntersectWith(PlanarEntity, Tolerance)
public Point3d[] IntersectWith(PlanarEntity plane, Tolerance tolerance)
Parameters
plane PlanarEntity
tolerance Tolerance
Returns
Point3d[]
 IsColinearTo(LinearEntity3d)
public bool IsColinearTo(LinearEntity3d line)
Parameters
line LinearEntity3d
Returns
bool
 IsColinearTo(LinearEntity3d, Tolerance)
public bool IsColinearTo(LinearEntity3d line, Tolerance tolerance)
Parameters
line LinearEntity3d
tolerance Tolerance
Returns
bool
 IsOn(Plane)
public bool IsOn(Plane plane)
Parameters
plane Plane
Returns
bool
 IsOn(Plane, Tolerance)
public bool IsOn(Plane plane, Tolerance tolerance)
Parameters
plane Plane
tolerance Tolerance
Returns
bool
 IsParallelTo(LinearEntity3d)
public bool IsParallelTo(LinearEntity3d line)
Parameters
line LinearEntity3d
Returns
bool
 IsParallelTo(LinearEntity3d, Tolerance)
public bool IsParallelTo(LinearEntity3d line, Tolerance tolerance)
Parameters
line LinearEntity3d
tolerance Tolerance
Returns
bool
 IsParallelTo(PlanarEntity)
public bool IsParallelTo(PlanarEntity plane)
Parameters
plane PlanarEntity
Returns
bool
 IsParallelTo(PlanarEntity, Tolerance)
public bool IsParallelTo(PlanarEntity plane, Tolerance tolerance)
Parameters
plane PlanarEntity
tolerance Tolerance
Returns
bool
 IsPerpendicularTo(LinearEntity3d)
public bool IsPerpendicularTo(LinearEntity3d line)
Parameters
line LinearEntity3d
Returns
bool
 IsPerpendicularTo(LinearEntity3d, Tolerance)
public bool IsPerpendicularTo(LinearEntity3d line, Tolerance tolerance)
Parameters
line LinearEntity3d
tolerance Tolerance
Returns
bool
 IsPerpendicularTo(PlanarEntity)
public bool IsPerpendicularTo(PlanarEntity plane)
Parameters
plane PlanarEntity
Returns
bool
 IsPerpendicularTo(PlanarEntity, Tolerance)
public bool IsPerpendicularTo(PlanarEntity plane, Tolerance tolerance)
Parameters
plane PlanarEntity
tolerance Tolerance
Returns
bool
 Overlap(LinearEntity3d)
public LinearEntity3d Overlap(LinearEntity3d line)
Parameters
line LinearEntity3d
Returns
LinearEntity3d
 Overlap(LinearEntity3d, Tolerance)
public LinearEntity3d Overlap(LinearEntity3d line, Tolerance tolerance)
Parameters
line LinearEntity3d
tolerance Tolerance
Returns
LinearEntity3d
 ProjectedIntersectWith(LinearEntity3d, Vector3d)
public Point3d[] ProjectedIntersectWith(LinearEntity3d line, Vector3d projectionDirection)
Parameters
line LinearEntity3d
projectionDirection Vector3d
Returns
Point3d[]
 ProjectedIntersectWith(LinearEntity3d, Vector3d, Tolerance)
public Point3d[] ProjectedIntersectWith(LinearEntity3d line, Vector3d projectionDirection, Tolerance tolerance)
Parameters
line LinearEntity3d
projectionDirection Vector3d
tolerance Tolerance
Returns
Point3d[]