Table of Contents
 Class PointCloudExtractor
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
[Wrapper("AcPointCloudExtractor")]
public class PointCloudExtractor : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
PointCloudExtractor
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 PointCloudExtractor()
public PointCloudExtractor()
Methods
 AppendLineProfile(PointCloudExtractResult, ObjectId, string, Color)
public static ObjectIdCollection AppendLineProfile(PointCloudExtractResult profile, ObjectId spaceId, string layer, Color color)
Parameters
profile PointCloudExtractResult
spaceId ObjectId
layer string
color Color
Returns
ObjectIdCollection
 AppendPolylineProfile(PointCloudExtractResult, ObjectId, string, Color, double)
public static ObjectIdCollection AppendPolylineProfile(PointCloudExtractResult profile, ObjectId spaceId, string layer, Color color, double polylineWidth)
Parameters
profile PointCloudExtractResult
spaceId ObjectId
layer string
color Color
polylineWidth double
Returns
ObjectIdCollection
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 Extract(PointCloudEx, Vector3d, Vector3d, Point3d, ExtractOption, IPointCloudExtractionProgressCallback)
public static PointCloudExtractResult Extract(PointCloudEx pointCloud, Vector3d planZDirection, Vector3d planXDirection, Point3d pointOnPlan, ExtractOption extractOption, IPointCloudExtractionProgressCallback progress)
Parameters
pointCloud PointCloudEx
planZDirection Vector3d
planXDirection Vector3d
pointOnPlan Point3d
extractOption ExtractOption
progress IPointCloudExtractionProgressCallback
Returns
PointCloudExtractResult