Table of Contents
 Struct PlotStyleDescriptor
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct PlotStyleDescriptor
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 PlotStyleDescriptor(ObjectId, PlotStyleNameType)
public PlotStyleDescriptor(ObjectId id, PlotStyleNameType type)
Parameters
id ObjectId
type PlotStyleNameType
Properties
 Id
public ObjectId Id { get; }
Property Value
ObjectId
 Type
public PlotStyleNameType Type { get; }
Property Value
PlotStyleNameType
Methods
 Equals(object)
public override sealed bool Equals(object unmanagedObjPtr)
Parameters
unmanagedObjPtr object
Returns
bool
 GetHashCode()
public int GetHashCode()
Returns
int
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
Operators
 operator ==(PlotStyleDescriptor, PlotStyleDescriptor)
public static bool operator ==(PlotStyleDescriptor a, PlotStyleDescriptor b)
Parameters
a PlotStyleDescriptor
b PlotStyleDescriptor
Returns
bool
 operator !=(PlotStyleDescriptor, PlotStyleDescriptor)
public static bool operator !=(PlotStyleDescriptor a, PlotStyleDescriptor b)
Parameters
a PlotStyleDescriptor
b PlotStyleDescriptor
Returns
bool