Table of Contents
 Class ObjectContextCollection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbObjectContextCollection")]
public abstract class ObjectContextCollection : RXObject, IDisposable, ICloneable, IEnumerable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
ObjectContextCollection
Implements
IDisposable
ICloneable
IEnumerable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ObjectContextCollection(IntPtr)
protected ObjectContextCollection(IntPtr unmanagedPointer)
Parameters
unmanagedPointer IntPtr
Properties
 CurrentContext
public virtual ObjectContext CurrentContext { get; set; }
Property Value
ObjectContext
 Name
public virtual string Name { get; }
Property Value
string
Methods
 AddContext(ObjectContext)
public virtual void AddContext(ObjectContext ctxt)
Parameters
ctxt ObjectContext
 GetContext(string)
public virtual ObjectContext GetContext(string contextName)
Parameters
contextName string
Returns
ObjectContext
 GetEnumerator()
public ObjectContextCollectionEnumerator GetEnumerator()
Returns
ObjectContextCollectionEnumerator
 HasContext(string)
public virtual bool HasContext(string contextName)
Parameters
contextName string
Returns
bool
 RemoveContext(string)
public virtual void RemoveContext(string contextName)
Parameters
contextName string
Explicit Interface Implementations
 IEnumerable.GetEnumerator()
virtual IEnumerator IEnumerable.GetEnumerator()
Returns
IEnumerator