Table of Contents
 Class Dictionary
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
[Wrapper("AcRxDictionary")]
public class Dictionary : RXObject, IDisposable, ICloneable, IDictionary, ICollection, IEnumerable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Dictionary
Implements
IDisposable
ICloneable
IDictionary
ICollection
IEnumerable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Dictionary(IntPtr, bool)
protected Dictionary(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 Count
public virtual int Count { get; }
Property Value
int
 DeletesObjects
public virtual bool DeletesObjects { get; }
Property Value
bool
 IsCaseSensitive
public virtual bool IsCaseSensitive { get; }
Property Value
bool
 IsSorted
public virtual bool IsSorted { get; }
Property Value
bool
 this[string]
public virtual RXObject this[string key] { get; set; }
Parameters
key string
Property Value
RXObject
Methods
 At(int)
public virtual RXObject At(int id)
Parameters
id int
Returns
RXObject
 At(string)
public virtual RXObject At(string key)
Parameters
key string
Returns
RXObject
 AtKeyAndIdPut(string, int, RXObject)
public virtual void AtKeyAndIdPut(string newKey, int id, RXObject value)
Parameters
newKey string
id int
value RXObject
 AtPut(int, RXObject)
public virtual RXObject AtPut(int id, RXObject value)
Parameters
id int
value RXObject
Returns
RXObject
 AtPut(string, RXObject)
public RXObject AtPut(string key, RXObject value)
Parameters
key string
value RXObject
Returns
RXObject
 AtPut(string, RXObject, out int)
public virtual RXObject AtPut(string key, RXObject value, out int retId)
Parameters
key string
value RXObject
retId int
Returns
RXObject
 Contains(int)
public virtual bool Contains(int id)
Parameters
id int
Returns
bool
 Contains(string)
public virtual bool Contains(string key)
Parameters
key string
Returns
bool
 CopyTo(DictionaryEntry[], int)
public void CopyTo(DictionaryEntry[] array, int index)
Parameters
array DictionaryEntry[]
index int
 IDictionary.get_IsFixedSize()
protected bool IDictionary.get_IsFixedSize()
Returns
bool
 IDictionary.get_IsReadOnly()
protected bool IDictionary.get_IsReadOnly()
Returns
bool
 IDictionary.get_IsSynchronized()
protected bool IDictionary.get_IsSynchronized()
Returns
bool
 IDictionary.get_Keys()
protected ICollection IDictionary.get_Keys()
Returns
ICollection
 IDictionary.get_SyncRoot()
protected object IDictionary.get_SyncRoot()
Returns
object
 IDictionary.get_Values()
protected ICollection IDictionary.get_Values()
Returns
ICollection
 IdAt(string)
public virtual int IdAt(string key)
Parameters
key string
Returns
int
 KeyAt(int)
public virtual string KeyAt(int id)
Parameters
id int
Returns
string
 Remove(int)
public virtual RXObject Remove(int id)
Parameters
id int
Returns
RXObject
 Remove(string)
public virtual RXObject Remove(string key)
Parameters
key string
Returns
RXObject
 ResetKey(int, string)
public virtual void ResetKey(int id, string newKey)
Parameters
id int
newKey string
 ResetKey(string, string)
public virtual void ResetKey(string oldKey, string newKey)
Parameters
oldKey string
newKey string
Explicit Interface Implementations
 GetEnumerator()
virtual IDictionaryEnumerator GetEnumerator()
Returns
IDictionaryEnumerator
 ICollection.CopyTo(Array, int)
virtual void ICollection.CopyTo(Array array, int index)
Parameters
array Array
index int
 IDictionary.Add(object, object)
virtual void IDictionary.Add(object key, object value)
Parameters
key object
value object
 IDictionary.Clear()
virtual void IDictionary.Clear()
 IDictionary.Contains(object)
virtual bool IDictionary.Contains(object key)
Parameters
key object
Returns
bool
 IDictionary.Remove(object)
virtual void IDictionary.Remove(object key)
Parameters
key object
 IDictionary.get_Item(object)
object IDictionary.get_Item(object key)
Parameters
key object
Returns
object
 IDictionary.set_Item(object, object)
void IDictionary.set_Item(object key, object value)
Parameters
key object
value object
 IEnumerable.GetEnumerator()
virtual IEnumerator IEnumerable.GetEnumerator()
Returns
IEnumerator
 IsFixedSize
virtual bool IsFixedSize { get; }
Returns
bool
 IsReadOnly
virtual bool IsReadOnly { get; }
Returns
bool
 IsSynchronized
virtual bool IsSynchronized { get; }
Returns
bool
 Keys
ICollection Keys { get; }
Returns
ICollection
 SyncRoot
object SyncRoot { get; }
Returns
object
 Values
virtual ICollection Values { get; }
Returns
ICollection