Table of Contents
 Enum RadiusDiameterConstraint.RadDiaConstrType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum RadiusDiameterConstraint.RadDiaConstrType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CircleDiameter = 1
CircleRadius = 0
MajorRadius = 3
MinorRadius = 2