Table of Contents
 Class DetailViewStyle
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDetailViewStyle")]
public class DetailViewStyle : DBObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
DetailViewStyle
Implements
IDisposable
ICloneable
Inherited Members
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DetailViewStyle()
public DetailViewStyle()
 DetailViewStyle(IntPtr, bool)
protected DetailViewStyle(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 ArrowSymbolColor
public virtual Color ArrowSymbolColor { get; set; }
Property Value
Color
 ArrowSymbolId
public ObjectId ArrowSymbolId { get; set; }
Property Value
ObjectId
 ArrowSymbolSize
public double ArrowSymbolSize { get; set; }
Property Value
double
 BorderLineColor
public Color BorderLineColor { get; set; }
Property Value
Color
 BorderLineTypeId
public ObjectId BorderLineTypeId { get; set; }
Property Value
ObjectId
 BorderLineWeight
public LineWeight BorderLineWeight { get; set; }
Property Value
LineWeight
 BoundaryLineColor
public Color BoundaryLineColor { get; set; }
Property Value
Color
 BoundaryLineTypeId
public ObjectId BoundaryLineTypeId { get; set; }
Property Value
ObjectId
 BoundaryLineWeight
public LineWeight BoundaryLineWeight { get; set; }
Property Value
LineWeight
 ConnectionLineColor
public Color ConnectionLineColor { get; set; }
Property Value
Color
 ConnectionLineTypeId
public ObjectId ConnectionLineTypeId { get; set; }
Property Value
ObjectId
 ConnectionLineWeight
public LineWeight ConnectionLineWeight { get; set; }
Property Value
LineWeight
 Description
public string Description { get; set; }
Property Value
string
 IdentifierColor
public virtual Color IdentifierColor { get; set; }
Property Value
Color
 IdentifierHeight
public double IdentifierHeight { get; set; }
Property Value
double
 IdentifierOffset
public double IdentifierOffset { get; set; }
Property Value
double
 IdentifierPlacement
public DetailViewIdentifierPlacement IdentifierPlacement { get; set; }
Property Value
DetailViewIdentifierPlacement
 IdentifierStyleId
public ObjectId IdentifierStyleId { get; set; }
Property Value
ObjectId
 IsModifiedForRecompute
public bool IsModifiedForRecompute { get; }
Property Value
bool
 ModelEdge
public DetailViewModelEdge ModelEdge { get; set; }
Property Value
DetailViewModelEdge
 Name
public string Name { get; set; }
Property Value
string
 ShowArrowheads
public bool ShowArrowheads { get; set; }
Property Value
bool
 ShowViewLabel
public bool ShowViewLabel { get; set; }
Property Value
bool
 ViewLabelAlignment
public ModelDocViewLabelAlignmentType ViewLabelAlignment { get; set; }
Property Value
ModelDocViewLabelAlignmentType
 ViewLabelAttachment
public ModelDocViewLabelAttachmentPoint ViewLabelAttachment { get; set; }
Property Value
ModelDocViewLabelAttachmentPoint
 ViewLabelOffset
public double ViewLabelOffset { get; set; }
Property Value
double
 ViewLabelPattern
public string ViewLabelPattern { get; set; }
Property Value
string
 ViewLabelTextColor
public Color ViewLabelTextColor { get; set; }
Property Value
Color
 ViewLabelTextHeight
public double ViewLabelTextHeight { get; set; }
Property Value
double
 ViewLabelTextStyleId
public ObjectId ViewLabelTextStyleId { get; set; }
Property Value
ObjectId
Methods
 DefaultViewName(int)
public string DefaultViewName(int index)
Parameters
index int
Returns
string
 GetViewLabelPattern(Field)
public string GetViewLabelPattern(Field field)
Parameters
field Field
Returns
string
 PostViewStyleToDb(Database, string)
public ObjectId PostViewStyleToDb(Database dataBasePointer, string styleName)
Parameters
dataBasePointer Database
styleName string
Returns
ObjectId
 SetDatabaseDefaults(Database)
public void SetDatabaseDefaults(Database dataBasePointer)
Parameters
dataBasePointer Database
 SetViewLabelPattern(string, Field)
public void SetViewLabelPattern(string pattern, Field field)
Parameters
pattern string
field Field
 ValidateViewName(string)
public bool ValidateViewName(string name)
Parameters
name string
Returns
bool