Table of Contents
 Struct MeshFaceterData
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct MeshFaceterData
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 MeshFaceterData(double, double, double, double, ushort, ushort, ushort, short)
public MeshFaceterData(double surface, double normal, double gRatio, double eLength, ushort numGrid, ushort uGrid, ushort vGrid, short mType)
Parameters
surface double
normal double
gRatio double
eLength double
numGrid ushort
uGrid ushort
vGrid ushort
mType short
Properties
 FaceterDevNormal
public double FaceterDevNormal { get; set; }
Property Value
double
 FaceterDevSurface
public double FaceterDevSurface { get; set; }
Property Value
double
 FaceterGridRatio
public double FaceterGridRatio { get; set; }
Property Value
double
 FaceterMaxEdgeLength
public double FaceterMaxEdgeLength { get; set; }
Property Value
double
 FaceterMaxGrid
public ushort FaceterMaxGrid { get; set; }
Property Value
ushort
 FaceterMeshType
public short FaceterMeshType { get; set; }
Property Value
short
 FaceterMinUGrid
public ushort FaceterMinUGrid { get; set; }
Property Value
ushort
 FaceterMinVGrid
public ushort FaceterMinVGrid { get; set; }
Property Value
ushort