Table of Contents
 Class Configuration
Namespace
Autodesk.AutoCAD.GraphicsSystem
Assembly
Acdbmgd.dll
[Wrapper("AcGsConfig")]
public class Configuration : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Configuration
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Configuration()
public Configuration()
 Configuration(IntPtr, bool)
protected Configuration(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 AdaptiveDegradation
public bool AdaptiveDegradation { get; set; }
Property Value
bool
 CurrentDisplayDriver
public DriverInfo CurrentDisplayDriver { get; }
Property Value
DriverInfo
 CurveTessellationTolerance
public int CurveTessellationTolerance { get; set; }
Property Value
int
 DefaultHardwareAcceleratedDriver
public DriverInfo DefaultHardwareAcceleratedDriver { get; }
Property Value
DriverInfo
 DiscardBackFaces
public bool DiscardBackFaces { get; set; }
Property Value
bool
 DriverName
public string DriverName { get; }
Property Value
string
 DriverRevision
public int DriverRevision { get; }
Property Value
int
 DriverSearchPath
public string DriverSearchPath { get; set; }
Property Value
string
 DriverVersion
public int DriverVersion { get; }
Property Value
int
 DynamicTessellation
public bool DynamicTessellation { get; set; }
Property Value
bool
 FrameRate
public int FrameRate { get; set; }
Property Value
int
 GenerateVertexNormals
public bool GenerateVertexNormals { get; set; }
Property Value
bool
 Handedness
public Handedness Handedness { get; set; }
Property Value
Handedness
 HardwareAcceleratedDriver
public DriverInfo HardwareAcceleratedDriver { get; set; }
Property Value
DriverInfo
 MaxLODs
public int MaxLODs { get; set; }
Property Value
int
 RedrawOnWindowExpose
public bool RedrawOnWindowExpose { get; set; }
Property Value
bool
 SurfaceTessellationTolerance
public int SurfaceTessellationTolerance { get; set; }
Property Value
int
 Transparency
public Quality Transparency { get; set; }
Property Value
Quality
Methods
 Configure()
public bool Configure()
Returns
bool
 Create(IntPtr, bool)
public static Configuration Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
Configuration
 DegradationChainPosition(DegradationChannel)
public int DegradationChainPosition(DegradationChannel channel)
Parameters
channel DegradationChannel
Returns
int
 DegradationChannelAt(int)
public DegradationChannel DegradationChannelAt(int order)
Parameters
order int
Returns
DegradationChannel
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 GetCanDegradeChannel(DegradationChannel)
public bool GetCanDegradeChannel(DegradationChannel channel)
Parameters
channel DegradationChannel
Returns
bool
 GetCertificationData()
public CertificationData GetCertificationData()
Returns
CertificationData
 GetEffectList(EffectListType)
public List<EffectStatus> GetEffectList(EffectListType type)
Parameters
type EffectListType
Returns
List<EffectStatus>
 GetHardwareAcceleratedDrivers()
public DriverInfo[] GetHardwareAcceleratedDrivers()
Returns
DriverInfo[]
 GetVirtualDeviceName()
public string GetVirtualDeviceName()
Returns
string
 IsFeatureAvailable(UniqueString)
public bool IsFeatureAvailable(UniqueString feature)
Parameters
feature UniqueString
Returns
bool
 IsFeatureEnabled(UniqueString)
public bool IsFeatureEnabled(UniqueString feature)
Parameters
feature UniqueString
Returns
bool
 IsFeatureRecommended(UniqueString)
public bool IsFeatureRecommended(UniqueString feature)
Parameters
feature UniqueString
Returns
bool
 IsHardwareAccelerationAvailable()
public bool IsHardwareAccelerationAvailable()
Returns
bool
 IsHardwareAccelerationEnabled()
public bool IsHardwareAccelerationEnabled()
Returns
bool
 IsHardwareAccelerationRecommended()
public bool IsHardwareAccelerationRecommended()
Returns
bool
 IsNoHardwareOverrideEnabled()
public bool IsNoHardwareOverrideEnabled()
Returns
bool
 SetCanDegradeChannel(DegradationChannel, bool)
public void SetCanDegradeChannel(DegradationChannel channel, bool degrade)
Parameters
channel DegradationChannel
degrade bool
 SetFeatureEnabled(UniqueString, bool)
public void SetFeatureEnabled(UniqueString feature, bool enable)
Parameters
feature UniqueString
enable bool
 ShiftDegradationChainPosition(DegradationChannel, bool)
public void ShiftDegradationChainPosition(DegradationChannel channel, bool shiftDown)
Parameters
channel DegradationChannel
shiftDown bool
 ShowConfigDialog(string)
public bool ShowConfigDialog(string dlgType)
Parameters
dlgType string
Returns
bool
 setHardwareAcceleration(bool)
public void setHardwareAcceleration(bool bEnable)
Parameters
bEnable bool