Table of Contents
 Enum Vertex3dType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::Vertex3dType")]
public enum Vertex3dType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ControlVertex = 1
FitVertex = 2
SimpleVertex = 0