Table of Contents
 Class GripOverrule
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbGripOverrule")]
public abstract class GripOverrule : Overrule, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Overrule
GripOverrule
Implements
IDisposable
ICloneable
Inherited Members
 Overrule.AddOverrule(RXClass, Overrule, bool)
 Overrule.RemoveOverrule(RXClass, Overrule)
 Overrule.HasOverrule(RXObject, RXClass)
 Overrule.IsApplicable(RXObject)
 Overrule.Overruling
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 GripOverrule()
protected GripOverrule()
Methods
 GetGripPoints(Entity, GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
public virtual void GetGripPoints(Entity entity, GripDataCollection grips, double curViewUnitSize, int gripSize, Vector3d curViewDir, GetGripPointsFlags bitFlags)
Parameters
entity Entity
grips GripDataCollection
curViewUnitSize double
gripSize int
curViewDir Vector3d
bitFlags GetGripPointsFlags
 GetGripPoints(Entity, Point3dCollection, IntegerCollection, IntegerCollection)
public virtual void GetGripPoints(Entity entity, Point3dCollection gripPoints, IntegerCollection snapModes, IntegerCollection geometryIds)
Parameters
entity Entity
gripPoints Point3dCollection
snapModes IntegerCollection
geometryIds IntegerCollection
 GetStretchPoints(Entity, Point3dCollection)
public virtual void GetStretchPoints(Entity entity, Point3dCollection stretchPoints)
Parameters
entity Entity
stretchPoints Point3dCollection
 MoveGripPointsAt(Entity, GripDataCollection, Vector3d, MoveGripPointsFlags)
public virtual void MoveGripPointsAt(Entity entity, GripDataCollection grips, Vector3d offset, MoveGripPointsFlags bitFlags)
Parameters
entity Entity
grips GripDataCollection
offset Vector3d
bitFlags MoveGripPointsFlags
 MoveGripPointsAt(Entity, IntegerCollection, Vector3d)
public virtual void MoveGripPointsAt(Entity entity, IntegerCollection indices, Vector3d offset)
Parameters
entity Entity
indices IntegerCollection
offset Vector3d
 MoveStretchPointsAt(Entity, IntegerCollection, Vector3d)
public virtual void MoveStretchPointsAt(Entity entity, IntegerCollection indices, Vector3d offset)
Parameters
entity Entity
indices IntegerCollection
offset Vector3d
 OnGripStatusChanged(Entity, GripStatus)
public virtual void OnGripStatusChanged(Entity entity, GripStatus status)
Parameters
entity Entity
status GripStatus
 SetCustomFilter()
public override sealed void SetCustomFilter()
 SetExtensionDictionaryEntryFilter(string)
public override sealed void SetExtensionDictionaryEntryFilter(string entryName)
Parameters
entryName string
 SetIdFilter(ObjectId[])
public override sealed void SetIdFilter(ObjectId[] ids)
Parameters
ids ObjectId[]
 SetNoFilter()
public override sealed void SetNoFilter()
 SetXDataFilter(string)
public override sealed void SetXDataFilter(string registeredApplicationName)
Parameters
registeredApplicationName string