Table of Contents
 Enum SectionHeight
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbSection::Height")]
public enum SectionHeight
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
HeightAboveSectionLine = 1
HeightBelowSectionLine = 2