Table of Contents
 Enum Projection
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiMapper::Projection")]
public enum Projection
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Box = 2
Cylinder = 3
InheritProjection = 0
Planar = 1
Sphere = 4