Table of Contents
 Enum CompareReturnStatus
Namespace
Autodesk.AutoCAD.DatabaseServices.Internal
Assembly
Acdbmgd.dll
public enum CompareReturnStatus
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
HistoryCompare = 1
RawBinaryCompare = 2
UnableToCompare = 0