Table of Contents
 Struct RegionAreaProperties
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct RegionAreaProperties
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Properties
 Area
[UnitType(UnitType.Area)]
public double Area { get; }
Property Value
double
 Centroid
public Point2d Centroid { get; }
Property Value
Point2d
 Extents
public Extents2d Extents { get; }
Property Value
Extents2d
 MomentsOfInertia
public Vector2d MomentsOfInertia { get; }
Property Value
Vector2d
 Perimeter
[UnitType(UnitType.Distance)]
public double Perimeter { get; }
Property Value
double
 this[int]
public Vector2d this[int c] { get; }
Parameters
c int
Property Value
Vector2d
 PrincipalMoments
public Vector2d PrincipalMoments { get; }
Property Value
Vector2d
 ProductOfInertia
public double ProductOfInertia { get; }
Property Value
double
 RadiiOfGyration
public Vector2d RadiiOfGyration { get; }
Property Value
Vector2d