Table of Contents
 Class UnderlayHost
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbUnderlayHost")]
public sealed class UnderlayHost
Inheritance
object
UnderlayHost
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 DgnDocHost
public static UnderlayHost DgnDocHost { get; }
Property Value
UnderlayHost
 DgnHost
public static UnderlayHost DgnHost { get; }
Property Value
UnderlayHost
 DwfHost
public static UnderlayHost DwfHost { get; }
Property Value
UnderlayHost
 PdfHost
public static UnderlayHost PdfHost { get; }
Property Value
UnderlayHost
Methods
 GetFile(string, string)
public UnderlayFile GetFile(string path, string password)
Parameters
path string
password string
Returns
UnderlayFile