Table of Contents
 Enum PlotRotation
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbPlotSettings::PlotRotation")]
public enum PlotRotation
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Degrees000 = 0
Degrees090 = 1
Degrees180 = 2
Degrees270 = 3