Table of Contents
 Struct NurbCurve3dData
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public struct NurbCurve3dData
Inherited Members
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Properties
 ControlPoints
public Point3dCollection ControlPoints { get; }
Property Value
Point3dCollection
 Degree
public int Degree { get; }
Property Value
int
 Knots
public KnotCollection Knots { get; }
Property Value
KnotCollection
 Periodic
public bool Periodic { get; }
Property Value
bool
 Rational
public bool Rational { get; }
Property Value
bool
 Weights
public DoubleCollection Weights { get; }
Property Value
DoubleCollection
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 IsEqualTo(NurbCurve3dData)
public bool IsEqualTo(NurbCurve3dData a)
Parameters
a NurbCurve3dData
Returns
bool
Operators
 operator ==(NurbCurve3dData, NurbCurve3dData)
public static bool operator ==(NurbCurve3dData a, NurbCurve3dData b)
Parameters
a NurbCurve3dData
b NurbCurve3dData
Returns
bool
 operator !=(NurbCurve3dData, NurbCurve3dData)
public static bool operator !=(NurbCurve3dData a, NurbCurve3dData b)
Parameters
a NurbCurve3dData
b NurbCurve3dData
Returns
bool