Table of Contents
 Struct EntityColor
Namespace
Autodesk.AutoCAD.Colors
Assembly
Acdbmgd.dll
[Wrapper("AcCmEntityColor")]
public struct EntityColor
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 EntityColor(ColorMethod)
public EntityColor(ColorMethod value)
Parameters
value ColorMethod
 EntityColor(ColorMethod, short)
public EntityColor(ColorMethod value, short index)
Parameters
value ColorMethod
index short
 EntityColor(byte, byte, byte)
public EntityColor(byte red, byte green, byte blue)
Parameters
red byte
green byte
blue byte
 EntityColor(int)
public EntityColor(int trueColor)
Parameters
trueColor int
Properties
 Blue
public byte Blue { get; }
Property Value
byte
 ColorIndex
public short ColorIndex { get; }
Property Value
short
 ColorMethod
public ColorMethod ColorMethod { get; }
Property Value
ColorMethod
 Green
public byte Green { get; }
Property Value
byte
 IsByAci
public bool IsByAci { get; }
Property Value
bool
 IsByBlock
public bool IsByBlock { get; }
Property Value
bool
 IsByColor
public bool IsByColor { get; }
Property Value
bool
 IsByLayer
public bool IsByLayer { get; }
Property Value
bool
 IsByPen
public bool IsByPen { get; }
Property Value
bool
 IsForeground
public bool IsForeground { get; }
Property Value
bool
 IsLayerFrozen
public bool IsLayerFrozen { get; }
Property Value
bool
 IsLayerFrozenOrOff
public bool IsLayerFrozenOrOff { get; }
Property Value
bool
 IsLayerOff
public bool IsLayerOff { get; }
Property Value
bool
 IsNone
public bool IsNone { get; }
Property Value
bool
 LayerIndex
public short LayerIndex { get; }
Property Value
short
 PenIndex
public short PenIndex { get; }
Property Value
short
 Red
public byte Red { get; }
Property Value
byte
 TrueColor
public int TrueColor { get; }
Property Value
int
Methods
 LookUpAci(byte, byte, byte)
public static byte LookUpAci(byte red, byte green, byte blue)
Parameters
red byte
green byte
blue byte
Returns
byte
 LookUpRgb(byte)
public static int LookUpRgb(byte colorIndex)
Parameters
colorIndex byte
Returns
int
Operators
 operator ==(EntityColor, EntityColor)
public static bool operator ==(EntityColor a, EntityColor b)
Parameters
a EntityColor
b EntityColor
Returns
bool
 operator !=(EntityColor, EntityColor)
public static bool operator !=(EntityColor a, EntityColor b)
Parameters
a EntityColor
b EntityColor
Returns
bool