Table of Contents
 Class HatchPatternDefinition
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiHatchPatternDefinition")]
public sealed class HatchPatternDefinition : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
HatchPatternDefinition
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 HatchPatternDefinition(double, double, double, double, double, DoubleCollection)
public HatchPatternDefinition(double angle, double baseX, double baseY, double offsetX, double offsetY, DoubleCollection dashList)
Parameters
angle double
baseX double
baseY double
offsetX double
offsetY double
dashList DoubleCollection
Properties
 Angle
public double Angle { get; }
Property Value
double
 BaseX
public double BaseX { get; }
Property Value
double
 BaseY
public double BaseY { get; }
Property Value
double
 DashList
public DoubleCollection DashList { get; }
Property Value
DoubleCollection
 OffsetX
public double OffsetX { get; }
Property Value
double
 OffsetY
public double OffsetY { get; }
Property Value
double
Methods
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()