Table of Contents
 Class DrawableOverrule
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiDrawableOverrule")]
public abstract class DrawableOverrule : Overrule, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Overrule
DrawableOverrule
Implements
IDisposable
ICloneable
Inherited Members
 Overrule.AddOverrule(RXClass, Overrule, bool)
 Overrule.RemoveOverrule(RXClass, Overrule)
 Overrule.HasOverrule(RXObject, RXClass)
 Overrule.IsApplicable(RXObject)
 Overrule.Overruling
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DrawableOverrule()
protected DrawableOverrule()
Methods
 SetAttributes(Drawable, DrawableTraits)
public virtual int SetAttributes(Drawable drawable, DrawableTraits traits)
Parameters
drawable Drawable
traits DrawableTraits
Returns
int
 SetCustomFilter()
public override sealed void SetCustomFilter()
 SetExtensionDictionaryEntryFilter(string)
public override sealed void SetExtensionDictionaryEntryFilter(string entryName)
Parameters
entryName string
 SetIdFilter(ObjectId[])
public override sealed void SetIdFilter(ObjectId[] ids)
Parameters
ids ObjectId[]
 SetNoFilter()
public override sealed void SetNoFilter()
 SetXDataFilter(string)
public override sealed void SetXDataFilter(string registeredApplicationName)
Parameters
registeredApplicationName string
 ViewportDraw(Drawable, ViewportDraw)
public virtual void ViewportDraw(Drawable drawable, ViewportDraw vd)
Parameters
drawable Drawable
vd ViewportDraw
 ViewportDrawLogicalFlags(Drawable, ViewportDraw)
public virtual int ViewportDrawLogicalFlags(Drawable drawable, ViewportDraw vd)
Parameters
drawable Drawable
vd ViewportDraw
Returns
int
 WorldDraw(Drawable, WorldDraw)
public virtual bool WorldDraw(Drawable drawable, WorldDraw wd)
Parameters
drawable Drawable
wd WorldDraw
Returns
bool