Table of Contents
 Class DataLinkManager
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDataLinkManager")]
public sealed class DataLinkManager : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
DataLinkManager
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 DataLinkCount
public int DataLinkCount { get; }
Property Value
int
Methods
 AddDataLink(DataLink)
public ObjectId AddDataLink(DataLink dataLink)
Parameters
dataLink DataLink
Returns
ObjectId
 GetDataLink()
public ObjectIdCollection GetDataLink()
Returns
ObjectIdCollection
 GetDataLink(string)
public ObjectId GetDataLink(string name)
Parameters
name string
Returns
ObjectId
 RemoveDataLink(ObjectId)
public void RemoveDataLink(ObjectId idDataLink)
Parameters
idDataLink ObjectId
 RemoveDataLink(string)
public ObjectId RemoveDataLink(string name)
Parameters
name string
Returns
ObjectId
 Update(ObjectIdCollection, UpdateDirection, UpdateOption)
public void Update(ObjectIdCollection dataIds, UpdateDirection direction, UpdateOption option)
Parameters
dataIds ObjectIdCollection
direction UpdateDirection
option UpdateOption
 Update(UpdateDirection, UpdateOption)
public void Update(UpdateDirection direction, UpdateOption option)
Parameters
direction UpdateDirection
option UpdateOption