Table of Contents
 Class Interop
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public sealed class Interop
Inheritance
object
Interop
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Methods
 AttachUnmanagedObject(DisposableWrapper, IntPtr, bool)
public static void AttachUnmanagedObject(DisposableWrapper obj, IntPtr unmanagedPointer, bool autoDelete)
Parameters
obj DisposableWrapper
unmanagedPointer IntPtr
autoDelete bool
 Check(int)
public static void Check(int returnValue)
Parameters
returnValue int
 CheckAds(int)
public static void CheckAds(int returnValue)
Parameters
returnValue int
 CheckAdsForCancel(int)
public static bool CheckAdsForCancel(int returnValue)
Parameters
returnValue int
Returns
bool
 CheckBool(bool)
public static void CheckBool(bool returnValue)
Parameters
returnValue bool
 CheckBoolean(int)
public static void CheckBoolean(int returnValue)
Parameters
returnValue int
 CheckNull(IntPtr)
public static void CheckNull(IntPtr returnValue)
Parameters
returnValue IntPtr
 DetachUnmanagedObject(DisposableWrapper)
public static void DetachUnmanagedObject(DisposableWrapper obj)
Parameters
obj DisposableWrapper
 SetAutoDelete(DisposableWrapper, bool)
public static void SetAutoDelete(DisposableWrapper obj, bool value)
Parameters
obj DisposableWrapper
value bool
 ThrowExceptionForErrorStatus(int)
public static void ThrowExceptionForErrorStatus(int errorStatus)
Parameters
errorStatus int