Table of Contents
 Class BlendOptions
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbBlendOptions")]
public sealed class BlendOptions : DisposableWrapper, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
BlendOptions
Implements
IDisposable
ICloneable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 BlendOptions()
public BlendOptions()
 BlendOptions(BlendOptions)
protected BlendOptions(BlendOptions other)
Parameters
other BlendOptions
 BlendOptions(IntPtr, bool)
protected BlendOptions(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 CoplanarDirection
public Vector3d? CoplanarDirection { get; }
Property Value
Vector3d?
 CoplanarPoint
public Point3d? CoplanarPoint { get; }
Property Value
Point3d?
 DriveMode
public BlendOptions.DriveModeType DriveMode { get; }
Property Value
BlendOptions.DriveModeType
 Quality
public uint Quality { get; }
Property Value
uint
 Simplify
public bool Simplify { get; }
Property Value
bool
 Solid
public bool Solid { get; }
Property Value
bool
Methods
 Clone()
public object Clone()
Returns
object
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()