Table of Contents
 Enum SurfaceSurfaceIntersectorType
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGe::ssiType")]
public enum SurfaceSurfaceIntersectorType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AntiTangent = 2
Tangent = 1
Transverse = 0