Table of Contents
 Enum LongTransactionType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::LongTransactionType")]
public enum LongTransactionType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
SameDb = 0
UnrelatedDb = 2
XRefDb = 1