Table of Contents
 Class MarbleTexture
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiMarbleTexture")]
public sealed class MarbleTexture : ProceduralTexture, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
MaterialTexture
ProceduralTexture
MarbleTexture
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 MarbleTexture()
public MarbleTexture()
 MarbleTexture(IntPtr, bool)
protected MarbleTexture(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 StoneColor
public MaterialColor StoneColor { get; set; }
Property Value
MaterialColor
 VeinColor
public MaterialColor VeinColor { get; set; }
Property Value
MaterialColor
 VeinSpacing
public double VeinSpacing { get; set; }
Property Value
double
 VeinWidth
public double VeinWidth { get; set; }
Property Value
double
Methods
 Clone()
public MarbleTexture Clone()
Returns
MarbleTexture
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 Set(MarbleTexture)
public void Set(MarbleTexture value)
Parameters
value MarbleTexture
Operators
 operator ==(MarbleTexture, MarbleTexture)
public static bool operator ==(MarbleTexture a, MarbleTexture b)
Parameters
a MarbleTexture
b MarbleTexture
Returns
bool
 operator !=(MarbleTexture, MarbleTexture)
public static bool operator !=(MarbleTexture a, MarbleTexture b)
Parameters
a MarbleTexture
b MarbleTexture
Returns
bool