Table of Contents
 Class ExternalSurface
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeExternalSurface")]
public sealed class ExternalSurface : Surface, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
Surface
ExternalSurface
Implements
IDisposable
ICloneable
Inherited Members
 Surface.GetClosestPointTo(Point3d)
 Surface.GetClosestPointTo(Point3d, Tolerance)
 Surface.GetEnvelope()
 Surface.ParameterOf(Point3d)
 Surface.ParameterOf(Point3d, Tolerance)
 Surface.IsOn(Point3d, Point2d)
 Surface.IsOn(Point3d, Point2d, Tolerance)
 Surface.ClosestPointTo(Point3d)
 Surface.ClosestPointTo(Point3d, Tolerance)
 Surface.DistanceTo(Point3d)
 Surface.DistanceTo(Point3d, Tolerance)
 Surface.IsClosedInU()
 Surface.IsClosedInU(Tolerance)
 Surface.IsClosedInV()
 Surface.IsClosedInV(Tolerance)
 Surface.EvaluatePoint(Point2d, int, ref Vector3dCollection, ref Vector3d)
 Surface.EvaluatePoint(Point2d, int, ref Vector3dCollection)
 Surface.EvaluatePoint(Point2d)
 Surface.ReverseNormal
 Surface.IsNormalReversed
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.IsOn(Point3d)
 Entity3d.IsOn(Point3d, Tolerance)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ExternalSurface()
public ExternalSurface()
 ExternalSurface(IntPtr, ExternalEntityKind)
public ExternalSurface(IntPtr surfaceDefinition, ExternalEntityKind surfaceKind)
Parameters
surfaceDefinition IntPtr
surfaceKind ExternalEntityKind
 ExternalSurface(IntPtr, bool)
protected ExternalSurface(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 ExternalSurfaceDefiniton
public IntPtr ExternalSurfaceDefiniton { get; }
Property Value
IntPtr
 ExternalSurfaceKind
public ExternalEntityKind ExternalSurfaceKind { get; }
Property Value
ExternalEntityKind
 IsCone
public bool IsCone { get; }
Property Value
bool
 IsCylinder
public bool IsCylinder { get; }
Property Value
bool
 IsDefined
public bool IsDefined { get; }
Property Value
bool
 IsNativeSurface
public bool IsNativeSurface { get; }
Property Value
bool
 IsNurbSurface
public bool IsNurbSurface { get; }
Property Value
bool
 IsOwnerOfSurface
public bool IsOwnerOfSurface { get; }
Property Value
bool
 IsPlane
public bool IsPlane { get; }
Property Value
bool
 IsSphere
public bool IsSphere { get; }
Property Value
bool
 IsTorus
public bool IsTorus { get; }
Property Value
bool
 nativeSurface
public Surface nativeSurface { get; }
Property Value
Surface
Methods
 Create(IntPtr, bool)
public static ExternalSurface Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
ExternalSurface
 Set(IntPtr, ExternalEntityKind)
public void Set(IntPtr surfaceDef, ExternalEntityKind surfaceKind)
Parameters
surfaceDef IntPtr
surfaceKind ExternalEntityKind
 SetToOwnSurface()
public void SetToOwnSurface()