Table of Contents
 Class AutoConstrainEvaluationCallback
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcAutoConstrainEvaluationCallback")]
public class AutoConstrainEvaluationCallback : IDisposable
Inheritance
object
AutoConstrainEvaluationCallback
Implements
IDisposable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AutoConstrainEvaluationCallback()
public AutoConstrainEvaluationCallback()
 AutoConstrainEvaluationCallback(AcAutoConstrainEvaluationCallback*, bool)
protected AutoConstrainEvaluationCallback(AcAutoConstrainEvaluationCallback* impObj, bool autoDelete)
Parameters
impObj AcAutoConstrainEvaluationCallback*
autoDelete bool
Properties
 IsEvaluationCancelled
public virtual bool IsEvaluationCancelled { get; }
Property Value
bool
Methods
 Dispose()
public override sealed void Dispose()
 Dispose(bool)
protected virtual void Dispose(bool A_0)
Parameters
A_0 bool
 GetAutoConstrainPriority()
public virtual GeometricalConstraint.ConstraintType[] GetAutoConstrainPriority()
Returns
ConstraintType[]
 GetConstraintPriorityOverride(ConstraintType, ConstrainedGeometry[])
public virtual int GetConstraintPriorityOverride(GeometricalConstraint.ConstraintType type, ConstrainedGeometry[] geometries)
Parameters
type GeometricalConstraint.ConstraintType
geometries ConstrainedGeometry[]
Returns
int
 GetTotalConstraints(ref GeometricalConstraint[])
public int GetTotalConstraints(ref GeometricalConstraint[] constraints)
Parameters
constraints GeometricalConstraint[]
Returns
int