Table of Contents
 Class DBDictionary
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDictionary")]
public class DBDictionary : DBObject, IDisposable, ICloneable, IDictionary, ICollection, IEnumerable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
DBDictionary
Implements
IDisposable
ICloneable
IDictionary
ICollection
IEnumerable
Derived
DictionaryWithDefaultDictionary
Inherited Members
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DBDictionary()
public DBDictionary()
 DBDictionary(IntPtr, bool)
protected DBDictionary(IntPtr obj, bool autoDelete)
Parameters
obj IntPtr
autoDelete bool
Properties
 Count
public virtual int Count { get; }
Property Value
int
 IncludingErased
public DBDictionary IncludingErased { get; }
Property Value
DBDictionary
 this[string]
public object this[string key] { get; set; }
Parameters
key string
Property Value
object
 MergeStyle
public override DuplicateRecordCloning MergeStyle { get; set; }
Property Value
DuplicateRecordCloning
 SkipDeleted
protected bool SkipDeleted { get; }
Property Value
bool
 TreatElementsAsHard
public bool TreatElementsAsHard { get; set; }
Property Value
bool
Methods
 Contains(ObjectId)
public bool Contains(ObjectId objId)
Parameters
objId ObjectId
Returns
bool
 Contains(string)
public bool Contains(string entryName)
Parameters
entryName string
Returns
bool
 Copy()
protected virtual DBDictionary Copy()
Returns
DBDictionary
 CopyTo(DBDictionaryEntry[], int)
public void CopyTo(DBDictionaryEntry[] array, int index)
Parameters
array DBDictionaryEntry[]
index int
 GetAt(string)
public virtual ObjectId GetAt(string entryName)
Parameters
entryName string
Returns
ObjectId
 GetEnumerator()
public DbDictionaryEnumerator GetEnumerator()
Returns
DbDictionaryEnumerator
 IDictionary.get_IsFixedSize()
protected bool IDictionary.get_IsFixedSize()
Returns
bool
 IDictionary.get_IsReadOnly()
protected bool IDictionary.get_IsReadOnly()
Returns
bool
 IDictionary.get_IsSynchronized()
protected bool IDictionary.get_IsSynchronized()
Returns
bool
 IDictionary.get_Keys()
protected ICollection IDictionary.get_Keys()
Returns
ICollection
 IDictionary.get_SyncRoot()
protected object IDictionary.get_SyncRoot()
Returns
object
 IDictionary.get_Values()
protected ICollection IDictionary.get_Values()
Returns
ICollection
 NameAt(ObjectId)
public virtual string NameAt(ObjectId objId)
Parameters
objId ObjectId
Returns
string
 Remove(ObjectId)
public void Remove(ObjectId objId)
Parameters
objId ObjectId
 Remove(string)
public ObjectId Remove(string key)
Parameters
key string
Returns
ObjectId
 SetAt(string, DBObject)
public ObjectId SetAt(string searchKey, DBObject newValue)
Parameters
searchKey string
newValue DBObject
Returns
ObjectId
 SetName(string, string)
public void SetName(string oldName, string newName)
Parameters
oldName string
newName string
Explicit Interface Implementations
 ICollection.CopyTo(Array, int)
virtual void ICollection.CopyTo(Array array, int index)
Parameters
array Array
index int
 IDictionary.Add(object, object)
virtual void IDictionary.Add(object key, object value)
Parameters
key object
value object
 IDictionary.Clear()
virtual void IDictionary.Clear()
 IDictionary.Contains(object)
virtual bool IDictionary.Contains(object key)
Parameters
key object
Returns
bool
 IDictionary.GetEnumerator()
virtual IDictionaryEnumerator IDictionary.GetEnumerator()
Returns
IDictionaryEnumerator
 IDictionary.Remove(object)
virtual void IDictionary.Remove(object key)
Parameters
key object
 IDictionary.get_Item(object)
object IDictionary.get_Item(object key)
Parameters
key object
Returns
object
 IDictionary.set_Item(object, object)
void IDictionary.set_Item(object key, object value)
Parameters
key object
value object
 IEnumerable.GetEnumerator()
virtual IEnumerator IEnumerable.GetEnumerator()
Returns
IEnumerator
 IsFixedSize
virtual bool IsFixedSize { get; }
Returns
bool
 IsReadOnly
virtual bool IsReadOnly { get; }
Returns
bool
 IsSynchronized
virtual bool IsSynchronized { get; }
Returns
bool
 Keys
ICollection Keys { get; }
Returns
ICollection
 SyncRoot
object SyncRoot { get; }
Returns
object
 Values
virtual ICollection Values { get; }
Returns
ICollection