Table of Contents
 Class BlockPropertiesTableColumnCollection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class BlockPropertiesTableColumnCollection : ICollection, IEnumerable
Inheritance
object
BlockPropertiesTableColumnCollection
Implements
ICollection
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Count
public virtual int Count { get; }
Property Value
int
 IsSynchronized
public virtual bool IsSynchronized { get; }
Property Value
bool
 this[int]
public BlockPropertiesTableColumn this[int index] { get; }
Parameters
index int
Property Value
BlockPropertiesTableColumn
 SyncRoot
public virtual object SyncRoot { get; }
Property Value
object
Methods
 AddAt(ObjectId, string, int)
public void AddAt(ObjectId id, string parameterName, int index)
Parameters
id ObjectId
parameterName string
index int
 AddItem(ObjectId, string)
public void AddItem(ObjectId id, string parameterName)
Parameters
id ObjectId
parameterName string
 Clear()
public void Clear()
 ContainsColumn(ObjectId, string)
public bool ContainsColumn(ObjectId id, string parameterName)
Parameters
id ObjectId
parameterName string
Returns
bool
 CopyTo(Array, int)
public virtual void CopyTo(Array array, int index)
Parameters
array Array
index int
 GetEnumerator()
public virtual IEnumerator GetEnumerator()
Returns
IEnumerator
 GetIndex(BlockPropertiesTableColumn)
public int GetIndex(BlockPropertiesTableColumn column)
Parameters
column BlockPropertiesTableColumn
Returns
int
 Move(BlockPropertiesTableColumn, int)
public void Move(BlockPropertiesTableColumn column, int newIndex)
Parameters
column BlockPropertiesTableColumn
newIndex int
 Move(int, int)
public void Move(int index, int newIndex)
Parameters
index int
newIndex int
 Remove(BlockPropertiesTableColumn)
public void Remove(BlockPropertiesTableColumn column)
Parameters
column BlockPropertiesTableColumn
 Remove(int)
public void Remove(int index)
Parameters
index int