Table of Contents
 Enum SourceType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("ViewBorder::SourceType")]
public enum SourceType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
FusionSource = 2
InventorSource = 1
ModelSpaceSource = 3
SourceNotDefined = 0