Table of Contents
 Class DxfFiler
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDxfFiler")]
public abstract class DxfFiler : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
DxfFiler
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DxfFiler(IntPtr, bool)
protected DxfFiler(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 AtEmbeddedObjectStart
public virtual bool AtEmbeddedObjectStart { get; }
Property Value
bool
 AtEndOfFile
public virtual bool AtEndOfFile { get; }
Property Value
bool
 AtEndOfObject
public virtual bool AtEndOfObject { get; }
Property Value
bool
 AtExtendedData
public virtual bool AtExtendedData { get; }
Property Value
bool
 Database
public Database Database { get; }
Property Value
Database
 DwgVersion
public FullDwgVersion DwgVersion { get; }
Property Value
FullDwgVersion
 Elevation
[UnitType(UnitType.Distance)]
public virtual double Elevation { get; }
Property Value
double
 ErrorMessage
public virtual string ErrorMessage { get; }
Property Value
string
 FilerType
public FilerType FilerType { get; }
Property Value
FilerType
 IncludesDefaultValues
public bool IncludesDefaultValues { get; }
Property Value
bool
 IsModifyingExistingObject
public virtual bool IsModifyingExistingObject { get; }
Property Value
bool
 Precision
public virtual int Precision { get; set; }
Property Value
int
 Thickness
[UnitType(UnitType.Distance)]
public virtual double Thickness { get; }
Property Value
double
Methods
 AtSubclassData(string)
public virtual bool AtSubclassData(string value)
Parameters
value string
Returns
bool
 FilerStatus()
public virtual void FilerStatus()
 HaltAtClassBoundaries(bool)
public virtual void HaltAtClassBoundaries(bool value)
Parameters
value bool
 PushBackItem()
public virtual void PushBackItem()
 ReadResultBuffer()
public virtual ResultBuffer ReadResultBuffer()
Returns
ResultBuffer
 ResetFilerStatus()
public virtual void ResetFilerStatus()
 RewindFiler()
public virtual int RewindFiler()
Returns
int
 SetError(ErrorStatus, string, params string[])
public virtual void SetError(ErrorStatus value, string format, params string[] values)
Parameters
value ErrorStatus
format string
values string[]
 SetError(string, params string[])
public virtual void SetError(string format, params string[] values)
Parameters
format string
values string[]
 WriteBool(DxfCode, bool)
public virtual void WriteBool(DxfCode opCode, bool value)
Parameters
opCode DxfCode
value bool
 WriteBoolean(DxfCode, bool)
public virtual void WriteBoolean(DxfCode opCode, bool value)
Parameters
opCode DxfCode
value bool
 WriteByte(DxfCode, byte)
public virtual void WriteByte(DxfCode opCode, byte value)
Parameters
opCode DxfCode
value byte
 WriteBytes(DxfCode, byte[])
public virtual void WriteBytes(DxfCode opCode, byte[] chunk)
Parameters
opCode DxfCode
chunk byte[]
 WriteDouble(DxfCode, double, int)
public virtual void WriteDouble(DxfCode opCode, double value, int precision)
Parameters
opCode DxfCode
value double
precision int
 WriteEmbeddedObjectStart()
public virtual void WriteEmbeddedObjectStart()
 WriteHandle(DxfCode, Handle)
public virtual void WriteHandle(DxfCode opCode, Handle value)
Parameters
opCode DxfCode
value Handle
 WriteInt16(DxfCode, short)
public virtual void WriteInt16(DxfCode opCode, short value)
Parameters
opCode DxfCode
value short
 WriteInt32(DxfCode, int)
public virtual void WriteInt32(DxfCode opCode, int value)
Parameters
opCode DxfCode
value int
 WriteInt64(DxfCode, long)
public virtual void WriteInt64(DxfCode opCode, long value)
Parameters
opCode DxfCode
value long
 WriteObjectId(DxfCode, ObjectId)
public virtual void WriteObjectId(DxfCode opCode, ObjectId value)
Parameters
opCode DxfCode
value ObjectId
 WritePoint2d(DxfCode, Point2d, int)
public virtual void WritePoint2d(DxfCode opCode, Point2d value, int precision)
Parameters
opCode DxfCode
value Point2d
precision int
 WritePoint3d(DxfCode, Point3d, int)
public virtual void WritePoint3d(DxfCode opCode, Point3d value, int precision)
Parameters
opCode DxfCode
value Point3d
precision int
 WriteResultBuffer(ResultBuffer)
public virtual void WriteResultBuffer(ResultBuffer buffer)
Parameters
buffer ResultBuffer
 WriteScale3d(DxfCode, Scale3d, int)
public virtual void WriteScale3d(DxfCode opCode, Scale3d value, int precision)
Parameters
opCode DxfCode
value Scale3d
precision int
 WriteString(DxfCode, string)
public virtual void WriteString(DxfCode opCode, string value)
Parameters
opCode DxfCode
value string
 WriteUInt16(DxfCode, ushort)
public virtual void WriteUInt16(DxfCode opCode, ushort value)
Parameters
opCode DxfCode
value ushort
 WriteUInt32(DxfCode, uint)
public virtual void WriteUInt32(DxfCode opCode, uint value)
Parameters
opCode DxfCode
value uint
 WriteUInt64(DxfCode, ulong)
public virtual void WriteUInt64(DxfCode opCode, ulong value)
Parameters
opCode DxfCode
value ulong
 WriteVector2d(DxfCode, Vector2d, int)
public virtual void WriteVector2d(DxfCode opCode, Vector2d value, int precision)
Parameters
opCode DxfCode
value Vector2d
precision int
 WriteVector3d(DxfCode, Vector3d, int)
public virtual void WriteVector3d(DxfCode opCode, Vector3d value, int precision)
Parameters
opCode DxfCode
value Vector3d
precision int
 WriteXDataStart()
public virtual void WriteXDataStart()