Table of Contents
 Class PathRef
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbPathRef")]
public class PathRef : GeomRef, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
GeomRef
PathRef
Implements
IDisposable
ICloneable
Inherited Members
 GeomRef.Reset()
 GeomRef.IsEmpty
 GeomRef.IsValid
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 PathRef()
public PathRef()
 PathRef(EdgeRef[])
public PathRef(EdgeRef[] edges)
Parameters
edges EdgeRef[]
 PathRef(FullSubentityPath[], FullSubentityPath[])
public PathRef(FullSubentityPath[] edgeSubentPathArr, FullSubentityPath[] faceSubentPathArr)
Parameters
edgeSubentPathArr FullSubentityPath[]
faceSubentPathArr FullSubentityPath[]
 PathRef(IntPtr, bool)
protected PathRef(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 EdgeRefs
public EdgeRef[] EdgeRefs { get; set; }
Property Value
EdgeRef[]
Methods
 GetEntityArray(bool)
public Entity[] GetEntityArray(bool bConcatenate)
Parameters
bConcatenate bool
Returns
Entity[]
 IsEqualTo(Curve3d)
public bool IsEqualTo(Curve3d curve)
Parameters
curve Curve3d
Returns
bool
 IsReferencePath()
public bool IsReferencePath()
Returns
bool