Table of Contents
 Struct RenderGlobal.DimensionsParameter
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct RenderGlobal.DimensionsParameter
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 DimensionsParameter(int, int)
public DimensionsParameter(int w, int h)
Parameters
w int
h int
Properties
 Height
public int Height { get; }
Property Value
int
 Width
public int Width { get; }
Property Value
int