Table of Contents
 Struct CoordinateSystem2d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public struct CoordinateSystem2d : IFormattable
Implements
IFormattable
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 CoordinateSystem2d(Point2d, Vector2d, Vector2d)
public CoordinateSystem2d(Point2d o, Vector2d x, Vector2d y)
Parameters
o Point2d
x Vector2d
y Vector2d
Properties
 Origin
public Point2d Origin { get; }
Property Value
Point2d
 Xaxis
public Vector2d Xaxis { get; }
Property Value
Vector2d
 Yaxis
public Vector2d Yaxis { get; }
Property Value
Vector2d
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 IsEqualTo(CoordinateSystem2d)
public bool IsEqualTo(CoordinateSystem2d a)
Parameters
a CoordinateSystem2d
Returns
bool
 IsEqualTo(CoordinateSystem2d, Tolerance)
public bool IsEqualTo(CoordinateSystem2d a, Tolerance tolerance)
Parameters
a CoordinateSystem2d
tolerance Tolerance
Returns
bool
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
 ToString(string, IFormatProvider)
public string ToString(string format, IFormatProvider provider)
Parameters
format string
provider IFormatProvider
Returns
string
Operators
 operator ==(CoordinateSystem2d, CoordinateSystem2d)
public static bool operator ==(CoordinateSystem2d a, CoordinateSystem2d b)
Parameters
a CoordinateSystem2d
b CoordinateSystem2d
Returns
bool
 operator !=(CoordinateSystem2d, CoordinateSystem2d)
public static bool operator !=(CoordinateSystem2d a, CoordinateSystem2d b)
Parameters
a CoordinateSystem2d
b CoordinateSystem2d
Returns
bool