Table of Contents
 Struct Font
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct Font
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 Font(string, bool)
public Font(string name, bool isTrueType)
Parameters
name string
isTrueType bool
Properties
 IsTrueType
public bool IsTrueType { get; }
Property Value
bool
 Name
public string Name { get; }
Property Value
string