Table of Contents
 Enum ShadowSamplingMultiplier
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMentalRayRenderSettings::ShadowSamplingMultiplier")]
public enum ShadowSamplingMultiplier
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
SamplingMultiplierOne = 4
SamplingMultiplierOneEighth = 1
SamplingMultiplierOneFourth = 2
SamplingMultiplierOneHalf = 3
SamplingMultiplierTwo = 5
SamplingMultiplierZero = 0