Table of Contents
 Delegate ProxyResurrectionCompletedEventHandler
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public delegate void ProxyResurrectionCompletedEventHandler(object sender, ProxyResurrectionCompletedEventArgs e)
Parameters
sender object
e ProxyResurrectionCompletedEventArgs
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ProxyResurrectionCompletedEventHandler(object, IntPtr)
public ProxyResurrectionCompletedEventHandler(object A_0, IntPtr A_1)
Parameters
A_0 object
A_1 IntPtr
Methods
 BeginInvoke(object, ProxyResurrectionCompletedEventArgs, AsyncCallback, object)
public IAsyncResult BeginInvoke(object sender, ProxyResurrectionCompletedEventArgs e, AsyncCallback callback, object obj)
Parameters
sender object
e ProxyResurrectionCompletedEventArgs
callback AsyncCallback
obj object
Returns
IAsyncResult
 EndInvoke(IAsyncResult)
public void EndInvoke(IAsyncResult result)
Parameters
result IAsyncResult
 Invoke(object, ProxyResurrectionCompletedEventArgs)
public void Invoke(object sender, ProxyResurrectionCompletedEventArgs e)
Parameters
sender object
e ProxyResurrectionCompletedEventArgs