Table of Contents
 Enum RapidRTLightingMode
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiLightingMode")]
public enum RapidRTLightingMode
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Advanced = 2
Basic = 1
Simplified = 0