Table of Contents
 Struct SubentityId
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbSubentId")]
public struct SubentityId
Inherited Members
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 SubentityId(SubentityType, long)
[Obsolete("Use the overload taking IntPtr.")]
public SubentityId(SubentityType type, long i)
Parameters
type SubentityType
i long
 SubentityId(SubentityType, IntPtr)
public SubentityId(SubentityType type, IntPtr i)
Parameters
type SubentityType
i IntPtr
 SubentityId(RXClass, long)
[Obsolete("Use the overload taking IntPtr.")]
public SubentityId(RXClass classType, long i)
Parameters
classType RXClass
i long
 SubentityId(RXClass, IntPtr)
public SubentityId(RXClass classType, IntPtr i)
Parameters
classType RXClass
i IntPtr
Properties
 Index
[Obsolete("Use the overload returning IntPtr.")]
public int Index { get; }
Property Value
int
 IndexPtr
public IntPtr IndexPtr { get; }
Property Value
IntPtr
 Null
public static SubentityId Null { get; }
Property Value
SubentityId
 Type
public SubentityType Type { get; }
Property Value
SubentityType
 TypeClass
public RXClass TypeClass { get; }
Property Value
RXClass
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
Operators
 operator ==(SubentityId, SubentityId)
public static bool operator ==(SubentityId a, SubentityId id)
Parameters
a SubentityId
id SubentityId
Returns
bool
 operator !=(SubentityId, SubentityId)
public static bool operator !=(SubentityId a, SubentityId id)
Parameters
a SubentityId
id SubentityId
Returns
bool