Table of Contents
 Class PointEntity3d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGePointEnt3d")]
public abstract class PointEntity3d : Entity3d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
PointEntity3d
Implements
IDisposable
ICloneable
Derived
PointOnCurve3d
PointOnSurface
Position3d
Inherited Members
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.IsOn(Point3d)
 Entity3d.IsOn(Point3d, Tolerance)
 Entity3d.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Methods
 Create(IntPtr, bool)
public static PointEntity3d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
PointEntity3d
 GetPoint()
public Point3d GetPoint()
Returns
Point3d