Table of Contents
 Class PlanarEntity
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGePlanarEnt")]
public abstract class PlanarEntity : Surface, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
Surface
PlanarEntity
Implements
IDisposable
ICloneable
Derived
BoundedPlane
Plane
Inherited Members
 Surface.GetClosestPointTo(Point3d)
 Surface.GetClosestPointTo(Point3d, Tolerance)
 Surface.GetEnvelope()
 Surface.ParameterOf(Point3d)
 Surface.ParameterOf(Point3d, Tolerance)
 Surface.IsOn(Point3d, Point2d)
 Surface.IsOn(Point3d, Point2d, Tolerance)
 Surface.ClosestPointTo(Point3d)
 Surface.ClosestPointTo(Point3d, Tolerance)
 Surface.DistanceTo(Point3d)
 Surface.DistanceTo(Point3d, Tolerance)
 Surface.IsClosedInU()
 Surface.IsClosedInU(Tolerance)
 Surface.IsClosedInV()
 Surface.IsClosedInV(Tolerance)
 Surface.EvaluatePoint(Point2d, int, ref Vector3dCollection, ref Vector3d)
 Surface.EvaluatePoint(Point2d, int, ref Vector3dCollection)
 Surface.EvaluatePoint(Point2d)
 Surface.ReverseNormal
 Surface.IsNormalReversed
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.IsOn(Point3d)
 Entity3d.IsOn(Point3d, Tolerance)
 Entity3d.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Coefficients
public PlanarEquationCoefficients Coefficients { get; }
Property Value
PlanarEquationCoefficients
 Normal
public Vector3d Normal { get; }
Property Value
Vector3d
 PointOnPlane
public Point3d PointOnPlane { get; }
Property Value
Point3d
Methods
 ClosestPointToLinearEntity(LinearEntity3d)
public Point3d[] ClosestPointToLinearEntity(LinearEntity3d line)
Parameters
line LinearEntity3d
Returns
Point3d[]
 ClosestPointToLinearEntity(LinearEntity3d, Tolerance)
public Point3d[] ClosestPointToLinearEntity(LinearEntity3d line, Tolerance tolerance)
Parameters
line LinearEntity3d
tolerance Tolerance
Returns
Point3d[]
 ClosestPointToPlanarEntity(PlanarEntity)
public Point3d[] ClosestPointToPlanarEntity(PlanarEntity otherPlane)
Parameters
otherPlane PlanarEntity
Returns
Point3d[]
 ClosestPointToPlanarEntity(PlanarEntity, Tolerance)
public Point3d[] ClosestPointToPlanarEntity(PlanarEntity otherPlane, Tolerance tolerance)
Parameters
otherPlane PlanarEntity
tolerance Tolerance
Returns
Point3d[]
 Create(IntPtr, bool)
public static PlanarEntity Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
PlanarEntity
 GetCoordinateSystem()
public CoordinateSystem3d GetCoordinateSystem()
Returns
CoordinateSystem3d
 IntersectWith(LinearEntity3d)
public Point3d[] IntersectWith(LinearEntity3d linearEntity)
Parameters
linearEntity LinearEntity3d
Returns
Point3d[]
 IntersectWith(LinearEntity3d, Tolerance)
public Point3d[] IntersectWith(LinearEntity3d linearEntity, Tolerance tolerance)
Parameters
linearEntity LinearEntity3d
tolerance Tolerance
Returns
Point3d[]
 IsCoplanarTo(PlanarEntity)
public bool IsCoplanarTo(PlanarEntity otherPlanarEntity)
Parameters
otherPlanarEntity PlanarEntity
Returns
bool
 IsCoplanarTo(PlanarEntity, Tolerance)
public bool IsCoplanarTo(PlanarEntity otherPlanarEntity, Tolerance tolerance)
Parameters
otherPlanarEntity PlanarEntity
tolerance Tolerance
Returns
bool
 IsParallelTo(LinearEntity3d)
public bool IsParallelTo(LinearEntity3d linearEntity)
Parameters
linearEntity LinearEntity3d
Returns
bool
 IsParallelTo(LinearEntity3d, Tolerance)
public bool IsParallelTo(LinearEntity3d linearEntity, Tolerance tolerance)
Parameters
linearEntity LinearEntity3d
tolerance Tolerance
Returns
bool
 IsParallelTo(PlanarEntity)
public bool IsParallelTo(PlanarEntity otherPlanarEntity)
Parameters
otherPlanarEntity PlanarEntity
Returns
bool
 IsParallelTo(PlanarEntity, Tolerance)
public bool IsParallelTo(PlanarEntity otherPlanarEntity, Tolerance tolerance)
Parameters
otherPlanarEntity PlanarEntity
tolerance Tolerance
Returns
bool
 IsPerpendicularTo(LinearEntity3d)
public bool IsPerpendicularTo(LinearEntity3d linearEntity)
Parameters
linearEntity LinearEntity3d
Returns
bool
 IsPerpendicularTo(LinearEntity3d, Tolerance)
public bool IsPerpendicularTo(LinearEntity3d linearEntity, Tolerance tolerance)
Parameters
linearEntity LinearEntity3d
tolerance Tolerance
Returns
bool
 IsPerpendicularTo(PlanarEntity)
public bool IsPerpendicularTo(PlanarEntity linearEntity)
Parameters
linearEntity PlanarEntity
Returns
bool
 IsPerpendicularTo(PlanarEntity, Tolerance)
public bool IsPerpendicularTo(PlanarEntity linearEntity, Tolerance tolerance)
Parameters
linearEntity PlanarEntity
tolerance Tolerance
Returns
bool