Table of Contents
 Struct NurbSurfaceDefinition
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public struct NurbSurfaceDefinition
Inherited Members
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Properties
 ControlPoints
public Point3dCollection ControlPoints { get; }
Property Value
Point3dCollection
 DegreeInU
public int DegreeInU { get; }
Property Value
int
 DegreeInV
public int DegreeInV { get; }
Property Value
int
 NumberOfControlPointsInU
public int NumberOfControlPointsInU { get; }
Property Value
int
 NumberOfControlPointsInV
public int NumberOfControlPointsInV { get; }
Property Value
int
 PropertiesInU
public int PropertiesInU { get; }
Property Value
int
 PropertiesInV
public int PropertiesInV { get; }
Property Value
int
 UKnots
public KnotCollection UKnots { get; }
Property Value
KnotCollection
 VKnots
public KnotCollection VKnots { get; }
Property Value
KnotCollection
 Weights
public DoubleCollection Weights { get; }
Property Value
DoubleCollection
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 IsEqualTo(NurbSurfaceDefinition)
public bool IsEqualTo(NurbSurfaceDefinition a)
Parameters
a NurbSurfaceDefinition
Returns
bool
Operators
 operator ==(NurbSurfaceDefinition, NurbSurfaceDefinition)
public static bool operator ==(NurbSurfaceDefinition a, NurbSurfaceDefinition b)
Parameters
a NurbSurfaceDefinition
b NurbSurfaceDefinition
Returns
bool
 operator !=(NurbSurfaceDefinition, NurbSurfaceDefinition)
public static bool operator !=(NurbSurfaceDefinition a, NurbSurfaceDefinition b)
Parameters
a NurbSurfaceDefinition
b NurbSurfaceDefinition
Returns
bool