Table of Contents
 Enum GripData.ReturnValue
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum GripData.ReturnValue
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Failure = 1
GetNewGripPoints = 4
GripHotToWarm = 3
NoRedrawGrip = 2
Ok = 0