Table of Contents
 Struct DBDictionaryEntry
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct DBDictionaryEntry
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 DBDictionaryEntry(string, ObjectId)
public DBDictionaryEntry(string key, ObjectId value)
Parameters
key string
value ObjectId
Fields
 m_key
public string m_key
Field Value
string
 m_value
public ObjectId m_value
Field Value
ObjectId
Properties
 Key
public string Key { get; set; }
Property Value
string
 Value
public ObjectId Value { get; set; }
Property Value
ObjectId
Methods
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
Operators
 explicit operator DictionaryEntry(DBDictionaryEntry)
public static explicit operator DictionaryEntry(DBDictionaryEntry entry)
Parameters
entry DBDictionaryEntry
Returns
DictionaryEntry
 explicit operator DBDictionaryEntry(DictionaryEntry)
public static explicit operator DBDictionaryEntry(DictionaryEntry entry)
Parameters
entry DictionaryEntry
Returns
DBDictionaryEntry