Table of Contents
 Enum Surface.WireframeTypeEnum
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbSurface::WireframeType")]
public enum Surface.WireframeTypeEnum
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
IsoParms = 1
Isolines = 0