Table of Contents
 Enum CellContentTypes
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcDb::CellContentType")]
public enum CellContentTypes
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Block = 4
Field = 2
Unknown = 0
Value = 1