Table of Contents
 Class View
Namespace
Autodesk.AutoCAD.GraphicsSystem
Assembly
Acdbmgd.dll
[Wrapper("AcGsView")]
public class View : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
View
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 View()
public View()
 View(ClientViewInfo, bool)
public View(ClientViewInfo clientViewInfo, bool enableLayerVisibilityPerView)
Parameters
clientViewInfo ClientViewInfo
enableLayerVisibilityPerView bool
 View(IntPtr, bool, bool)
protected View(IntPtr unmanagedPointer, bool autoDelete, bool autoCADView)
Parameters
unmanagedPointer IntPtr
autoDelete bool
autoCADView bool
Properties
 AcadWindowId
public int AcadWindowId { get; }
Property Value
int
 BackClip
public double BackClip { get; set; }
Property Value
double
 BackgroundId
public ObjectId BackgroundId { get; set; }
Property Value
ObjectId
 Device
public Device Device { get; }
Property Value
Device
 EnableBackClip
public bool EnableBackClip { get; set; }
Property Value
bool
 EnableFrontClip
public bool EnableFrontClip { get; set; }
Property Value
bool
 EnableStereo
public bool EnableStereo { get; set; }
Property Value
bool
 ExceededBounds
public bool ExceededBounds { get; }
Property Value
bool
 FieldHeight
public double FieldHeight { get; }
Property Value
double
 FieldWidth
public double FieldWidth { get; }
Property Value
double
 FrontClip
public double FrontClip { get; set; }
Property Value
double
 IsInteractive
public bool IsInteractive { get; }
Property Value
bool
 IsPerspective
public bool IsPerspective { get; }
Property Value
bool
 IsValid
public bool IsValid { get; }
Property Value
bool
 IsVisible
public bool IsVisible { get; }
Property Value
bool
 ObjectToDeviceMatrix
public Matrix3d ObjectToDeviceMatrix { get; }
Property Value
Matrix3d
 Position
public Point3d Position { get; }
Property Value
Point3d
 ProjectionMatrix
public Matrix3d ProjectionMatrix { get; }
Property Value
Matrix3d
 ScreenMatrix
public Matrix3d ScreenMatrix { get; }
Property Value
Matrix3d
 StereoParameters
public StereoParameters StereoParameters { get; set; }
Property Value
StereoParameters
 Target
public Point3d Target { get; }
Property Value
Point3d
 UpVector
public Vector3d UpVector { get; }
Property Value
Vector3d
 ViewingMatrix
public Matrix3d ViewingMatrix { get; }
Property Value
Matrix3d
 ViewportBorderProperties
public ViewportBorderProperties ViewportBorderProperties { get; set; }
Property Value
ViewportBorderProperties
 ViewportBorderVisibility
public bool ViewportBorderVisibility { get; set; }
Property Value
bool
 ViewportExtents
public Extents2d ViewportExtents { get; set; }
Property Value
Extents2d
 ViewportId
public IntPtr ViewportId { get; }
Property Value
IntPtr
 ViewportObjectId
public ObjectId ViewportObjectId { get; }
Property Value
ObjectId
 VisualStyle
public VisualStyle VisualStyle { get; set; }
Property Value
VisualStyle
 VisualStyleId
public ObjectId VisualStyleId { get; set; }
Property Value
ObjectId
 WorldToDeviceMatrix
public Matrix3d WorldToDeviceMatrix { get; }
Property Value
Matrix3d
Methods
 Add(Drawable, Model)
public bool Add(Drawable drawable, Model model)
Parameters
drawable Drawable
model Model
Returns
bool
 BeginInteractivity(double)
public void BeginInteractivity(double frameRateInHZ)
Parameters
frameRateInHZ double
 ClearFrozenLayers()
public void ClearFrozenLayers()
 Clone()
public View Clone()
Returns
View
 Clone(bool, bool)
public View Clone(bool cloneViewParameters, bool cloneGeometry)
Parameters
cloneViewParameters bool
cloneGeometry bool
Returns
View
 Create(IntPtr, bool, bool)
public static View Create(IntPtr unmanagedPointer, bool autoDelete, bool autoCADView)
Parameters
unmanagedPointer IntPtr
autoDelete bool
autoCADView bool
Returns
View
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 Dolly(Vector3d)
public void Dolly(Vector3d vector)
Parameters
vector Vector3d
 Dolly(double, double, double)
public void Dolly(double x, double y, double z)
Parameters
x double
y double
z double
 EnableDefaultLighting(bool)
public void EnableDefaultLighting(bool bEnable)
Parameters
bEnable bool
 EnableDefaultLighting(bool, DefaultLightingType)
public void EnableDefaultLighting(bool bEnable, DefaultLightingType type)
Parameters
bEnable bool
type DefaultLightingType
 EndInteractivity()
public void EndInteractivity()
 Erase(Drawable)
public bool Erase(Drawable drawable)
Parameters
drawable Drawable
Returns
bool
 EraseAll()
public void EraseAll()
 ExtentsInView(Point3d, Point3d)
public bool ExtentsInView(Point3d minPoint, Point3d maxPoint)
Parameters
minPoint Point3d
maxPoint Point3d
Returns
bool
 Flush()
public void Flush()
 FreezeLayer(long)
[Obsolete("Use void FreezeLayer(System::IntPtr layerId)")]
public void FreezeLayer(long layerId)
Parameters
layerId long
 FreezeLayer(IntPtr)
public void FreezeLayer(IntPtr layerId)
Parameters
layerId IntPtr
 GetModel(Drawable)
public Model GetModel(Drawable drw)
Parameters
drw Drawable
Returns
Model
 GetModelList()
public Model[] GetModelList()
Returns
Model[]
 GetNumPixelsInUnitSquare(Point3d)
public Point2d GetNumPixelsInUnitSquare(Point3d givenWorldpt)
Parameters
givenWorldpt Point3d
Returns
Point2d
 GetNumPixelsInUnitSquare(Point3d, bool)
public Point2d GetNumPixelsInUnitSquare(Point3d givenWorldpt, bool includePerspective)
Parameters
givenWorldpt Point3d
includePerspective bool
Returns
Point2d
 GetSnapshot(Rectangle)
public Bitmap GetSnapshot(Rectangle rectangle)
Parameters
rectangle Rectangle
Returns
Bitmap
 Hide()
public void Hide()
 Invalidate()
public void Invalidate()
 Invalidate(Rectangle)
public void Invalidate(Rectangle rect)
Parameters
rect Rectangle
 InvalidateCachedViewportGeometry()
public void InvalidateCachedViewportGeometry()
 Orbit(double, double)
public void Orbit(double x, double y)
Parameters
x double
y double
 Pan(double, double)
public void Pan(double x, double y)
Parameters
x double
y double
 PointInView(Point3d)
public bool PointInView(Point3d point)
Parameters
point Point3d
Returns
bool
 RemoveViewportClipRegion()
public void RemoveViewportClipRegion()
 RenderToImage()
public Bitmap RenderToImage()
Returns
Bitmap
 RenderToImage(Drawable, Rectangle)
public Bitmap RenderToImage(Drawable settings, Rectangle rectScreen)
Parameters
settings Drawable
rectScreen Rectangle
Returns
Bitmap
 Roll(double)
public void Roll(double angle)
Parameters
angle double
 SetView(Point3d, Point3d, Vector3d, double, double)
public void SetView(Point3d position, Point3d target, Vector3d upVector, double fieldWidth, double fieldHeight)
Parameters
position Point3d
target Point3d
upVector Vector3d
fieldWidth double
fieldHeight double
 SetView(Point3d, Point3d, Vector3d, double, double, Projection)
public void SetView(Point3d position, Point3d target, Vector3d upVector, double fieldWidth, double fieldHeight, Projection projection)
Parameters
position Point3d
target Point3d
upVector Vector3d
fieldWidth double
fieldHeight double
projection Projection
 SetViewportClipRegion(int, int[], Point[])
public void SetViewportClipRegion(int contours, int[] counts, Point[] points)
Parameters
contours int
counts int[]
points Point[]
 Show()
public void Show()
 ThawLayer(long)
[Obsolete("Use void ThawLayer(System::IntPtr layerId)")]
public void ThawLayer(long layerId)
Parameters
layerId long
 ThawLayer(IntPtr)
public void ThawLayer(IntPtr layerId)
Parameters
layerId IntPtr
 Update()
public void Update()
 Zoom(double)
public void Zoom(double factor)
Parameters
factor double
 ZoomExtents(Point3d, Point3d)
public void ZoomExtents(Point3d minPoint, Point3d maxPoint)
Parameters
minPoint Point3d
maxPoint Point3d
 ZoomWindow(Point2d, Point2d)
public void ZoomWindow(Point2d lowerLeft, Point2d upperRight)
Parameters
lowerLeft Point2d
upperRight Point2d