Table of Contents
 Class RegistryKey
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public sealed class RegistryKey : IDisposable
Inheritance
object
RegistryKey
Implements
IDisposable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 RegistryKey(RegistryKey)
public RegistryKey(RegistryKey hKey)
Parameters
hKey RegistryKey
Properties
 SubKeyCount
public int SubKeyCount { get; }
Property Value
int
 ValueCount
public int ValueCount { get; }
Property Value
int
Methods
 Close()
public void Close()
 CreateSubKey(string)
public RegistryKey CreateSubKey(string subkey)
Parameters
subkey string
Returns
RegistryKey
 CreateSubKey(string, RegistryKeyPermissionCheck)
public RegistryKey CreateSubKey(string subkey, RegistryKeyPermissionCheck permissionCheck)
Parameters
subkey string
permissionCheck RegistryKeyPermissionCheck
Returns
RegistryKey
 CreateSubKey(string, RegistryKeyPermissionCheck, RegistryOptions)
public RegistryKey CreateSubKey(string subkey, RegistryKeyPermissionCheck permissionCheck, RegistryOptions options)
Parameters
subkey string
permissionCheck RegistryKeyPermissionCheck
options RegistryOptions
Returns
RegistryKey
 CreateSubKey(string, RegistryKeyPermissionCheck, RegistryOptions, RegistrySecurity)
public RegistryKey CreateSubKey(string subkey, RegistryKeyPermissionCheck permissionCheck, RegistryOptions registryOptions, RegistrySecurity registrySecurity)
Parameters
subkey string
permissionCheck RegistryKeyPermissionCheck
registryOptions RegistryOptions
registrySecurity RegistrySecurity
Returns
RegistryKey
 CreateSubKey(string, RegistryKeyPermissionCheck, RegistrySecurity)
public RegistryKey CreateSubKey(string subkey, RegistryKeyPermissionCheck permissionCheck, RegistrySecurity registrySecurity)
Parameters
subkey string
permissionCheck RegistryKeyPermissionCheck
registrySecurity RegistrySecurity
Returns
RegistryKey
 DeleteSubKey(string)
public void DeleteSubKey(string subkey)
Parameters
subkey string
 DeleteSubKeyTree(string)
public void DeleteSubKeyTree(string subkey)
Parameters
subkey string
 DeleteValue(string)
public void DeleteValue(string name)
Parameters
name string
 Dispose()
public override sealed void Dispose()
 Dispose(bool)
protected void Dispose(bool A_0)
Parameters
A_0 bool
 GetBaseKey(RegistryHive)
public static RegistryKey GetBaseKey(RegistryHive hKey)
Parameters
hKey RegistryHive
Returns
RegistryKey
 GetBaseKey(RegistryHive, RegistryView)
protected static RegistryKey GetBaseKey(RegistryHive hKey, RegistryView view)
Parameters
hKey RegistryHive
view RegistryView
Returns
RegistryKey
 GetSubKeyNames()
public string[] GetSubKeyNames()
Returns
string[]
 GetValue(string)
public object GetValue(string name)
Parameters
name string
Returns
object
 GetValue(string, object)
public object GetValue(string name, object defaultValue)
Parameters
name string
defaultValue object
Returns
object
 GetValue(string, object, RegistryValueOptions)
public object GetValue(string name, object defaultValue, RegistryValueOptions options)
Parameters
name string
defaultValue object
options RegistryValueOptions
Returns
object
 GetValueKind(string)
public RegistryValueKind GetValueKind(string name)
Parameters
name string
Returns
RegistryValueKind
 GetValueNames()
public string[] GetValueNames()
Returns
string[]
 OpenBaseKey(RegistryHive, RegistryView)
public static RegistryKey OpenBaseKey(RegistryHive hKey, RegistryView view)
Parameters
hKey RegistryHive
view RegistryView
Returns
RegistryKey
 OpenSubKey(string)
public RegistryKey OpenSubKey(string name)
Parameters
name string
Returns
RegistryKey
 OpenSubKey(string, RegistryKeyPermissionCheck)
public RegistryKey OpenSubKey(string name, RegistryKeyPermissionCheck permissionCheck)
Parameters
name string
permissionCheck RegistryKeyPermissionCheck
Returns
RegistryKey
 OpenSubKey(string, RegistryKeyPermissionCheck, RegistryRights)
public RegistryKey OpenSubKey(string name, RegistryKeyPermissionCheck permissionCheck, RegistryRights rights)
Parameters
name string
permissionCheck RegistryKeyPermissionCheck
rights RegistryRights
Returns
RegistryKey
 OpenSubKey(string, bool)
public RegistryKey OpenSubKey(string name, bool writable)
Parameters
name string
writable bool
Returns
RegistryKey
 SetValue(string, object)
public void SetValue(string name, object value)
Parameters
name string
value object
 SetValue(string, object, RegistryValueKind)
public void SetValue(string name, object value, RegistryValueKind kind)
Parameters
name string
value object
kind RegistryValueKind