Table of Contents
 Enum DrawableTraits.LayerFlags
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiDrawableTraits::LayerFlags")]
[Flags]
protected enum DrawableTraits.LayerFlags
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Frozen = 2
None = 0
Off = 1
Zero = 4