Table of Contents
 Enum MergeCellStyleOption
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum MergeCellStyleOption
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ConvertDuplicatesToOverrrides = 4
CopyDuplicates = 1
IgnoreNewStyles = 8
None = 0
OverwriteDuplicates = 2