Table of Contents
 Class MLeader
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMLeader")]
public class MLeader : Entity, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
Entity
MLeader
Implements
IDisposable
ICloneable
Inherited Members
 Entity.SetLayerId(ObjectId, bool)
 Entity.SetPropertiesFrom(Entity)
 Entity.AddSubentityPaths(FullSubentityPath[])
 Entity.DeleteSubentityPaths(FullSubentityPath[])
 Entity.TransformSubentityPathsBy(FullSubentityPath[], Matrix3d)
 Entity.GetGripPointsAtSubentityPath(FullSubentityPath, GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.MoveGripPointsAtSubentityPaths(FullSubentityPath[], IntPtr[], Vector3d, MoveGripPointsFlags)
 Entity.GetSubentityGeometricExtents(FullSubentityPath)
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, IntPtr, Point3d, Matrix3d, ObjectId[])
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, long, Point3d, Matrix3d, int, ObjectId[])
 Entity.GetGraphicsMarkersAtSubentityPathIntPtr(FullSubentityPath)
 Entity.Highlight(FullSubentityPath, bool)
 Entity.Highlight()
 Entity.Unhighlight(FullSubentityPath, bool)
 Entity.Unhighlight()
 Entity.PushHighlight(FullSubentityPath, HighlightStyle)
 Entity.PopHighlight(FullSubentityPath)
 Entity.HighlightState(FullSubentityPath)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection, Matrix3d)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection)
 Entity.IsContentSnappable()
 Entity.GetGripPoints(GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.GetGripPoints(Point3dCollection, IntegerCollection, IntegerCollection)
 Entity.MoveGripPointsAt(GripDataCollection, Vector3d, MoveGripPointsFlags)
 Entity.MoveGripPointsAt(IntegerCollection, Vector3d)
 Entity.GetStretchPoints(Point3dCollection)
 Entity.MoveStretchPointsAt(IntegerCollection, Vector3d)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.List()
 Entity.TransformBy(Matrix3d)
 Entity.GetTransformedCopy(Matrix3d)
 Entity.GetSubentity(FullSubentityPath)
 Entity.Explode(DBObjectCollection)
 Entity.RecordGraphicsModified(bool)
 Entity.Draw()
 Entity.SaveAs(WorldDraw, SaveType)
 Entity.SetDatabaseDefaults(Database)
 Entity.SetDatabaseDefaults()
 Entity.SetDragStatus(DragStatus)
 Entity.SetGripStatus(GripStatus)
 Entity.SetSubentityGripStatus(GripStatus, FullSubentityPath)
 Entity.JoinEntity(Entity)
 Entity.JoinEntities(Entity[])
 Entity.EdgeStyleId
 Entity.FaceStyleId
 Entity.VisualStyleId
 Entity.ForceAnnoAllVisible
 Entity.BlockName
 Entity.MaterialMapper
 Entity.MaterialId
 Entity.Material
 Entity.ReceiveShadows
 Entity.CastShadows
 Entity.Hyperlinks
 Entity.CloneMeForDragging
 Entity.CompoundObjectTransform
 Entity.GeometricExtents
 Entity.Ecs
 Entity.IsPlanar
 Entity.CollisionType
 Entity.LineWeight
 Entity.Visible
 Entity.LinetypeScale
 Entity.LinetypeId
 Entity.Linetype
 Entity.LayerId
 Entity.Layer
 Entity.PlotStyleNameId
 Entity.PlotStyleName
 Entity.Transparency
 Entity.EntityColor
 Entity.ColorIndex
 Entity.Color
 Entity.BlockId
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 MLeader()
public MLeader()
 MLeader(IntPtr, bool)
protected MLeader(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 ArrowSize
public double ArrowSize { get; set; }
Property Value
double
 ArrowSymbolId
public ObjectId ArrowSymbolId { get; set; }
Property Value
ObjectId
 BlockColor
public Color BlockColor { get; set; }
Property Value
Color
 BlockConnectionType
public BlockConnectionType BlockConnectionType { get; set; }
Property Value
BlockConnectionType
 BlockContentId
public ObjectId BlockContentId { get; set; }
Property Value
ObjectId
 BlockPosition
public Point3d BlockPosition { get; set; }
Property Value
Point3d
 BlockRotation
public double BlockRotation { get; set; }
Property Value
double
 BlockScale
public Scale3d BlockScale { get; set; }
Property Value
Scale3d
 ContentType
public ContentType ContentType { get; set; }
Property Value
ContentType
 DoglegLength
public double DoglegLength { get; set; }
Property Value
double
 EnableAnnotationScale
public bool EnableAnnotationScale { get; set; }
Property Value
bool
 EnableDogleg
public bool EnableDogleg { get; set; }
Property Value
bool
 EnableFrameText
public bool EnableFrameText { get; set; }
Property Value
bool
 EnableLanding
public bool EnableLanding { get; set; }
Property Value
bool
 ExtendLeaderToText
public bool ExtendLeaderToText { get; set; }
Property Value
bool
 LandingGap
public double LandingGap { get; set; }
Property Value
double
 LeaderCount
public int LeaderCount { get; }
Property Value
int
 LeaderLineColor
public Color LeaderLineColor { get; set; }
Property Value
Color
 LeaderLineCount
public int LeaderLineCount { get; }
Property Value
int
 LeaderLineType
public LeaderType LeaderLineType { get; set; }
Property Value
LeaderType
 LeaderLineTypeId
public ObjectId LeaderLineTypeId { get; set; }
Property Value
ObjectId
 LeaderLineWeight
public LineWeight LeaderLineWeight { get; set; }
Property Value
LineWeight
 MLeaderStyle
public ObjectId MLeaderStyle { get; set; }
Property Value
ObjectId
 MText
public MText MText { get; set; }
Property Value
MText
 Normal
public virtual Vector3d Normal { get; }
Property Value
Vector3d
 Scale
public double Scale { get; set; }
Property Value
double
 TextAlignmentType
public TextAlignmentType TextAlignmentType { get; set; }
Property Value
TextAlignmentType
 TextAngleType
public TextAngleType TextAngleType { get; set; }
Property Value
TextAngleType
 TextAttachmentDirection
public TextAttachmentDirection TextAttachmentDirection { get; set; }
Property Value
TextAttachmentDirection
 TextAttachmentType
public TextAttachmentType TextAttachmentType { get; set; }
Property Value
TextAttachmentType
 TextColor
public Color TextColor { get; set; }
Property Value
Color
 TextHeight
public double TextHeight { get; set; }
Property Value
double
 TextLocation
public Point3d TextLocation { get; set; }
Property Value
Point3d
 TextStyleId
public ObjectId TextStyleId { get; set; }
Property Value
ObjectId
 ToleranceLocation
public Point3d ToleranceLocation { get; set; }
Property Value
Point3d
Methods
 AddFirstVertex(int, Point3d)
public void AddFirstVertex(int leaderLineIndex, Point3d point)
Parameters
leaderLineIndex int
point Point3d
 AddLastVertex(int, Point3d)
public void AddLastVertex(int leaderLineIndex, Point3d point)
Parameters
leaderLineIndex int
point Point3d
 AddLeader()
public int AddLeader()
Returns
int
 AddLeaderLine(Point3d)
public int AddLeaderLine(Point3d point)
Parameters
point Point3d
Returns
int
 AddLeaderLine(int)
public int AddLeaderLine(int leaderIndex)
Parameters
leaderIndex int
Returns
int
 ConnectionPoint(Vector3d)
public Point3d ConnectionPoint(Vector3d direction)
Parameters
direction Vector3d
Returns
Point3d
 ConnectionPoint(Vector3d, TextAttachmentDirection)
public Point3d ConnectionPoint(Vector3d direction, TextAttachmentDirection textAttachmentDirection)
Parameters
direction Vector3d
textAttachmentDirection TextAttachmentDirection
Returns
Point3d
 GetArrowSize(int)
public double GetArrowSize(int leaderLineIndex)
Parameters
leaderLineIndex int
Returns
double
 GetArrowSymbolId(int)
public ObjectId GetArrowSymbolId(int leaderLineIndex)
Parameters
leaderLineIndex int
Returns
ObjectId
 GetBlockAttribute(ObjectId)
public AttributeReference GetBlockAttribute(ObjectId attDefId)
Parameters
attDefId ObjectId
Returns
AttributeReference
 GetContentGeomExtents()
public Extents3d GetContentGeomExtents()
Returns
Extents3d
 GetDogleg(int)
public Vector3d GetDogleg(int leaderIndex)
Parameters
leaderIndex int
Returns
Vector3d
 GetDoglegLength(int)
public double GetDoglegLength(int leaderIndex)
Parameters
leaderIndex int
Returns
double
 GetFirstVertex(int)
public Point3d GetFirstVertex(int leaderLineIndex)
Parameters
leaderLineIndex int
Returns
Point3d
 GetLastVertex(int)
public Point3d GetLastVertex(int leaderLineIndex)
Parameters
leaderLineIndex int
Returns
Point3d
 GetLeaderIndex(int)
public int GetLeaderIndex(int leaderLineIndex)
Parameters
leaderLineIndex int
Returns
int
 GetLeaderIndexes()
public ArrayList GetLeaderIndexes()
Returns
ArrayList
 GetLeaderLineColor(int)
public Color GetLeaderLineColor(int leaderLineIndex)
Parameters
leaderLineIndex int
Returns
Color
 GetLeaderLineIndexes(int)
public ArrayList GetLeaderLineIndexes(int leaderIndex)
Parameters
leaderIndex int
Returns
ArrayList
 GetLeaderLineType(int)
public LeaderType GetLeaderLineType(int leaderLineIndex)
Parameters
leaderLineIndex int
Returns
LeaderType
 GetLeaderLineTypeId(int)
public ObjectId GetLeaderLineTypeId(int leaderLineIndex)
Parameters
leaderLineIndex int
Returns
ObjectId
 GetLeaderLineWeight(int)
public LineWeight GetLeaderLineWeight(int leaderLineIndex)
Parameters
leaderLineIndex int
Returns
LineWeight
 GetPlane()
public override Plane GetPlane()
Returns
Plane
 GetTextAttachmentType(LeaderDirectionType)
public TextAttachmentType GetTextAttachmentType(LeaderDirectionType leaderDirection)
Parameters
leaderDirection LeaderDirectionType
Returns
TextAttachmentType
 GetVertex(int, int)
public Point3d GetVertex(int leaderLineIndex, int index)
Parameters
leaderLineIndex int
index int
Returns
Point3d
 HasContent()
public bool HasContent()
Returns
bool
 MoveMLeader(Vector3d, MoveType)
public void MoveMLeader(Vector3d vec, MoveType type)
Parameters
vec Vector3d
type MoveType
 PostMLeaderToDb(Database)
public void PostMLeaderToDb(Database db)
Parameters
db Database
 RemoveFirstVertex(int)
public void RemoveFirstVertex(int leaderLineIndex)
Parameters
leaderLineIndex int
 RemoveLastVertex(int)
public void RemoveLastVertex(int leaderLineIndex)
Parameters
leaderLineIndex int
 RemoveLeader(int)
public void RemoveLeader(int index)
Parameters
index int
 RemoveLeaderLine(int)
public void RemoveLeaderLine(int leaderLineIndex)
Parameters
leaderLineIndex int
 SetArrowSize(int, double)
public void SetArrowSize(int leaderLineIndex, double arrowSize)
Parameters
leaderLineIndex int
arrowSize double
 SetArrowSymbolId(int, ObjectId)
public void SetArrowSymbolId(int leaderLineIndex, ObjectId id)
Parameters
leaderLineIndex int
id ObjectId
 SetBlockAttribute(ObjectId, AttributeReference)
public void SetBlockAttribute(ObjectId attDefId, AttributeReference attributeValue)
Parameters
attDefId ObjectId
attributeValue AttributeReference
 SetContextDataManager(IntPtr)
public void SetContextDataManager(IntPtr contextDataManager)
Parameters
contextDataManager IntPtr
 SetDogleg(int, Vector3d)
public void SetDogleg(int leaderIndex, Vector3d vector)
Parameters
leaderIndex int
vector Vector3d
 SetDoglegLength(int, double)
public void SetDoglegLength(int leaderIndex, double doglegLength)
Parameters
leaderIndex int
doglegLength double
 SetFirstVertex(int, Point3d)
public void SetFirstVertex(int leaderLineIndex, Point3d point)
Parameters
leaderLineIndex int
point Point3d
 SetLastVertex(int, Point3d)
public void SetLastVertex(int leaderLineIndex, Point3d point)
Parameters
leaderLineIndex int
point Point3d
 SetLeaderLineColor(int, Color)
public void SetLeaderLineColor(int leaderLineIndex, Color leaderLineTypeId)
Parameters
leaderLineIndex int
leaderLineTypeId Color
 SetLeaderLineType(int, LeaderType)
public void SetLeaderLineType(int leaderLineIndex, LeaderType leaderLineType)
Parameters
leaderLineIndex int
leaderLineType LeaderType
 SetLeaderLineTypeId(int, ObjectId)
public void SetLeaderLineTypeId(int leaderLineIndex, ObjectId leaderLineTypeId)
Parameters
leaderLineIndex int
leaderLineTypeId ObjectId
 SetLeaderLineWeight(int, LineWeight)
public void SetLeaderLineWeight(int leaderLineIndex, LineWeight leaderLineWeight)
Parameters
leaderLineIndex int
leaderLineWeight LineWeight
 SetPlane(Plane)
public virtual void SetPlane(Plane value)
Parameters
value Plane
 SetTextAttachmentType(TextAttachmentType, LeaderDirectionType)
public void SetTextAttachmentType(TextAttachmentType textAttachmentType, LeaderDirectionType leaderDirection)
Parameters
textAttachmentType TextAttachmentType
leaderDirection LeaderDirectionType
 SetVertex(int, int, Point3d)
public void SetVertex(int leaderLineIndex, int index, Point3d point)
Parameters
leaderLineIndex int
index int
point Point3d
 VerticesCount(int)
public int VerticesCount(int leaderLineIndex)
Parameters
leaderLineIndex int
Returns
int
 getContextDataManager()
public IntPtr getContextDataManager()
Returns
IntPtr
 getOverridedMLeaderStyle(MLeaderStyle)
public void getOverridedMLeaderStyle(MLeaderStyle mleaderStyle)
Parameters
mleaderStyle MLeaderStyle
 recomputeBreakPoints()
public void recomputeBreakPoints()