Table of Contents
 Struct ColorRGB
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiColorRGB")]
public struct ColorRGB
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 ColorRGB()
public ColorRGB()
 ColorRGB(double, double, double)
public ColorRGB(double red, double green, double blue)
Parameters
red double
green double
blue double
Properties
 Blue
public double Blue { get; set; }
Property Value
double
 Green
public double Green { get; set; }
Property Value
double
 Red
public double Red { get; set; }
Property Value
double