Table of Contents
 Class GripDataCollection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public sealed class GripDataCollection : DisposableWrapper, IDisposable, ICollection<GripData>, IEnumerable<GripData>, IEnumerable
Inheritance
object
MarshalByRefObject
DisposableWrapper
GripDataCollection
Implements
IDisposable
ICollection<GripData>
IEnumerable<GripData>
IEnumerable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 GripDataCollection()
public GripDataCollection()
Properties
 Count
public virtual int Count { get; }
Property Value
int
 IsReadOnly
public virtual bool IsReadOnly { get; }
Property Value
bool
 this[int]
public GripData this[int i] { get; }
Parameters
i int
Property Value
GripData
Methods
 Add(GripData)
public void Add(GripData gripData)
Parameters
gripData GripData
 Clear()
public void Clear()
 Contains(GripData)
public bool Contains(GripData gripData)
Parameters
gripData GripData
Returns
bool
 CopyTo(GripData[], int)
public void CopyTo(GripData[] A_0, int A_1)
Parameters
A_0 GripData[]
A_1 int
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 GetEnumerator()
public IEnumerator<GripData> GetEnumerator()
Returns
IEnumerator<GripData>
 Remove(GripData)
public bool Remove(GripData gripData)
Parameters
gripData GripData
Returns
bool