Table of Contents
 Enum ImageQuality
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbRasterVariables::ImageQuality")]
public enum ImageQuality
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Draft = 0
High = 1
Invalid = -1