Table of Contents
 Class LoftOptions
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbLoftOptions")]
public sealed class LoftOptions : DisposableWrapper, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
LoftOptions
Implements
IDisposable
ICloneable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 LoftOptions()
public LoftOptions()
 LoftOptions(LoftOptions)
public LoftOptions(LoftOptions opts)
Parameters
opts LoftOptions
Properties
 AlignDirection
public bool AlignDirection { get; }
Property Value
bool
 ArcLengthParam
public bool ArcLengthParam { get; }
Property Value
bool
 Closed
public bool Closed { get; }
Property Value
bool
 DraftEnd
[UnitType(UnitType.Angle)]
public double DraftEnd { get; }
Property Value
double
 DraftEndMag
[UnitType(UnitType.Unitless)]
public double DraftEndMag { get; }
Property Value
double
 DraftStart
[UnitType(UnitType.Angle)]
public double DraftStart { get; }
Property Value
double
 DraftStartMag
[UnitType(UnitType.Unitless)]
public double DraftStartMag { get; }
Property Value
double
 NoTwist
public bool NoTwist { get; }
Property Value
bool
 NormalOption
public LoftOptionsNormalOption NormalOption { get; }
Property Value
LoftOptionsNormalOption
 Ruled
public bool Ruled { get; }
Property Value
bool
 Simplify
public bool Simplify { get; }
Property Value
bool
 VirtualGuide
public bool VirtualGuide { get; }
Property Value
bool
Methods
 CheckCrossSectionCurves(Entity[], bool)
public LoftOptionsCheckCurvesOut CheckCrossSectionCurves(Entity[] crossSectionCurves, bool displayErrorMessages)
Parameters
crossSectionCurves Entity[]
displayErrorMessages bool
Returns
LoftOptionsCheckCurvesOut
 CheckGuideCurves(Entity[], bool)
public void CheckGuideCurves(Entity[] guideCurves, bool displayErrorMessages)
Parameters
guideCurves Entity[]
displayErrorMessages bool
 CheckLoftCurves(Entity[], Entity[], Entity, bool)
public LoftOptionsCheckCurvesOut CheckLoftCurves(Entity[] crossSectionCurves, Entity[] guideCurves, Entity pPathCurve, bool displayErrorMessages)
Parameters
crossSectionCurves Entity[]
guideCurves Entity[]
pPathCurve Entity
displayErrorMessages bool
Returns
LoftOptionsCheckCurvesOut
 CheckPathCurve(Entity, bool)
public void CheckPathCurve(Entity pathCurve, bool displayErrorMessages)
Parameters
pathCurve Entity
displayErrorMessages bool
 Clone()
public object Clone()
Returns
object
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()