Table of Contents
 Class AssocDimDependencyBodyBase
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocDimDependencyBodyBase")]
public abstract class AssocDimDependencyBodyBase : AssocDependencyBody, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
AssocDependencyBody
AssocDimDependencyBodyBase
Implements
IDisposable
ICloneable
Derived
AssocDimDependencyBody
Inherited Members
 AssocDependencyBody.SetStatus(AssocStatus, bool)
 AssocDependencyBody.currentEvaluationCallback()
 AssocDependencyBody.IsDependentOnTheSameThingAsOverride(AssocDependency)
 AssocDependencyBody.IsEqualToOverride(AssocDependency)
 AssocDependencyBody.ClonedOverride(DBObject, DBObject)
 AssocDependencyBody.HasCachedValueOverride
 AssocDependencyBody.IsActionEvaluationInProgress
 AssocDependencyBody.IsAttachedToObject
 AssocDependencyBody.DependentOnObject
 AssocDependencyBody.OwningAction
 AssocDependencyBody.Status
 AssocDependencyBody.ParentDependency
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocDimDependencyBodyBase()
public AssocDimDependencyBodyBase()
 AssocDimDependencyBodyBase(IntPtr, bool)
protected AssocDimDependencyBodyBase(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 ConstrainedGeoms
public ConstrainedGeometry[] ConstrainedGeoms { get; }
Property Value
ConstrainedGeometry[]
 EntityMeasurementOverride
public abstract double EntityMeasurementOverride { get; }
Property Value
double
 EntityTextOverride
public abstract string EntityTextOverride { get; set; }
Property Value
string
 GetCurrentlyUsedEntityNameFormat
public int GetCurrentlyUsedEntityNameFormat { get; }
Property Value
int
 GetMeasuredValue
public double GetMeasuredValue { get; }
Property Value
double
 IsConstraintActive
public bool IsConstraintActive { get; }
Property Value
bool
 IsEntityAttachmentChangedOverride
public abstract bool IsEntityAttachmentChangedOverride { get; }
Property Value
bool
 IsReferenceOnly
public bool IsReferenceOnly { set; }
Property Value
bool
 IsRelevantChangeOverride
public override bool IsRelevantChangeOverride { get; }
Property Value
bool
 SubentityConstrainedGeoms
public FullSubentityPath[] SubentityConstrainedGeoms { get; }
Property Value
FullSubentityPath[]
 Variable
public ObjectId Variable { get; }
Property Value
ObjectId
Methods
 ComposeEntityText(int)
public string ComposeEntityText(int requiredNameFormat)
Parameters
requiredNameFormat int
Returns
string
 Constraint()
public ExplicitConstraint Constraint()
Returns
ExplicitConstraint
 DeactivateConstraint()
public void DeactivateConstraint()
 DragStatus(DragStatus)
public void DragStatus(DragStatus status)
Parameters
status DragStatus
 DwgInFields(DwgFiler)
public override ErrorStatus DwgInFields(DwgFiler filer)
Parameters
filer DwgFiler
Returns
ErrorStatus
 DwgOutFields(DwgFiler)
public override ErrorStatus DwgOutFields(DwgFiler filer)
Parameters
filer DwgFiler
Returns
ErrorStatus
 DxfInFields(DxfFiler)
public override ErrorStatus DxfInFields(DxfFiler filer)
Parameters
filer DxfFiler
Returns
ErrorStatus
 DxfOutFields(DxfFiler)
public override ErrorStatus DxfOutFields(DxfFiler filer)
Parameters
filer DxfFiler
Returns
ErrorStatus
 EntityAttachmentPointMoved(SubentityGeometry[], double)
public void EntityAttachmentPointMoved(SubentityGeometry[] newAttachedGeometries, double measurement)
Parameters
newAttachedGeometries SubentityGeometry[]
measurement double
 ErasedOverride(DBObject, int)
public override void ErasedOverride(DBObject dbObj, int isErasing)
Parameters
dbObj DBObject
isErasing int
 EvaluateOverride()
public override void EvaluateOverride()
 FormatToCurrentPrecision(string, bool)
public static string FormatToCurrentPrecision(string expression, bool isAngular)
Parameters
expression string
isAngular bool
Returns
string
 GetEntityNameAndExpression(ref string, ref string)
public void GetEntityNameAndExpression(ref string name, ref string expression)
Parameters
name string
expression string
 GetEraseDimensionIfDependencyIsErased()
public static bool GetEraseDimensionIfDependencyIsErased()
Returns
bool
 GetFromEntity(ObjectId)
public static ObjectId GetFromEntity(ObjectId entityId)
Parameters
entityId ObjectId
Returns
ObjectId
 GetNameAndExpressionFromEntityText(string, bool, double, bool, ref string, ref string)
public static void GetNameAndExpressionFromEntityText(string entityText, bool useMeasurementIfNoText, double measurement, bool isAngular, ref string name, ref string expression)
Parameters
entityText string
useMeasurementIfNoText bool
measurement double
isAngular bool
name string
expression string
 GetSubentityGeoms(Vector3d)
public SubentityGeometry[] GetSubentityGeoms(Vector3d distanceDirection)
Parameters
distanceDirection Vector3d
Returns
SubentityGeometry[]
 GetVariableNameAndExpression(ref string, ref string, string)
public void GetVariableNameAndExpression(ref string name, ref string expression, string value)
Parameters
name string
expression string
value string
 ModifiedOverride(DBObject)
public override void ModifiedOverride(DBObject dbObj)
Parameters
dbObj DBObject
 ReactivateConstraint()
public void ReactivateConstraint()
 SetEntityNameAndExpression(string, string, string)
public void SetEntityNameAndExpression(string name, string expression, string value)
Parameters
name string
expression string
value string
 SetEraseDimensionIfDependencyIsErased(bool)
public static bool SetEraseDimensionIfDependencyIsErased(bool yesNo)
Parameters
yesNo bool
Returns
bool
 SetNameAndExpression(string, string)
public void SetNameAndExpression(string name, string expression)
Parameters
name string
expression string
 SetVariableNameAndExpression(string, string)
public void SetVariableNameAndExpression(string name, string expression)
Parameters
name string
expression string
 SetVariableValueToMeasuredValue()
public void SetVariableValueToMeasuredValue()
 SubErase(int)
public virtual void SubErase(int erasing)
Parameters
erasing int
 UpdateDependentOnObjectOverride()
public override void UpdateDependentOnObjectOverride()
 ValidateEntityText(string)
public string ValidateEntityText(string entityTextToValidate)
Parameters
entityTextToValidate string
Returns
string