Table of Contents
 Class Color
Namespace
Autodesk.AutoCAD.Colors
Assembly
Acdbmgd.dll
[TypeConverter(typeof(ColorConverter))]
[Wrapper("AcCmColor")]
public sealed class Color : DisposableWrapper, IDisposable, IComparable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Color
Implements
IDisposable
IComparable
ICloneable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Color()
public Color()
Properties
 Blue
public byte Blue { get; }
Property Value
byte
 BookName
public string BookName { get; }
Property Value
string
 ColorIndex
public short ColorIndex { get; }
Property Value
short
 ColorMethod
public ColorMethod ColorMethod { get; }
Property Value
ColorMethod
 ColorName
public string ColorName { get; }
Property Value
string
 ColorNameForDisplay
public string ColorNameForDisplay { get; }
Property Value
string
 ColorValue
public Color ColorValue { get; }
Property Value
Color
 Description
public string Description { get; }
Property Value
string
 DictionaryKey
public string DictionaryKey { get; }
Property Value
string
 DictionaryKeyLength
public int DictionaryKeyLength { get; }
Property Value
int
 EntityColor
public EntityColor EntityColor { get; }
Property Value
EntityColor
 Explanation
public string Explanation { get; }
Property Value
string
 Green
public byte Green { get; }
Property Value
byte
 HasBookName
public bool HasBookName { get; }
Property Value
bool
 HasColorName
public bool HasColorName { get; }
Property Value
bool
 IsByAci
public bool IsByAci { get; }
Property Value
bool
 IsByBlock
public bool IsByBlock { get; }
Property Value
bool
 IsByColor
public bool IsByColor { get; }
Property Value
bool
 IsByLayer
public bool IsByLayer { get; }
Property Value
bool
 IsByPen
public bool IsByPen { get; }
Property Value
bool
 IsForeground
public bool IsForeground { get; }
Property Value
bool
 IsNone
public bool IsNone { get; }
Property Value
bool
 PenIndex
public short PenIndex { get; }
Property Value
short
 Red
public byte Red { get; }
Property Value
byte
Methods
 Audit(AuditInfo)
public void Audit(AuditInfo auditInfo)
Parameters
auditInfo AuditInfo
 Clone()
public object Clone()
Returns
object
 CompareTo(object)
public int CompareTo(object obj)
Parameters
obj object
Returns
int
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 DwgIn(DwgFiler)
public static Color DwgIn(DwgFiler inputFiler)
Parameters
inputFiler DwgFiler
Returns
Color
 DwgOut(DwgFiler)
public void DwgOut(DwgFiler outputFiler)
Parameters
outputFiler DwgFiler
 DxfIn(DxfFiler, int)
public static Color DxfIn(DxfFiler inputFiler, int groupCodeOffset)
Parameters
inputFiler DxfFiler
groupCodeOffset int
Returns
Color
 DxfOut(DxfFiler, int)
public void DxfOut(DxfFiler outputFiler, int groupCodeOffset)
Parameters
outputFiler DxfFiler
groupCodeOffset int
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 FromColor(Color)
public static Color FromColor(Color value)
Parameters
value Color
Returns
Color
 FromColor(Color)
public static Color FromColor(Color value)
Parameters
value Color
Returns
Color
 FromColorIndex(ColorMethod, short)
public static Color FromColorIndex(ColorMethod colorMethod, short colorIndex)
Parameters
colorMethod ColorMethod
colorIndex short
Returns
Color
 FromDictionaryName(string)
public static Color FromDictionaryName(string name)
Parameters
name string
Returns
Color
 FromEntityColor(EntityColor)
public static Color FromEntityColor(EntityColor eclr)
Parameters
eclr EntityColor
Returns
Color
 FromNames(string, string)
public static Color FromNames(string colorName, string bookName)
Parameters
colorName string
bookName string
Returns
Color
 FromRgb(byte, byte, byte)
public static Color FromRgb(byte red, byte green, byte blue)
Parameters
red byte
green byte
blue byte
Returns
Color
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
Operators
 operator ==(Color, Color)
public static bool operator ==(Color a, Color b)
Parameters
a Color
b Color
Returns
bool
 operator >(Color, Color)
public static int operator >(Color a, Color b)
Parameters
a Color
b Color
Returns
int
 operator !=(Color, Color)
public static bool operator !=(Color a, Color b)
Parameters
a Color
b Color
Returns
bool
 operator <(Color, Color)
public static int operator <(Color a, Color b)
Parameters
a Color
b Color
Returns
int