Table of Contents
 Class DynamicBlockReferenceProperty
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public sealed class DynamicBlockReferenceProperty
Inheritance
object
DynamicBlockReferenceProperty
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 BlockId
public ObjectId BlockId { get; }
Property Value
ObjectId
 Description
public string Description { get; }
Property Value
string
 PropertyName
public string PropertyName { get; }
Property Value
string
 PropertyTypeCode
public short PropertyTypeCode { get; }
Property Value
short
 ReadOnly
public bool ReadOnly { get; }
Property Value
bool
 Show
public bool Show { get; }
Property Value
bool
 UnitsType
public DynamicBlockReferencePropertyUnitsType UnitsType { get; }
Property Value
DynamicBlockReferencePropertyUnitsType
 Value
public object Value { get; set; }
Property Value
object
 VisibleInCurrentVisibilityState
public bool VisibleInCurrentVisibilityState { get; }
Property Value
bool
Methods
 GetAllowedValues()
public object[] GetAllowedValues()
Returns
object[]