Table of Contents
 Class SectionSettings
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbSectionSettings")]
public class SectionSettings : DBObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
SectionSettings
Implements
IDisposable
ICloneable
Inherited Members
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 SectionSettings()
public SectionSettings()
 SectionSettings(IntPtr, bool)
protected SectionSettings(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 CurrentSectionType
public SectionType CurrentSectionType { get; set; }
Property Value
SectionType
Methods
 Color(SectionType, SectionGeometry)
public Color Color(SectionType nSecType, SectionGeometry nGeometry)
Parameters
nSecType SectionType
nGeometry SectionGeometry
Returns
Color
 DestinationBlock(SectionType)
public ObjectId DestinationBlock(SectionType nSecType)
Parameters
nSecType SectionType
Returns
ObjectId
 DestinationFile(SectionType)
public string DestinationFile(SectionType nSecType)
Parameters
nSecType SectionType
Returns
string
 DivisionLines(SectionType, SectionGeometry)
public bool DivisionLines(SectionType nSecType, SectionGeometry nGeometry)
Parameters
nSecType SectionType
nGeometry SectionGeometry
Returns
bool
 EdgeTransparency(SectionType, SectionGeometry)
public int EdgeTransparency(SectionType nSecType, SectionGeometry nGeometry)
Parameters
nSecType SectionType
nGeometry SectionGeometry
Returns
int
 FaceTransparency(SectionType, SectionGeometry)
public int FaceTransparency(SectionType nSecType, SectionGeometry nGeometry)
Parameters
nSecType SectionType
nGeometry SectionGeometry
Returns
int
 GenerationOptions(SectionType)
public SectionGeneration GenerationOptions(SectionType nSecType)
Parameters
nSecType SectionType
Returns
SectionGeneration
 GetHatchPatternName(SectionType, SectionGeometry)
public string GetHatchPatternName(SectionType nSecType, SectionGeometry nGeometry)
Parameters
nSecType SectionType
nGeometry SectionGeometry
Returns
string
 GetHatchPatternType(SectionType, SectionGeometry)
public HatchPatternType GetHatchPatternType(SectionType nSecType, SectionGeometry nGeometry)
Parameters
nSecType SectionType
nGeometry SectionGeometry
Returns
HatchPatternType
 GetSourceObjects(SectionType, ObjectIdCollection)
public void GetSourceObjects(SectionType nSecType, ObjectIdCollection ids)
Parameters
nSecType SectionType
ids ObjectIdCollection
 HatchAngle(SectionType, SectionGeometry)
public double HatchAngle(SectionType nSecType, SectionGeometry nGeometry)
Parameters
nSecType SectionType
nGeometry SectionGeometry
Returns
double
 HatchScale(SectionType, SectionGeometry)
public double HatchScale(SectionType nSecType, SectionGeometry nGeometry)
Parameters
nSecType SectionType
nGeometry SectionGeometry
Returns
double
 HatchSpacing(SectionType, SectionGeometry)
public double HatchSpacing(SectionType nSecType, SectionGeometry nGeometry)
Parameters
nSecType SectionType
nGeometry SectionGeometry
Returns
double
 HatchVisibility(SectionType, SectionGeometry)
public bool HatchVisibility(SectionType nSecType, SectionGeometry nGeometry)
Parameters
nSecType SectionType
nGeometry SectionGeometry
Returns
bool
 HiddenLine(SectionType, SectionGeometry)
public bool HiddenLine(SectionType nSecType, SectionGeometry nGeometry)
Parameters
nSecType SectionType
nGeometry SectionGeometry
Returns
bool
 Layer(SectionType, SectionGeometry)
public string Layer(SectionType nSecType, SectionGeometry nGeometry)
Parameters
nSecType SectionType
nGeometry SectionGeometry
Returns
string
 LineWeight(SectionType, SectionGeometry)
public LineWeight LineWeight(SectionType nSecType, SectionGeometry nGeometry)
Parameters
nSecType SectionType
nGeometry SectionGeometry
Returns
LineWeight
 Linetype(SectionType, SectionGeometry)
public string Linetype(SectionType nSecType, SectionGeometry nGeometry)
Parameters
nSecType SectionType
nGeometry SectionGeometry
Returns
string
 LinetypeScale(SectionType, SectionGeometry)
public double LinetypeScale(SectionType nSecType, SectionGeometry nGeometry)
Parameters
nSecType SectionType
nGeometry SectionGeometry
Returns
double
 PlotStyleName(SectionType, SectionGeometry)
public string PlotStyleName(SectionType nSecType, SectionGeometry nGeometry)
Parameters
nSecType SectionType
nGeometry SectionGeometry
Returns
string
 Reset()
public void Reset()
 Reset(SectionType)
public void Reset(SectionType nSecType)
Parameters
nSecType SectionType
 SetColor(SectionType, SectionGeometry, Color)
public void SetColor(SectionType nSecType, SectionGeometry nGeometry, Color color)
Parameters
nSecType SectionType
nGeometry SectionGeometry
color Color
 SetDestinationBlock(SectionType, ObjectId)
public void SetDestinationBlock(SectionType nSecType, ObjectId id)
Parameters
nSecType SectionType
id ObjectId
 SetDestinationFile(SectionType, string)
public void SetDestinationFile(SectionType nSecType, string pszFileName)
Parameters
nSecType SectionType
pszFileName string
 SetDivisionLines(SectionType, SectionGeometry, bool)
public void SetDivisionLines(SectionType nSecType, SectionGeometry nGeometry, bool bShow)
Parameters
nSecType SectionType
nGeometry SectionGeometry
bShow bool
 SetEdgeTransparency(SectionType, SectionGeometry, int)
public void SetEdgeTransparency(SectionType nSecType, SectionGeometry nGeometry, int nTransparency)
Parameters
nSecType SectionType
nGeometry SectionGeometry
nTransparency int
 SetFaceTransparency(SectionType, SectionGeometry, int)
public void SetFaceTransparency(SectionType nSecType, SectionGeometry nGeometry, int nTransparency)
Parameters
nSecType SectionType
nGeometry SectionGeometry
nTransparency int
 SetGenerationOptions(SectionType, SectionGeneration)
public void SetGenerationOptions(SectionType nSecType, SectionGeneration nOptions)
Parameters
nSecType SectionType
nOptions SectionGeneration
 SetHatchAngle(SectionType, SectionGeometry, double)
public void SetHatchAngle(SectionType nSecType, SectionGeometry nGeometry, double fAngle)
Parameters
nSecType SectionType
nGeometry SectionGeometry
fAngle double
 SetHatchPatternName(SectionType, SectionGeometry, string)
public void SetHatchPatternName(SectionType nSecType, SectionGeometry nGeometry, string sNewName)
Parameters
nSecType SectionType
nGeometry SectionGeometry
sNewName string
 SetHatchPatternType(SectionType, SectionGeometry, HatchPatternType)
public void SetHatchPatternType(SectionType nSecType, SectionGeometry nGeometry, HatchPatternType nPatternType)
Parameters
nSecType SectionType
nGeometry SectionGeometry
nPatternType HatchPatternType
 SetHatchScale(SectionType, SectionGeometry, double)
public void SetHatchScale(SectionType nSecType, SectionGeometry nGeometry, double fScale)
Parameters
nSecType SectionType
nGeometry SectionGeometry
fScale double
 SetHatchSpacing(SectionType, SectionGeometry, double)
public void SetHatchSpacing(SectionType nSecType, SectionGeometry nGeometry, double fSpacing)
Parameters
nSecType SectionType
nGeometry SectionGeometry
fSpacing double
 SetHatchVisibility(SectionType, SectionGeometry, bool)
public void SetHatchVisibility(SectionType nSecType, SectionGeometry nGeometry, bool bVisible)
Parameters
nSecType SectionType
nGeometry SectionGeometry
bVisible bool
 SetHiddenLine(SectionType, SectionGeometry, bool)
public void SetHiddenLine(SectionType nSecType, SectionGeometry nGeometry, bool bHiddenLine)
Parameters
nSecType SectionType
nGeometry SectionGeometry
bHiddenLine bool
 SetLayer(SectionType, SectionGeometry, string)
public void SetLayer(SectionType nSecType, SectionGeometry nGeometry, string pszLayer)
Parameters
nSecType SectionType
nGeometry SectionGeometry
pszLayer string
 SetLineWeight(SectionType, SectionGeometry, LineWeight)
public void SetLineWeight(SectionType nSecType, SectionGeometry nGeometry, LineWeight nLineWeight)
Parameters
nSecType SectionType
nGeometry SectionGeometry
nLineWeight LineWeight
 SetLinetype(SectionType, SectionGeometry, string)
public void SetLinetype(SectionType nSecType, SectionGeometry nGeometry, string pszLinetype)
Parameters
nSecType SectionType
nGeometry SectionGeometry
pszLinetype string
 SetLinetypeScale(SectionType, SectionGeometry, double)
public void SetLinetypeScale(SectionType nSecType, SectionGeometry nGeometry, double fScale)
Parameters
nSecType SectionType
nGeometry SectionGeometry
fScale double
 SetPlotStyleName(SectionType, SectionGeometry, string)
public void SetPlotStyleName(SectionType nSecType, SectionGeometry nGeometry, string pszPlotStyleName)
Parameters
nSecType SectionType
nGeometry SectionGeometry
pszPlotStyleName string
 SetSourceObjects(SectionType, ObjectIdCollection)
public void SetSourceObjects(SectionType nSecType, ObjectIdCollection ids)
Parameters
nSecType SectionType
ids ObjectIdCollection
 SetVisibility(SectionType, SectionGeometry, bool)
public void SetVisibility(SectionType nSecType, SectionGeometry nGeometry, bool bVisible)
Parameters
nSecType SectionType
nGeometry SectionGeometry
bVisible bool
 Visibility(SectionType, SectionGeometry)
public bool Visibility(SectionType nSecType, SectionGeometry nGeometry)
Parameters
nSecType SectionType
nGeometry SectionGeometry
Returns
bool