Table of Contents
 Class TableStyle
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbTableStyle")]
public class TableStyle : DBObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
TableStyle
Implements
IDisposable
ICloneable
Inherited Members
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 TableStyle()
public TableStyle()
 TableStyle(IntPtr, bool)
protected TableStyle(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 BitFlags
public virtual int BitFlags { get; set; }
Property Value
int
 CellStyles
public virtual ArrayList CellStyles { get; }
Property Value
ArrayList
 Description
public virtual string Description { get; set; }
Property Value
string
 FlowDirection
public virtual FlowDirection FlowDirection { get; set; }
Property Value
FlowDirection
 HorizontalCellMargin
[UnitType(UnitType.Distance)]
public virtual double HorizontalCellMargin { get; set; }
Property Value
double
 IsHeaderSuppressed
public virtual bool IsHeaderSuppressed { get; set; }
Property Value
bool
 IsTitleSuppressed
public virtual bool IsTitleSuppressed { get; set; }
Property Value
bool
 Name
public virtual string Name { get; set; }
Property Value
string
 Template
public virtual ObjectId Template { get; set; }
Property Value
ObjectId
 VerticalCellMargin
[UnitType(UnitType.Distance)]
public virtual double VerticalCellMargin { get; set; }
Property Value
double
Methods
 Alignment(RowType)
public virtual CellAlignment Alignment(RowType rowType)
Parameters
rowType RowType
Returns
CellAlignment
 BackgroundColor(RowType)
public virtual Color BackgroundColor(RowType rowType)
Parameters
rowType RowType
Returns
Color
 CellClass(string)
public virtual CellClass CellClass(string styleName)
Parameters
styleName string
Returns
CellClass
 Color(RowType)
public virtual Color Color(RowType rowType)
Parameters
rowType RowType
Returns
Color
 DataType(RowType)
public virtual DataType DataType(RowType rowType)
Parameters
rowType RowType
Returns
DataType
 Format(RowType)
public virtual string Format(RowType rowType)
Parameters
rowType RowType
Returns
string
 GridColor(GridLineType, RowType)
public virtual Color GridColor(GridLineType gridLineType, RowType rowType)
Parameters
gridLineType GridLineType
rowType RowType
Returns
Color
 GridDoubleLineSpacing(GridLineType, string)
public virtual double GridDoubleLineSpacing(GridLineType gridLineType, string styleName)
Parameters
gridLineType GridLineType
styleName string
Returns
double
 GridLineStyle(GridLineType, string)
public virtual GridLineStyle GridLineStyle(GridLineType gridLineType, string styleName)
Parameters
gridLineType GridLineType
styleName string
Returns
GridLineStyle
 GridLineWeight(GridLineType, RowType)
public virtual LineWeight GridLineWeight(GridLineType gridLineType, RowType rowType)
Parameters
gridLineType GridLineType
rowType RowType
Returns
LineWeight
 GridLinetype(GridLineType, string)
public virtual ObjectId GridLinetype(GridLineType gridLineType, string styleName)
Parameters
gridLineType GridLineType
styleName string
Returns
ObjectId
 GridVisibility(GridLineType, RowType)
public virtual bool GridVisibility(GridLineType gridLineType, RowType rowType)
Parameters
gridLineType GridLineType
rowType RowType
Returns
bool
 IsBackgroundColorNone(RowType)
public virtual bool IsBackgroundColorNone(RowType rowType)
Parameters
rowType RowType
Returns
bool
 Margin(CellMargins, string)
public virtual double Margin(CellMargins cellMargin, string styleName)
Parameters
cellMargin CellMargins
styleName string
Returns
double
 PostTableStyleToDatabase(Database, string)
public virtual ObjectId PostTableStyleToDatabase(Database databasePointer, string styleName)
Parameters
databasePointer Database
styleName string
Returns
ObjectId
 SetAlignment(CellAlignment, int)
public virtual void SetAlignment(CellAlignment alignment, int rowTypes)
Parameters
alignment CellAlignment
rowTypes int
 SetBackgroundColor(Color, int)
public virtual void SetBackgroundColor(Color color, int rowTypes)
Parameters
color Color
rowTypes int
 SetBackgroundColorNone(bool, int)
public virtual void SetBackgroundColorNone(bool value, int rowTypes)
Parameters
value bool
rowTypes int
 SetCellClass(CellClass, string)
public virtual void SetCellClass(CellClass cellClass, string styleName)
Parameters
cellClass CellClass
styleName string
 SetColor(Color, int)
public virtual void SetColor(Color color, int rowTypes)
Parameters
color Color
rowTypes int
 SetDataType(DataType, UnitType, RowType)
public virtual void SetDataType(DataType nDataType, UnitType nUnitType, RowType rowTypes)
Parameters
nDataType DataType
nUnitType UnitType
rowTypes RowType
 SetFormat(string, RowType)
public virtual void SetFormat(string pFormat, RowType rowTypes)
Parameters
pFormat string
rowTypes RowType
 SetGridColor(Color, int, int)
public virtual void SetGridColor(Color color, int gridLineTypes, int rowTypes)
Parameters
color Color
gridLineTypes int
rowTypes int
 SetGridDoubleLineSpacing(double, GridLineType, string)
public virtual void SetGridDoubleLineSpacing(double spacing, GridLineType gridLineTypes, string styleName)
Parameters
spacing double
gridLineTypes GridLineType
styleName string
 SetGridLineStyle(GridLineStyle, GridLineType, string)
public virtual void SetGridLineStyle(GridLineStyle lineStyle, GridLineType gridLineTypes, string styleName)
Parameters
lineStyle GridLineStyle
gridLineTypes GridLineType
styleName string
 SetGridLineWeight(LineWeight, int, int)
public virtual void SetGridLineWeight(LineWeight lineWeight, int gridLineTypes, int rowTypes)
Parameters
lineWeight LineWeight
gridLineTypes int
rowTypes int
 SetGridLinetype(ObjectId, GridLineType, string)
public virtual void SetGridLinetype(ObjectId linetype, GridLineType gridLineTypes, string styleName)
Parameters
linetype ObjectId
gridLineTypes GridLineType
styleName string
 SetGridVisibility(bool, int, int)
public virtual void SetGridVisibility(bool visible, int gridLineTypes, int rowTypes)
Parameters
visible bool
gridLineTypes int
rowTypes int
 SetMargin(CellMargins, double, string)
public virtual void SetMargin(CellMargins cellMargin, double margin, string styleName)
Parameters
cellMargin CellMargins
margin double
styleName string
 SetTextHeight(double, int)
public virtual void SetTextHeight(double height, int rowTypes)
Parameters
height double
rowTypes int
 SetTextHeight(double, string)
public void SetTextHeight(double value, string cellStyle)
Parameters
value double
cellStyle string
 SetTextStyle(ObjectId, int)
public virtual void SetTextStyle(ObjectId id, int rowTypes)
Parameters
id ObjectId
rowTypes int
 SetTextStyle(ObjectId, string)
public virtual void SetTextStyle(ObjectId id, string styleName)
Parameters
id ObjectId
styleName string
 TextHeight(RowType)
public virtual double TextHeight(RowType rowType)
Parameters
rowType RowType
Returns
double
 TextHeight(string)
public double TextHeight(string cellStyle)
Parameters
cellStyle string
Returns
double
 TextStyle(RowType)
public virtual ObjectId TextStyle(RowType rowType)
Parameters
rowType RowType
Returns
ObjectId
 TextStyle(string)
public virtual ObjectId TextStyle(string styleName)
Parameters
styleName string
Returns
ObjectId
 UnitType(RowType)
public virtual UnitType UnitType(RowType rowType)
Parameters
rowType RowType
Returns
UnitType