Table of Contents
 Struct ClipBoundary2dData
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public struct ClipBoundary2dData
Inherited Members
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Properties
 ClipCondition
public ClipCondition ClipCondition { get; }
Property Value
ClipCondition
 ClippedSegmentSourceLabel
public IntegerCollection ClippedSegmentSourceLabel { get; }
Property Value
IntegerCollection
 ClippedVertices
public Point2dCollection ClippedVertices { get; }
Property Value
Point2dCollection
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 IsEqualTo(ClipBoundary2dData)
public bool IsEqualTo(ClipBoundary2dData a)
Parameters
a ClipBoundary2dData
Returns
bool
Operators
 operator ==(ClipBoundary2dData, ClipBoundary2dData)
public static bool operator ==(ClipBoundary2dData a, ClipBoundary2dData b)
Parameters
a ClipBoundary2dData
b ClipBoundary2dData
Returns
bool
 operator !=(ClipBoundary2dData, ClipBoundary2dData)
public static bool operator !=(ClipBoundary2dData a, ClipBoundary2dData b)
Parameters
a ClipBoundary2dData
b ClipBoundary2dData
Returns
bool