Table of Contents
 Delegate VariableChangingEventHandler
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public delegate void VariableChangingEventHandler(object sender, VariableChangingEventArgs e)
Parameters
sender object
e VariableChangingEventArgs
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 VariableChangingEventHandler(object, IntPtr)
public VariableChangingEventHandler(object A_0, IntPtr A_1)
Parameters
A_0 object
A_1 IntPtr
Methods
 BeginInvoke(object, VariableChangingEventArgs, AsyncCallback, object)
public IAsyncResult BeginInvoke(object sender, VariableChangingEventArgs e, AsyncCallback callback, object obj)
Parameters
sender object
e VariableChangingEventArgs
callback AsyncCallback
obj object
Returns
IAsyncResult
 EndInvoke(IAsyncResult)
public void EndInvoke(IAsyncResult result)
Parameters
result IAsyncResult
 Invoke(object, VariableChangingEventArgs)
public void Invoke(object sender, VariableChangingEventArgs e)
Parameters
sender object
e VariableChangingEventArgs