Table of Contents
 Class Table
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbTable")]
public class Table : BlockReference, IDisposable, ICloneable, IEnumerable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
Entity
BlockReference
Table
Implements
IDisposable
ICloneable
IEnumerable
Inherited Members
 BlockReference.GeometryExtentsBestFit()
 BlockReference.GeometryExtentsBestFit(Matrix3d)
 BlockReference.ExplodeToOwnerSpace()
 BlockReference.ResetBlock()
 BlockReference.ConvertToStaticBlock(string)
 BlockReference.ConvertToStaticBlock()
 BlockReference.Dispose(bool)
 BlockReference.UnitFactor
 BlockReference.BlockUnit
 BlockReference.Name
 BlockReference.AnonymousBlockTableRecord
 BlockReference.DynamicBlockTableRecord
 BlockReference.IsDynamicBlock
 BlockReference.DynamicBlockReferencePropertyCollection
 BlockReference.TreatAsBlockRefForExplode
 BlockReference.AttributeCollection
 BlockReference.BlockTransform
 BlockReference.Normal
 BlockReference.Rotation
 BlockReference.ScaleFactors
 BlockReference.Position
 BlockReference.BlockTableRecord
 Entity.SetLayerId(ObjectId, bool)
 Entity.SetPropertiesFrom(Entity)
 Entity.GetPlane()
 Entity.AddSubentityPaths(FullSubentityPath[])
 Entity.DeleteSubentityPaths(FullSubentityPath[])
 Entity.TransformSubentityPathsBy(FullSubentityPath[], Matrix3d)
 Entity.GetGripPointsAtSubentityPath(FullSubentityPath, GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.MoveGripPointsAtSubentityPaths(FullSubentityPath[], IntPtr[], Vector3d, MoveGripPointsFlags)
 Entity.GetSubentityGeometricExtents(FullSubentityPath)
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, IntPtr, Point3d, Matrix3d, ObjectId[])
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, long, Point3d, Matrix3d, int, ObjectId[])
 Entity.GetGraphicsMarkersAtSubentityPathIntPtr(FullSubentityPath)
 Entity.Highlight(FullSubentityPath, bool)
 Entity.Highlight()
 Entity.Unhighlight(FullSubentityPath, bool)
 Entity.Unhighlight()
 Entity.PushHighlight(FullSubentityPath, HighlightStyle)
 Entity.PopHighlight(FullSubentityPath)
 Entity.HighlightState(FullSubentityPath)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection, Matrix3d)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection)
 Entity.IsContentSnappable()
 Entity.GetGripPoints(GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.GetGripPoints(Point3dCollection, IntegerCollection, IntegerCollection)
 Entity.MoveGripPointsAt(GripDataCollection, Vector3d, MoveGripPointsFlags)
 Entity.MoveGripPointsAt(IntegerCollection, Vector3d)
 Entity.GetStretchPoints(Point3dCollection)
 Entity.MoveStretchPointsAt(IntegerCollection, Vector3d)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.List()
 Entity.TransformBy(Matrix3d)
 Entity.GetTransformedCopy(Matrix3d)
 Entity.GetSubentity(FullSubentityPath)
 Entity.Explode(DBObjectCollection)
 Entity.RecordGraphicsModified(bool)
 Entity.Draw()
 Entity.SaveAs(WorldDraw, SaveType)
 Entity.SetDatabaseDefaults(Database)
 Entity.SetDatabaseDefaults()
 Entity.SetDragStatus(DragStatus)
 Entity.SetGripStatus(GripStatus)
 Entity.SetSubentityGripStatus(GripStatus, FullSubentityPath)
 Entity.JoinEntity(Entity)
 Entity.JoinEntities(Entity[])
 Entity.EdgeStyleId
 Entity.FaceStyleId
 Entity.VisualStyleId
 Entity.ForceAnnoAllVisible
 Entity.BlockName
 Entity.MaterialMapper
 Entity.MaterialId
 Entity.Material
 Entity.ReceiveShadows
 Entity.CastShadows
 Entity.Hyperlinks
 Entity.CloneMeForDragging
 Entity.CompoundObjectTransform
 Entity.GeometricExtents
 Entity.Ecs
 Entity.IsPlanar
 Entity.CollisionType
 Entity.LineWeight
 Entity.Visible
 Entity.LinetypeScale
 Entity.LinetypeId
 Entity.Linetype
 Entity.LayerId
 Entity.Layer
 Entity.PlotStyleNameId
 Entity.PlotStyleName
 Entity.Transparency
 Entity.EntityColor
 Entity.ColorIndex
 Entity.Color
 Entity.BlockId
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Table()
public Table()
 Table(IntPtr, bool)
protected Table(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 BreakEnabled
public virtual bool BreakEnabled { get; set; }
Property Value
bool
 BreakFlowDirection
public virtual TableBreakFlowDirection BreakFlowDirection { get; set; }
Property Value
TableBreakFlowDirection
 BreakOptions
public virtual TableBreakOptions BreakOptions { get; set; }
Property Value
TableBreakOptions
 Cells
public CellRange Cells { get; }
Property Value
CellRange
 Columns
public ColumnsCollection Columns { get; }
Property Value
ColumnsCollection
 Direction
public virtual Vector3d Direction { get; set; }
Property Value
Vector3d
 FlowDirection
public virtual FlowDirection FlowDirection { get; set; }
Property Value
FlowDirection
 HasSubSelection
public virtual bool HasSubSelection { get; }
Property Value
bool
 Height
[UnitType(UnitType.Distance)]
public virtual double Height { get; set; }
Property Value
double
 HorizontalCellMargin
[Obsolete("Use Table.Cells[row, column].HorizontalLine.Margin instead.")]
[UnitType(UnitType.Distance)]
public virtual double HorizontalCellMargin { get; set; }
Property Value
double
 IsHeaderSuppressed
[Obsolete("Use Cell functionality instead.")]
public virtual bool IsHeaderSuppressed { get; set; }
Property Value
bool
 IsTitleSuppressed
[Obsolete("Use Cell functionality instead.")]
public virtual bool IsTitleSuppressed { get; set; }
Property Value
bool
 MinimumTableHeight
[UnitType(UnitType.Distance)]
public virtual double MinimumTableHeight { get; }
Property Value
double
 MinimumTableWidth
[UnitType(UnitType.Distance)]
public virtual double MinimumTableWidth { get; }
Property Value
double
 NumColumns
[Obsolete("Use Table.Columns.Count for getter instead; Use Table.SetSize(int numRows,int numCols) for setter instead.")]
public virtual int NumColumns { get; set; }
Property Value
int
 NumRows
[Obsolete("Use Table.Rows.Count for getter instead; Use Table.SetSize(int numRows,int numCols) for setter instead.")]
public virtual int NumRows { get; set; }
Property Value
int
 Rows
public RowsCollection Rows { get; }
Property Value
RowsCollection
 SubSelection
public virtual CellRange SubSelection { get; set; }
Property Value
CellRange
 TableStyle
public virtual ObjectId TableStyle { get; set; }
Property Value
ObjectId
 TableStyleName
public string TableStyleName { get; }
Property Value
string
 VerticalCellMargin
[UnitType(UnitType.Distance)]
[Obsolete("Use Table.Cells[row, column].VerticalLine.Margin instead.")]
public virtual double VerticalCellMargin { get; set; }
Property Value
double
 Width
[UnitType(UnitType.Distance)]
public virtual double Width { get; set; }
Property Value
double
Methods
 Alignment(RowType)
[Obsolete("Use Cell functionality instead.")]
public virtual CellAlignment Alignment(RowType type)
Parameters
type RowType
Returns
CellAlignment
 Alignment(int, int)
[Obsolete("Use Table.Cells[row,column].Alignment instead.")]
public virtual CellAlignment Alignment(int row, int col)
Parameters
row int
col int
Returns
CellAlignment
 AttachmentPoint(int, int)
[Obsolete("Use Table.Cells[row,column].AttachmentPoint instead.")]
public virtual Point3d AttachmentPoint(int row, int col)
Parameters
row int
col int
Returns
Point3d
 BackgroundColor(RowType)
[Obsolete("Use Cell functionality instead.")]
public virtual Color BackgroundColor(RowType type)
Parameters
type RowType
Returns
Color
 BackgroundColor(int, int)
[Obsolete("Use Table.Cells[row,column].BackgroundColor instead.")]
public virtual Color BackgroundColor(int row, int col)
Parameters
row int
col int
Returns
Color
 BlockRotation(int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].Rotation instead.")]
public virtual double BlockRotation(int row, int col)
Parameters
row int
col int
Returns
double
 BlockScale(int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].Scale instead.")]
public virtual double BlockScale(int row, int col)
Parameters
row int
col int
Returns
double
 BlockTableRecordId(int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].BlockTableRecordId instead.")]
public virtual ObjectId BlockTableRecordId(int row, int col)
Parameters
row int
col int
Returns
ObjectId
 CanDeleteColumns(int, int)
[Obsolete("Use CellRange.CanDeleteColumns instead")]
public virtual bool CanDeleteColumns(int index, int nCount)
Parameters
index int
nCount int
Returns
bool
 CanDeleteRows(int, int)
[Obsolete("Use CellRange.CanDeleteRows instead")]
public virtual bool CanDeleteRows(int index, int nCount)
Parameters
index int
nCount int
Returns
bool
 CanInsertColumn(int)
[Obsolete("Use Table.Columns[column].CanInsertColumn instead")]
public virtual bool CanInsertColumn(int index)
Parameters
index int
Returns
bool
 CanInsertRow(int)
[Obsolete("Use Table.Rows[row].CanInsertRow instead")]
public virtual bool CanInsertRow(int index)
Parameters
index int
Returns
bool
 CellStyleOverrides(int, int)
[Obsolete("Use Table.Cells[row,column].StyleOverrides instead.")]
public virtual TableStyleOverride[] CellStyleOverrides(int row, int col)
Parameters
row int
col int
Returns
TableStyleOverride[]
 CellType(int, int)
public virtual TableCellType CellType(int row, int col)
Parameters
row int
col int
Returns
TableCellType
 ClearSubSelection()
public virtual void ClearSubSelection()
 ClearTableStyleOverrides(int)
[Obsolete("Use Cell functionality instead.")]
public virtual void ClearTableStyleOverrides(int options)
Parameters
options int
 ColumnWidth(int)
[Obsolete("Use Table.Columns[col].Width instead.")]
public virtual double ColumnWidth(int col)
Parameters
col int
Returns
double
 ContentColor(RowType)
[Obsolete("Use Cell functionality instead.")]
public virtual Color ContentColor(RowType type)
Parameters
type RowType
Returns
Color
 ContentColor(int, int)
[Obsolete("Use Table.Cells[row,column].ContentColor instead.")]
public virtual Color ContentColor(int row, int col)
Parameters
row int
col int
Returns
Color
 CopyFrom(LinkedTableData, TableCopyOptions)
public virtual void CopyFrom(LinkedTableData source, TableCopyOptions options)
Parameters
source LinkedTableData
options TableCopyOptions
 CopyFrom(LinkedTableData, TableCopyOptions, CellRange, CellRange)
public virtual CellRange CopyFrom(LinkedTableData source, TableCopyOptions options, CellRange sourceRange, CellRange targetRange)
Parameters
source LinkedTableData
options TableCopyOptions
sourceRange CellRange
targetRange CellRange
Returns
CellRange
 CopyFrom(Table, TableCopyOptions, CellRange, CellRange)
public virtual CellRange CopyFrom(Table source, TableCopyOptions options, CellRange sourceRange, CellRange targetRange)
Parameters
source Table
options TableCopyOptions
sourceRange CellRange
targetRange CellRange
Returns
CellRange
 CreateContent(int, int, int)
[Obsolete("Use Table.Cells[row,column].Contents.Add or InsertAt instead.")]
public virtual int CreateContent(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
Returns
int
 DataType(RowType)
[Obsolete("Use Table.Cells[row,column].DataType instead.")]
public virtual DataType DataType(RowType type)
Parameters
type RowType
Returns
DataType
 DataType(int, int)
[Obsolete("Use Table.Cells[row,column].DataType instead.")]
public virtual DataType DataType(int row, int col)
Parameters
row int
col int
Returns
DataType
 DeleteCellContent(int, int)
[Obsolete("Use Table.Cells[row,column].DeleteCellContent instead.")]
public virtual void DeleteCellContent(int row, int col)
Parameters
row int
col int
 DeleteColumns(int, int)
public virtual void DeleteColumns(int col, int columns)
Parameters
col int
columns int
 DeleteContent(CellRange)
[Obsolete("Use CellRange.DeleteContent instead.")]
public virtual void DeleteContent(CellRange A_0)
Parameters
A_0 CellRange
 DeleteContent(int, int)
[Obsolete("Use Table.Cells[row,column].Contents.Clear instead.")]
public virtual void DeleteContent(int row, int column)
Parameters
row int
column int
 DeleteContent(int, int, int)
[Obsolete("Use Table.Cells[row,column].Contents.RemoveAt instead.")]
public virtual void DeleteContent(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
 DeleteRows(int, int)
public virtual void DeleteRows(int row, int rows)
Parameters
row int
rows int
 FieldId(int, int)
[Obsolete("Use Table.Cells[row,column].FieldId instead.")]
public virtual ObjectId FieldId(int row, int col)
Parameters
row int
col int
Returns
ObjectId
 Fill(CellRange, CellRange, TableFillOptions)
public virtual void Fill(CellRange fillRange, CellRange sourceRange, TableFillOptions options)
Parameters
fillRange CellRange
sourceRange CellRange
options TableFillOptions
 Format(RowType)
[Obsolete("Use Table.Cells[row,column].DataFormat instead.")]
public virtual string Format(RowType type)
Parameters
type RowType
Returns
string
 Format(int, int)
[Obsolete("Use Table.Cells[row,column].DataFormat instead.")]
public virtual string Format(int row, int col)
Parameters
row int
col int
Returns
string
 GenerateLayout()
public virtual void GenerateLayout()
 GetBlockAttributeValue(int, int, ObjectId)
[Obsolete("Use Table.Cells[row,column].Contents[i].GetBlockAttributeValue instead.")]
public virtual string GetBlockAttributeValue(int row, int col, ObjectId attributeDefinitionId)
Parameters
row int
col int
attributeDefinitionId ObjectId
Returns
string
 GetBlockAttributeValue(int, int, int, ObjectId)
[Obsolete("Use Table.Cells[row,column].Contents[i].GetBlockAttributeValue instead.")]
public virtual string GetBlockAttributeValue(int row, int column, int contentIndex, ObjectId attDefId)
Parameters
row int
column int
contentIndex int
attDefId ObjectId
Returns
string
 GetBlockTableRecordId(int, int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].BlockTableRecordId instead.")]
public virtual ObjectId GetBlockTableRecordId(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
Returns
ObjectId
 GetBreakHeight(int)
public virtual double GetBreakHeight(int index)
Parameters
index int
Returns
double
 GetBreakOffset(int)
public virtual Vector3d GetBreakOffset(int index)
Parameters
index int
Returns
Vector3d
 GetBreakSpacing()
public virtual double GetBreakSpacing()
Returns
double
 GetCellExtents(int, int, bool, Point3dCollection)
[Obsolete("Use Table.Cells[row,column].GetExtents instead.")]
public virtual void GetCellExtents(int row, int col, bool isOuterCell, Point3dCollection pts)
Parameters
row int
col int
isOuterCell bool
pts Point3dCollection
 GetCellState(int, int)
[Obsolete("Use Table.Cells[row,column].State instead.")]
public virtual CellStates GetCellState(int row, int column)
Parameters
row int
column int
Returns
CellStates
 GetCellStyle(int, int)
[Obsolete("Use Table.Cells[row,column].Style instead.")]
public virtual string GetCellStyle(int row, int column)
Parameters
row int
column int
Returns
string
 GetColumnName(int)
[Obsolete("Use Table.Columns[i].Name instead.")]
public virtual string GetColumnName(int index)
Parameters
index int
Returns
string
 GetContentColor(int, int, int)
[Obsolete("Use Table.Cells[row,column].ContentColor instead.")]
public virtual Color GetContentColor(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
Returns
Color
 GetContentLayout(int, int)
[Obsolete("Use Table.Cells[row,column].ContentLayout instead.")]
public virtual CellContentLayout GetContentLayout(int row, int column)
Parameters
row int
column int
Returns
CellContentLayout
 GetContentTypes(int, int)
[Obsolete("Use Table.Cells[row,column].ContentTypes instead.")]
public virtual CellContentTypes GetContentTypes(int row, int column)
Parameters
row int
column int
Returns
CellContentTypes
 GetContentTypes(int, int, int)
[Obsolete("Use Table.Cells[row,column].Content[i].ContentTypes instead.")]
public virtual CellContentTypes GetContentTypes(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
Returns
CellContentTypes
 GetCustomData(int, int)
[Obsolete("Use Table.Cells[row,column].GetCustomData instead.")]
public virtual int GetCustomData(int row, int column)
Parameters
row int
column int
Returns
int
 GetCustomData(int, int, string)
[Obsolete("Use Table.Cells[row,column].SetCustomData instead.")]
public virtual object GetCustomData(int row, int column, string key)
Parameters
row int
column int
key string
Returns
object
 GetDataFormat(int, int)
[Obsolete("Use Table.Cells[row,column].DataFormat instead.")]
public virtual string GetDataFormat(int row, int column)
Parameters
row int
column int
Returns
string
 GetDataFormat(int, int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].DataFormat instead.")]
public virtual string GetDataFormat(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
Returns
string
 GetDataLink()
public virtual ObjectIdCollection GetDataLink()
Returns
ObjectIdCollection
 GetDataLink(CellRange)
[Obsolete("CellRange.GetDataLink instead.")]
public virtual ObjectIdCollection GetDataLink(CellRange range)
Parameters
range CellRange
Returns
ObjectIdCollection
 GetDataLink(int, int)
[Obsolete("Use Table.Cells[row,column].DataLink instead.")]
public virtual ObjectId GetDataLink(int row, int column)
Parameters
row int
column int
Returns
ObjectId
 GetDataLinkRange(int, int)
[Obsolete("Use Table.Cells[row,column].GetDataLinkRange instead.")]
public virtual CellRange GetDataLinkRange(int row, int column)
Parameters
row int
column int
Returns
CellRange
 GetDataType(int, int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].DataType instead.")]
public virtual DataTypeParameter GetDataType(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
Returns
DataTypeParameter
 GetEnumerator()
[Obsolete("Use Table.Cells instead.")]
public virtual TableEnumerator GetEnumerator()
Returns
TableEnumerator
 GetEnumerator(CellRange, TableEnumeratorOption)
[Obsolete("Use Table.Cells instead.")]
public virtual TableEnumerator GetEnumerator(CellRange range, TableEnumeratorOption option)
Parameters
range CellRange
option TableEnumeratorOption
Returns
TableEnumerator
 GetFieldId(int, int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].FieldId instead.")]
public virtual ObjectId GetFieldId(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
Returns
ObjectId
 GetFormula(int, int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].Formula instead.")]
public virtual string GetFormula(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
Returns
string
 GetGridColor(int, int, GridLineType)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Color instead.")]
public virtual Color GetGridColor(int row, int column, GridLineType gridLineType)
Parameters
row int
column int
gridLineType GridLineType
Returns
Color
 GetGridDoubleLineSpacing(int, int, GridLineType)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.DoubleLineSpacing instead.")]
public virtual double GetGridDoubleLineSpacing(int row, int column, GridLineType gridLineType)
Parameters
row int
column int
gridLineType GridLineType
Returns
double
 GetGridLineStyle(int, int, GridLineType)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.LineStyle instead.")]
public virtual GridLineStyle GetGridLineStyle(int row, int column, GridLineType gridLineType)
Parameters
row int
column int
gridLineType GridLineType
Returns
GridLineStyle
 GetGridLineWeight(int, int, GridLineType)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.LineWeight instead.")]
public virtual LineWeight GetGridLineWeight(int row, int column, GridLineType gridLineType)
Parameters
row int
column int
gridLineType GridLineType
Returns
LineWeight
 GetGridLinetype(int, int, GridLineType)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Linetype instead.")]
public virtual ObjectId GetGridLinetype(int row, int column, GridLineType gridLineType)
Parameters
row int
column int
gridLineType GridLineType
Returns
ObjectId
 GetGridProperty(int, int, GridLineType)
public virtual GridPropertyParameter GetGridProperty(int row, int column, GridLineType gridLineType)
Parameters
row int
column int
gridLineType GridLineType
Returns
GridPropertyParameter
 GetGridVisibility(int, int, GridLineType)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.IsVisible instead.")]
public virtual Visibility GetGridVisibility(int row, int column, GridLineType gridLineType)
Parameters
row int
column int
gridLineType GridLineType
Returns
Visibility
 GetIsAutoScale(int, int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].IsAutoScale instead.")]
public virtual bool GetIsAutoScale(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
Returns
bool
 GetMargin(int, int, CellMargins)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Margin instead.")]
public virtual double GetMargin(int row, int column, CellMargins margin)
Parameters
row int
column int
margin CellMargins
Returns
double
 GetMergeAllEnabled(int, int)
[Obsolete("Use Table.Cells[row,column].IsMergeAllEnabled instead.")]
public virtual bool GetMergeAllEnabled(int row, int column)
Parameters
row int
column int
Returns
bool
 GetMergeRange(int, int)
[Obsolete("Use Table.Cells[row,column].GetMergeRange instead.")]
public virtual CellRange GetMergeRange(int row, int column)
Parameters
row int
column int
Returns
CellRange
 GetNumberOfContents(int, int)
[Obsolete("Use Table.Cells[row,column].Contents.Count instead.")]
public virtual int GetNumberOfContents(int row, int column)
Parameters
row int
column int
Returns
int
 GetOverrides(int, int, GridLineType)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Overrides instead.")]
public virtual CellProperties GetOverrides(int row, int column, GridLineType gridLineType)
Parameters
row int
column int
gridLineType GridLineType
Returns
CellProperties
 GetOverrides(int, int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].Overrides instead.")]
public virtual CellProperties GetOverrides(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
Returns
CellProperties
 GetRotation(int, int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].Rotation instead.")]
public virtual double GetRotation(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
Returns
double
 GetScale(int, int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].Scale instead.")]
public virtual double GetScale(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
Returns
double
 GetTextHeight(int, int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].TextHeight instead.")]
public virtual double GetTextHeight(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
Returns
double
 GetTextString(int, int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].TextString instead.")]
public virtual string GetTextString(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
Returns
string
 GetTextString(int, int, int, FormatOption)
[Obsolete("Use Table.Cells[row,column].Contents[i].SetTextString instead.")]
public virtual string GetTextString(int row, int column, int contentIndex, FormatOption formatOption)
Parameters
row int
column int
contentIndex int
formatOption FormatOption
Returns
string
 GetTextStyleId(int, int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].TextStyleId instead.")]
public virtual ObjectId GetTextStyleId(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
Returns
ObjectId
 GetToolTip(int, int)
[Obsolete("Use Table.Cells[row,column].ToolTip instead.")]
public virtual string GetToolTip(int row, int column)
Parameters
row int
column int
Returns
string
 GetValue(int, int, int)
[Obsolete("Use Table.Cells[row,column].Content[i].Value instead.")]
public virtual object GetValue(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
Returns
object
 GetValue(int, int, int, FormatOption)
[Obsolete("Use Table.Cells[row,column].Content[i].GetValue instead.")]
public virtual object GetValue(int row, int column, int contentIndex, FormatOption formatOption)
Parameters
row int
column int
contentIndex int
formatOption FormatOption
Returns
object
 GridColor(GridLineType, RowType)
[Obsolete("Use Cell functionality instead.")]
public virtual Color GridColor(GridLineType gridlineType, RowType type)
Parameters
gridlineType GridLineType
type RowType
Returns
Color
 GridColor(int, int, CellEdgeMasks)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Color instead.")]
public virtual Color GridColor(int row, int col, CellEdgeMasks edge)
Parameters
row int
col int
edge CellEdgeMasks
Returns
Color
 GridLineWeight(GridLineType, RowType)
[Obsolete("Use Cell functionality instead.")]
public virtual LineWeight GridLineWeight(GridLineType gridlineType, RowType type)
Parameters
gridlineType GridLineType
type RowType
Returns
LineWeight
 GridLineWeight(int, int, CellEdgeMasks)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.LineWeight instead.")]
public virtual LineWeight GridLineWeight(int row, int col, CellEdgeMasks edge)
Parameters
row int
col int
edge CellEdgeMasks
Returns
LineWeight
 GridVisibility(GridLineType, RowType)
[Obsolete("Use Cell functionality instead.")]
public virtual bool GridVisibility(GridLineType gridlineType, RowType type)
Parameters
gridlineType GridLineType
type RowType
Returns
bool
 GridVisibility(int, int, CellEdgeMasks)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Visibility instead.")]
public virtual bool GridVisibility(int row, int col, CellEdgeMasks edge)
Parameters
row int
col int
edge CellEdgeMasks
Returns
bool
 HasFormula(int, int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].HasFormula instead.")]
public virtual bool HasFormula(int row, int column, int contentIndex)
Parameters
row int
column int
contentIndex int
Returns
bool
 HitTest(Point3d, Vector3d)
public virtual TableHitTestInfo HitTest(Point3d point, Vector3d viewVector)
Parameters
point Point3d
viewVector Vector3d
Returns
TableHitTestInfo
 InsertColumns(int, double, int)
public virtual void InsertColumns(int col, double width, int columns)
Parameters
col int
width double
columns int
 InsertColumnsAndInherit(int, int, int)
public virtual void InsertColumnsAndInherit(int col, int inheritFrom, int numCols)
Parameters
col int
inheritFrom int
numCols int
 InsertRows(int, double, int)
public virtual void InsertRows(int row, double height, int rows)
Parameters
row int
height double
rows int
 InsertRowsAndInherit(int, int, int)
public virtual void InsertRowsAndInherit(int index, int inheritFrom, int numRows)
Parameters
index int
inheritFrom int
numRows int
 IsAutoScale(int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].IsAutoScale instead.")]
public virtual bool IsAutoScale(int row, int col)
Parameters
row int
col int
Returns
bool
 IsBackgroundColorNone(RowType)
[Obsolete("Use Cell functionality instead.")]
public virtual bool IsBackgroundColorNone(RowType type)
Parameters
type RowType
Returns
bool
 IsBackgroundColorNone(int, int)
[Obsolete("Use Table.Cells[row,column].IsBackgroundColorNone instead.")]
public virtual bool IsBackgroundColorNone(int row, int col)
Parameters
row int
col int
Returns
bool
 IsContentEditable(int, int)
[Obsolete("Use Table.Cells[row,column].IsContentEditable instead.")]
public virtual bool IsContentEditable(int row, int column)
Parameters
row int
column int
Returns
bool
 IsEmpty(int, int)
[Obsolete("Use Table.Cells[row,column].IsEmpty instead.")]
public virtual bool IsEmpty(int row, int column)
Parameters
row int
column int
Returns
bool
 IsFormatEditable(int, int)
[Obsolete("Use Table.Cells[row,column].IsFormatEditable instead.")]
public virtual bool IsFormatEditable(int row, int column)
Parameters
row int
column int
Returns
bool
 IsLinked(int, int)
[Obsolete("Use Table.Cells[row,column].IsLinked instead.")]
public virtual bool IsLinked(int row, int column)
Parameters
row int
column int
Returns
bool
 IsMergedCell(int, int, out CellRange)
[Obsolete("Use Table.Cells[row,column].GetMergeRange instead.")]
public bool IsMergedCell(int row, int col, out CellRange range)
Parameters
row int
col int
range CellRange
Returns
bool
 MergeCells(CellRange)
public virtual void MergeCells(CellRange range)
Parameters
range CellRange
 MinimumColumnWidth(int)
[Obsolete("Use Table.Columns[col].MinimumWidth instead.")]
public virtual double MinimumColumnWidth(int col)
Parameters
col int
Returns
double
 MinimumRowHeight(int)
[Obsolete("Use Table.Rows[col].MinimumHeight instead.")]
public virtual double MinimumRowHeight(int row)
Parameters
row int
Returns
double
 MoveContent(int, int, int, int)
[Obsolete("Use Table.Cells[row,column].Contents.Move instead.")]
public virtual void MoveContent(int row, int column, int fromIndex, int toIndex)
Parameters
row int
column int
fromIndex int
toIndex int
 RecomputeTableBlock(bool)
public virtual void RecomputeTableBlock(bool forceUpdate)
Parameters
forceUpdate bool
 RemoveAllOverrides(int, int)
[Obsolete("Use Cell functionality instead.")]
public virtual void RemoveAllOverrides(int row, int column)
Parameters
row int
column int
 RemoveDataLink()
public virtual void RemoveDataLink()
 RemoveDataLink(int, int)
[Obsolete("Use Table.Cells[row,column].RemoveDataLink instead.")]
public virtual void RemoveDataLink(int row, int column)
Parameters
row int
column int
 ReselectSubRegion(FullSubentityPath[])
public virtual void ReselectSubRegion(FullSubentityPath[] paths)
Parameters
paths FullSubentityPath[]
 ResetValue(int, int)
[Obsolete("Use Table.Cells[row,column].Contents(i).ResetValue instead.")]
public virtual void ResetValue(int row, int col)
Parameters
row int
col int
 RowHeight(int)
[Obsolete("Use Table.Rows[col].Height instead.")]
public virtual double RowHeight(int row)
Parameters
row int
Returns
double
 RowType(int)
[Obsolete("Use Row functionality instead.")]
public virtual RowType RowType(int row)
Parameters
row int
Returns
RowType
 Select(Point3d, Vector3d, Vector3d, bool, bool, FullSubentityPath[])
public virtual TableHitTestInfo Select(Point3d pickingPoint, Vector3d hitTestViewDirection, Vector3d hitTestViewOrientation, bool allowOutside, bool inPickFirst, FullSubentityPath[] paths)
Parameters
pickingPoint Point3d
hitTestViewDirection Vector3d
hitTestViewOrientation Vector3d
allowOutside bool
inPickFirst bool
paths FullSubentityPath[]
Returns
TableHitTestInfo
 SelectSubRegion(Point3d, Point3d, Vector3d, Vector3d, SelectType, bool, bool, FullSubentityPath[])
public virtual CellRange SelectSubRegion(Point3d cornerPoint1, Point3d cornerPoint2, Vector3d selectionViewDirection, Vector3d hitTestViewDirection, SelectType selectionType, bool includeCurrentSelection, bool inPickFirst, FullSubentityPath[] paths)
Parameters
cornerPoint1 Point3d
cornerPoint2 Point3d
selectionViewDirection Vector3d
hitTestViewDirection Vector3d
selectionType SelectType
includeCurrentSelection bool
inPickFirst bool
paths FullSubentityPath[]
Returns
CellRange
 SetAlignment(CellAlignment, int)
[Obsolete("Use Cell functionality instead.")]
public virtual void SetAlignment(CellAlignment align, int rowTypes)
Parameters
align CellAlignment
rowTypes int
 SetAlignment(int, int, CellAlignment)
[Obsolete("Use Table.Cells[row,column].Alignment instead.")]
public virtual void SetAlignment(int row, int col, CellAlignment align)
Parameters
row int
col int
align CellAlignment
 SetAutoScale(int, int, bool)
[Obsolete("Use Table.Cells[row,column].Contents[i].IsAutoScale instead.")]
public virtual void SetAutoScale(int row, int col, bool autoFit)
Parameters
row int
col int
autoFit bool
 SetBackgroundColor(Color, int)
[Obsolete("Use Cell functionality instead.")]
public virtual void SetBackgroundColor(Color color, int rowTypes)
Parameters
color Color
rowTypes int
 SetBackgroundColor(int, int, Color)
[Obsolete("Use Table.Cells[row,column].BackgroundColor instead.")]
public virtual void SetBackgroundColor(int row, int col, Color color)
Parameters
row int
col int
color Color
 SetBackgroundColorNone(bool, int)
[Obsolete("Use Cell functionality instead.")]
public virtual void SetBackgroundColorNone(bool value, int rowTypes)
Parameters
value bool
rowTypes int
 SetBackgroundColorNone(int, int, bool)
[Obsolete("Use Table.Cells[row,column].IsBackgroundColorNone instead.")]
public virtual void SetBackgroundColorNone(int row, int col, bool value)
Parameters
row int
col int
value bool
 SetBlockAttributeValue(int, int, ObjectId, string)
[Obsolete("Use Table.Cells[row,column].Contents[i].GetBlockAttributeValue instead.")]
public virtual void SetBlockAttributeValue(int row, int col, ObjectId attributeDefinitionId, string value)
Parameters
row int
col int
attributeDefinitionId ObjectId
value string
 SetBlockAttributeValue(int, int, int, ObjectId, string)
[Obsolete("Use Table.Cells[row,column].Contents[i].GetBlockAttributeValue instead.")]
public virtual void SetBlockAttributeValue(int row, int column, int contentIndex, ObjectId attDefId, string value)
Parameters
row int
column int
contentIndex int
attDefId ObjectId
value string
 SetBlockRotation(int, int, double)
[Obsolete("Use Table.Cells[row,column].Contents[i].Rotation instead.")]
public virtual void SetBlockRotation(int row, int col, double rotationalAngle)
Parameters
row int
col int
rotationalAngle double
 SetBlockScale(int, int, double)
[Obsolete("Use Table.Cells[row,column].Contents[i].Scale instead.")]
public virtual void SetBlockScale(int row, int col, double scale)
Parameters
row int
col int
scale double
 SetBlockTableRecordId(int, int, ObjectId, bool)
[Obsolete("Use Table.Cells[row,column].Contents[i].BlockTableRecordId instead.")]
public virtual void SetBlockTableRecordId(int row, int col, ObjectId blockId, bool autoFit)
Parameters
row int
col int
blockId ObjectId
autoFit bool
 SetBlockTableRecordId(int, int, int, ObjectId, bool)
[Obsolete("Use Table.Cells[row,column].Contents[i].BlockTableRecordId instead.")]
public virtual void SetBlockTableRecordId(int row, int column, int contentIndex, ObjectId blockId, bool autoFit)
Parameters
row int
column int
contentIndex int
blockId ObjectId
autoFit bool
 SetBreakHeight(int, double)
public virtual void SetBreakHeight(int index, double height)
Parameters
index int
height double
 SetBreakOffset(int, Vector3d)
public virtual void SetBreakOffset(int index, Vector3d offset)
Parameters
index int
offset Vector3d
 SetBreakSpacing(double)
public virtual void SetBreakSpacing(double spacing)
Parameters
spacing double
 SetCellState(int, int, CellStates)
[Obsolete("Use Table.Cells[row,column].State instead.")]
public virtual void SetCellState(int row, int column, CellStates cellState)
Parameters
row int
column int
cellState CellStates
 SetCellStyle(int, int, string)
[Obsolete("Use Table.Cells[row,column].Style instead.")]
public virtual void SetCellStyle(int row, int column, string styleName)
Parameters
row int
column int
styleName string
 SetCellType(int, int, TableCellType)
[Obsolete("Use Cell functionality instead.")]
public virtual void SetCellType(int row, int col, TableCellType type)
Parameters
row int
col int
type TableCellType
 SetColumnName(int, string)
[Obsolete("Use Table.Columns[i].Name instead.")]
public virtual void SetColumnName(int index, string name)
Parameters
index int
name string
 SetColumnWidth(double)
public virtual void SetColumnWidth(double width)
Parameters
width double
 SetColumnWidth(int, double)
[Obsolete("Use Table.Columns[col].Width instead.")]
public virtual void SetColumnWidth(int col, double width)
Parameters
col int
width double
 SetContentColor(Color, int)
[Obsolete("Use Cell functionality instead.")]
public virtual void SetContentColor(Color color, int rowType)
Parameters
color Color
rowType int
 SetContentColor(int, int, Color)
[Obsolete("Use Table.Cells[row,column].ContentColor instead.")]
public virtual void SetContentColor(int row, int col, Color color)
Parameters
row int
col int
color Color
 SetContentColor(int, int, int, Color)
[Obsolete("Use Table.Cells[row,column].ContentColor instead.")]
public virtual void SetContentColor(int row, int column, int contentIndex, Color color)
Parameters
row int
column int
contentIndex int
color Color
 SetContentLayout(int, int, CellContentLayout)
[Obsolete("Use Table.Cells[row,column].ContentLayout instead.")]
public virtual void SetContentLayout(int row, int column, CellContentLayout layout)
Parameters
row int
column int
layout CellContentLayout
 SetCustomData(int, int, int)
[Obsolete("Use Table.Cells[row,column].SetCustomData instead.")]
public virtual void SetCustomData(int row, int column, int data)
Parameters
row int
column int
data int
 SetCustomData(int, int, string, object)
[Obsolete("Use Table.Cells[row,column].SetCustomData instead.")]
public virtual void SetCustomData(int row, int column, string key, object value)
Parameters
row int
column int
key string
value object
 SetDataFormat(int, int, int, string)
[Obsolete("Use Table.Cells[row,column].Contents[i].DataFormat instead.")]
public virtual void SetDataFormat(int row, int column, int contentIndex, string format)
Parameters
row int
column int
contentIndex int
format string
 SetDataFormat(int, int, string)
[Obsolete("Use Table.Cells[row,column].DataFormat instead.")]
public virtual void SetDataFormat(int row, int column, string format)
Parameters
row int
column int
format string
 SetDataLink(CellRange, ObjectId, bool)
[Obsolete("CellRange.SetDataLink instead.")]
public virtual void SetDataLink(CellRange range, ObjectId dataLinkId, bool bUpdate)
Parameters
range CellRange
dataLinkId ObjectId
bUpdate bool
 SetDataLink(int, int, ObjectId, bool)
[Obsolete("Use Table.Cells[row,column].DataLink instead.")]
public virtual void SetDataLink(int row, int column, ObjectId dataLinkId, bool bUpdate)
Parameters
row int
column int
dataLinkId ObjectId
bUpdate bool
 SetDataType(DataType, UnitType, int)
[Obsolete("Use Table.Cells[row,column].DataType instead.")]
public virtual void SetDataType(DataType nDataType, UnitType nUnitType, int rowTypes)
Parameters
nDataType DataType
nUnitType UnitType
rowTypes int
 SetDataType(int, int, DataType, UnitType)
[Obsolete("Use Table.Cells[row,column].DataType instead.")]
public virtual void SetDataType(int row, int col, DataType nDataType, UnitType nUnitType)
Parameters
row int
col int
nDataType DataType
nUnitType UnitType
 SetDataType(int, int, int, DataTypeParameter)
[Obsolete("Use Table.Cells[row,column].Contents[i].DataType instead.")]
public virtual void SetDataType(int row, int column, int contentIndex, DataTypeParameter dataType)
Parameters
row int
column int
contentIndex int
dataType DataTypeParameter
 SetFieldId(int, int, ObjectId)
[Obsolete("Use Table.Cells[row,column].FieldId instead.")]
public virtual void SetFieldId(int row, int col, ObjectId fieldId)
Parameters
row int
col int
fieldId ObjectId
 SetFieldId(int, int, int, ObjectId, CellOption)
[Obsolete("Use Table.Cells[row,column].Contents[i].FieldId instead.")]
public virtual void SetFieldId(int row, int column, int contentIndex, ObjectId fieldId, CellOption option)
Parameters
row int
column int
contentIndex int
fieldId ObjectId
option CellOption
 SetFormat(int, int, string)
[Obsolete("Use Table.Cells[row,column].DataFormat instead.")]
public virtual void SetFormat(int row, int col, string pFormat)
Parameters
row int
col int
pFormat string
 SetFormat(string, int)
[Obsolete("Use Table.Cells[row,column].DataFormat instead.")]
public virtual void SetFormat(string pFormat, int rowTypes)
Parameters
pFormat string
rowTypes int
 SetFormula(int, int, int, string)
[Obsolete("Use Table.Cells[row,column].Contents[i].Formula instead.")]
public virtual void SetFormula(int row, int column, int contentIndex, string formula)
Parameters
row int
column int
contentIndex int
formula string
 SetGridColor(Color, int, int)
[Obsolete("Use Cell functionality instead.")]
public virtual void SetGridColor(Color color, int borders, int rows)
Parameters
color Color
borders int
rows int
 SetGridColor(int, int, GridLineType, Color)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Color instead.")]
public virtual void SetGridColor(int row, int column, GridLineType gridLineType, Color color)
Parameters
row int
column int
gridLineType GridLineType
color Color
 SetGridColor(int, int, short, Color)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Color instead.")]
public virtual void SetGridColor(int row, int col, short edges, Color color)
Parameters
row int
col int
edges short
color Color
 SetGridDoubleLineSpacing(int, int, GridLineType, double)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.DoubleLineSpacing instead.")]
public virtual void SetGridDoubleLineSpacing(int row, int column, GridLineType gridLineType, double spacing)
Parameters
row int
column int
gridLineType GridLineType
spacing double
 SetGridLineStyle(int, int, GridLineType, GridLineStyle)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.LineStyle instead.")]
public virtual void SetGridLineStyle(int row, int column, GridLineType gridLineType, GridLineStyle lineStyle)
Parameters
row int
column int
gridLineType GridLineType
lineStyle GridLineStyle
 SetGridLineWeight(LineWeight, int, int)
[Obsolete("Use Cell functionality instead.")]
public virtual void SetGridLineWeight(LineWeight lineWeight, int borders, int rows)
Parameters
lineWeight LineWeight
borders int
rows int
 SetGridLineWeight(int, int, GridLineType, LineWeight)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.LineWeight instead.")]
public virtual void SetGridLineWeight(int row, int column, GridLineType gridLineType, LineWeight lineWeight)
Parameters
row int
column int
gridLineType GridLineType
lineWeight LineWeight
 SetGridLineWeight(int, int, short, LineWeight)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.LineWeight instead.")]
public virtual void SetGridLineWeight(int row, int col, short edges, LineWeight value)
Parameters
row int
col int
edges short
value LineWeight
 SetGridLinetype(int, int, GridLineType, ObjectId)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Linetype instead.")]
public virtual void SetGridLinetype(int row, int column, GridLineType gridLineType, ObjectId linetype)
Parameters
row int
column int
gridLineType GridLineType
linetype ObjectId
 SetGridProperty(CellRange, GridLineType, GridPropertyParameter)
public virtual void SetGridProperty(CellRange rangeIn, GridLineType gridLineTypes, GridPropertyParameter gridProp)
Parameters
rangeIn CellRange
gridLineTypes GridLineType
gridProp GridPropertyParameter
 SetGridProperty(int, int, GridLineType, GridPropertyParameter)
public virtual void SetGridProperty(int row, int column, GridLineType gridLineType, GridPropertyParameter gridProperty)
Parameters
row int
column int
gridLineType GridLineType
gridProperty GridPropertyParameter
 SetGridVisibility(bool, int, int)
[Obsolete("Use Cell functionality instead.")]
public virtual void SetGridVisibility(bool visible, int borders, int rows)
Parameters
visible bool
borders int
rows int
 SetGridVisibility(int, int, GridLineType, Visibility)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.IsVisible instead.")]
public virtual void SetGridVisibility(int row, int column, GridLineType gridLineType, Visibility visibility)
Parameters
row int
column int
gridLineType GridLineType
visibility Visibility
 SetGridVisibility(int, int, short, bool)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Visibility instead.")]
public virtual void SetGridVisibility(int row, int col, short edges, bool value)
Parameters
row int
col int
edges short
value bool
 SetIsAutoScale(int, int, int, bool)
[Obsolete("Use Table.Cells[row,column].Contents[i].IsAutoScale instead.")]
public virtual void SetIsAutoScale(int row, int column, int contentIndex, bool autoFit)
Parameters
row int
column int
contentIndex int
autoFit bool
 SetMargin(int, int, CellMargins, double)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Margin instead.")]
public virtual void SetMargin(int row, int column, CellMargins margin, double value)
Parameters
row int
column int
margin CellMargins
value double
 SetMergeAllEnabled(int, int, bool)
[Obsolete("Use Table.Cells[row,column].IsMergeAllEnabled instead.")]
public virtual void SetMergeAllEnabled(int row, int column, bool enable)
Parameters
row int
column int
enable bool
 SetOverrides(int, int, GridLineType, CellProperties)
[Obsolete("Use Table.Cells[row,column].{Top,Bottom,Left,Right}Edge.Overrides instead.")]
public virtual void SetOverrides(int row, int column, GridLineType gridLineType, CellProperties @override)
Parameters
row int
column int
gridLineType GridLineType
override CellProperties
 SetOverrides(int, int, int, CellProperties)
[Obsolete("Use Table.Cells[row,column].Contents[i].Overrides instead.")]
public virtual void SetOverrides(int row, int column, int contentIndex, CellProperties @override)
Parameters
row int
column int
contentIndex int
override CellProperties
 SetRotation(int, int, int, double)
[Obsolete("Use Table.Cells[row,column].Contents[i].Rotation instead.")]
public virtual void SetRotation(int row, int column, int contentIndex, double angle)
Parameters
row int
column int
contentIndex int
angle double
 SetRowHeight(double)
public virtual void SetRowHeight(double height)
Parameters
height double
 SetRowHeight(int, double)
[Obsolete("Use Table.Rows[col].Height instead.")]
public virtual void SetRowHeight(int row, double height)
Parameters
row int
height double
 SetScale(int, int, int, double)
[Obsolete("Use Table.Cells[row,column].Contents[i].Scale instead.")]
public virtual void SetScale(int row, int column, int contentIndex, double scale)
Parameters
row int
column int
contentIndex int
scale double
 SetSize(int, int)
public virtual void SetSize(int numRows, int numCols)
Parameters
numRows int
numCols int
 SetTextHeight(double, int)
[Obsolete("Use Cell functionality instead.")]
public virtual void SetTextHeight(double height, int rowTypes)
Parameters
height double
rowTypes int
 SetTextHeight(int, int, double)
[Obsolete("Use Table.Cells[row,column].TextHeight instead.")]
public virtual void SetTextHeight(int row, int col, double height)
Parameters
row int
col int
height double
 SetTextHeight(int, int, int, double)
[Obsolete("Use Table.Cells[row,column].Contents[i].TextHeight instead.")]
public virtual void SetTextHeight(int row, int column, int contentIndex, double height)
Parameters
row int
column int
contentIndex int
height double
 SetTextRotation(int, int, RotationAngle)
[Obsolete("Use Table.Cells[row,column].Contents[i].Rotation instead.")]
public virtual void SetTextRotation(int row, int col, RotationAngle rot)
Parameters
row int
col int
rot RotationAngle
 SetTextString(int, int, int, string)
[Obsolete("Use Table.Cells[row,column].Contents[i].TextString instead.")]
public virtual void SetTextString(int row, int column, int contentIndex, string text)
Parameters
row int
column int
contentIndex int
text string
 SetTextString(int, int, string)
[Obsolete("Use Table.Cells[row,column].TextString instead.")]
public virtual void SetTextString(int row, int col, string value)
Parameters
row int
col int
value string
 SetTextStyle(ObjectId, int)
[Obsolete("Use Cell functionality instead.")]
public virtual void SetTextStyle(ObjectId id, int rowTypes)
Parameters
id ObjectId
rowTypes int
 SetTextStyle(int, int, ObjectId)
[Obsolete("Use Table.Cells[row,column].TextStyleId instead.")]
public virtual void SetTextStyle(int row, int col, ObjectId id)
Parameters
row int
col int
id ObjectId
 SetTextStyleId(int, int, int, ObjectId)
[Obsolete("Use Table.Cells[row,column].Contents[i].TextStyleId instead.")]
public virtual void SetTextStyleId(int row, int column, int contentIndex, ObjectId id)
Parameters
row int
column int
contentIndex int
id ObjectId
 SetToolTip(int, int, string)
[Obsolete("Use Table.Cells[row,column].ToolTip instead.")]
public virtual void SetToolTip(int row, int column, string toolTip)
Parameters
row int
column int
toolTip string
 SetValue(int, int, int, object)
[Obsolete("Use Table.Cells[row,column].Content[i].Value instead.")]
public virtual void SetValue(int row, int column, int contentIndex, object value)
Parameters
row int
column int
contentIndex int
value object
 SetValue(int, int, int, object, ParseOption)
[Obsolete("Use Table.Cells[row,column].Content[i].SetValue instead.")]
public virtual void SetValue(int row, int column, int contentIndex, object value, ParseOption parseOption)
Parameters
row int
column int
contentIndex int
value object
parseOption ParseOption
 SetValue(int, int, int, string, ParseOption)
[Obsolete("Use Table.Cells[row,column].Content[i].SetValue instead.")]
public virtual void SetValue(int row, int column, int contentIndex, string value, ParseOption parseOption)
Parameters
row int
column int
contentIndex int
value string
parseOption ParseOption
 SetValue(int, int, object)
[Obsolete("Use Table.Cells[row,column].Contents(i).Value instead.")]
public virtual void SetValue(int row, int col, object pValue)
Parameters
row int
col int
pValue object
 SetValue(int, int, string, ParseOption)
[Obsolete("Use Table.Cells[row,column].Contents(i).Value instead.")]
public virtual void SetValue(int row, int col, string pText, ParseOption nOption)
Parameters
row int
col int
pText string
nOption ParseOption
 SuppressRegenerateTable(bool)
public virtual void SuppressRegenerateTable(bool suppress)
Parameters
suppress bool
 TableStyleOverrides()
[Obsolete("Use Cell functionality instead.")]
public virtual TableStyleOverride[] TableStyleOverrides()
Returns
TableStyleOverride[]
 TextHeight(RowType)
[Obsolete("Use Cell functionality instead.")]
public virtual double TextHeight(RowType type)
Parameters
type RowType
Returns
double
 TextHeight(int, int)
[Obsolete("Use Table.Cells[row,column].TextHeight instead.")]
public virtual double TextHeight(int row, int col)
Parameters
row int
col int
Returns
double
 TextRotation(int, int)
[Obsolete("Use Table.Cells[row,column].Contents[i].Rotation instead.")]
public virtual RotationAngle TextRotation(int row, int col)
Parameters
row int
col int
Returns
RotationAngle
 TextString(int, int)
[Obsolete("Use Table.Cells[row,column].TextString instead.")]
public virtual string TextString(int row, int col)
Parameters
row int
col int
Returns
string
 TextString(int, int, FormatOption)
[Obsolete("Use Table.Cells[row,column].TextString instead.")]
public virtual string TextString(int row, int col, FormatOption nOption)
Parameters
row int
col int
nOption FormatOption
Returns
string
 TextStringConst(int, int)
[Obsolete("Use Table.Cells[row,column].TextString instead.")]
public virtual string TextStringConst(int row, int col)
Parameters
row int
col int
Returns
string
 TextStyle(RowType)
[Obsolete("Use Cell functionality instead.")]
public virtual ObjectId TextStyle(RowType type)
Parameters
type RowType
Returns
ObjectId
 TextStyle(int, int)
[Obsolete("Use Table.Cells[row,column].TextStyleId instead.")]
public virtual ObjectId TextStyle(int row, int col)
Parameters
row int
col int
Returns
ObjectId
 UnitType(RowType)
[Obsolete("Use Table.Cells[row,column].DataType instead.")]
public virtual UnitType UnitType(RowType type)
Parameters
type RowType
Returns
UnitType
 UnitType(int, int)
[Obsolete("Use Table.Cells[row,column].DataType instead.")]
public virtual UnitType UnitType(int row, int col)
Parameters
row int
col int
Returns
UnitType
 UnmergeCells(CellRange)
public virtual void UnmergeCells(CellRange range)
Parameters
range CellRange
 UpdateDataLink(UpdateDirection, UpdateOption)
public virtual void UpdateDataLink(UpdateDirection dir, UpdateOption option)
Parameters
dir UpdateDirection
option UpdateOption
 UpdateDataLink(int, int, UpdateDirection, UpdateOption)
[Obsolete("Use Table.Cells[row,column].UpdateDataLink instead.")]
public virtual void UpdateDataLink(int row, int column, UpdateDirection dir, UpdateOption option)
Parameters
row int
column int
dir UpdateDirection
option UpdateOption
 Value(int, int)
[Obsolete("Use Table.Cells[row,column].Contents(i).Value instead.")]
public virtual object Value(int row, int col)
Parameters
row int
col int
Returns
object
Explicit Interface Implementations
 IEnumerable.GetEnumerator()
[Obsolete("Use Table.Cells instead.")]
IEnumerator IEnumerable.GetEnumerator()
Returns
IEnumerator