Table of Contents
 Enum DataType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcValue::DataType")]
public enum DataType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Buffer = 128
Date = 8
Double = 2
General = 512
Long = 1
ObjectId = 64
Point = 16
Point3d = 32
Resbuf = 256
String = 4
Unknown = 0