Table of Contents
 Enum PolyMeshType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::PolyMeshType")]
public enum PolyMeshType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BezierSurfaceMesh = 8
CubicSurfaceMesh = 6
QuadSurfaceMesh = 5
SimpleMesh = 0