Table of Contents
 Class ObjectIdCollection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbObjectIdArray")]
public sealed class ObjectIdCollection : DisposableWrapper, IDisposable, IList, ICollection, IEnumerable
Inheritance
object
MarshalByRefObject
DisposableWrapper
ObjectIdCollection
Implements
IDisposable
IList
ICollection
IEnumerable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ObjectIdCollection()
public ObjectIdCollection()
 ObjectIdCollection(ObjectId[])
public ObjectIdCollection(ObjectId[] values)
Parameters
values ObjectId[]
Properties
 Count
public int Count { get; }
Property Value
int
 this[int]
public ObjectId this[int index] { get; set; }
Parameters
index int
Property Value
ObjectId
Methods
 Add(ObjectId)
public int Add(ObjectId value)
Parameters
value ObjectId
Returns
int
 Clear()
public void Clear()
 Contains(ObjectId)
public bool Contains(ObjectId value)
Parameters
value ObjectId
Returns
bool
 CopyTo(ObjectId[], int)
public void CopyTo(ObjectId[] array, int index)
Parameters
array ObjectId[]
index int
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 GetEnumerator()
public IEnumerator GetEnumerator()
Returns
IEnumerator
 IndexOf(ObjectId)
public int IndexOf(ObjectId value)
Parameters
value ObjectId
Returns
int
 Insert(int, ObjectId)
public void Insert(int index, ObjectId value)
Parameters
index int
value ObjectId
 Remove(ObjectId)
public void Remove(ObjectId value)
Parameters
value ObjectId
 RemoveAt(int)
public void RemoveAt(int index)
Parameters
index int