Table of Contents
 Class MlineStyleElementCollection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public sealed class MlineStyleElementCollection : ICollection, IEnumerable
Inheritance
object
MlineStyleElementCollection
Implements
ICollection
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Count
public virtual int Count { get; }
Property Value
int
 this[int]
public MlineStyleElement this[int index] { get; set; }
Parameters
index int
Property Value
MlineStyleElement
Methods
 Add(MlineStyleElement, bool)
public int Add(MlineStyleElement element, bool checkIfReferenced)
Parameters
element MlineStyleElement
checkIfReferenced bool
Returns
int
 CopyTo(MlineStyleElement[], int)
public void CopyTo(MlineStyleElement[] array, int index)
Parameters
array MlineStyleElement[]
index int
 GetEnumerator()
public MlineStyleElementCollectionEnumerator GetEnumerator()
Returns
MlineStyleElementCollectionEnumerator
 RemoveAt(int)
public void RemoveAt(int index)
Parameters
index int