Table of Contents
 Class SplineEntity3d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeSplineEnt3d")]
public abstract class SplineEntity3d : Curve3d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
Curve3d
SplineEntity3d
Implements
IDisposable
ICloneable
Derived
CubicSplineCurve3d
NurbCurve3d
PolylineCurve3d
Inherited Members
 Curve3d.GetInterval()
 Curve3d.SetInterval(Interval)
 Curve3d.GetReverseParameterCurve()
 Curve3d.GetDistanceTo(Curve3d)
 Curve3d.GetDistanceTo(Curve3d, Tolerance)
 Curve3d.GetDistanceTo(Point3d)
 Curve3d.GetDistanceTo(Point3d, Tolerance)
 Curve3d.GetClosestPointTo(Curve3d)
 Curve3d.GetClosestPointTo(Curve3d, Tolerance)
 Curve3d.GetClosestPointTo(Point3d)
 Curve3d.GetClosestPointTo(Point3d, Tolerance)
 Curve3d.GetProjectedClosestPointTo(Curve3d, Vector3d)
 Curve3d.GetProjectedClosestPointTo(Curve3d, Vector3d, Tolerance)
 Curve3d.GetProjectedClosestPointTo(Point3d, Vector3d)
 Curve3d.GetProjectedClosestPointTo(Point3d, Vector3d, Tolerance)
 Curve3d.GetNormalPoint(Point3d)
 Curve3d.GetNormalPoint(Point3d, Tolerance)
 Curve3d.GetBoundBlockOf(Interval)
 Curve3d.GetOrthoBoundBlockOf(Interval)
 Curve3d.GetProjectedEntity(Plane, Vector3d)
 Curve3d.GetProjectedEntity(Plane, Vector3d, Tolerance)
 Curve3d.GetOrthoProjectEntity(Plane)
 Curve3d.GetOrthoProjectEntity(Plane, Tolerance)
 Curve3d.IsOn(double)
 Curve3d.IsOn(double, Tolerance)
 Curve3d.IsOn(Point3d, out double)
 Curve3d.IsOn(Point3d, out double, Tolerance)
 Curve3d.IsOn(Point3d)
 Curve3d.IsOn(Point3d, Tolerance)
 Curve3d.GetParameterOf(Point3d)
 Curve3d.GetParameterOf(Point3d, Tolerance)
 Curve3d.GetTrimmedOffset(double, Vector3d, OffsetCurveExtensionType)
 Curve3d.GetTrimmedOffset(double, Vector3d, OffsetCurveExtensionType, Tolerance)
 Curve3d.IsClosed()
 Curve3d.IsClosed(Tolerance)
 Curve3d.IsPlanar(out Plane)
 Curve3d.IsPlanar(out Plane, Tolerance)
 Curve3d.IsLinear(out Line3d)
 Curve3d.IsLinear(out Line3d, Tolerance)
 Curve3d.IsCoplanarWith(Curve3d, out Plane)
 Curve3d.IsCoplanarWith(Curve3d, out Plane, Tolerance)
 Curve3d.IsPeriodic(out double)
 Curve3d.IsDegenerate(out Entity3d)
 Curve3d.IsDegenerate(out Entity3d, Tolerance)
 Curve3d.GetLength(double, double, double)
 Curve3d.GetParameterAtLength(double, double, bool, double)
 Curve3d.GetArea(double, double)
 Curve3d.GetArea(double, double, Tolerance)
 Curve3d.GetSplitCurves(double)
 Curve3d.Explode(Interval)
 Curve3d.EvaluatePoint(double)
 Curve3d.GetSamplePoints(int)
 Curve3d.GetSamplePoints(double, double, double)
 Curve3d.GetNewSamplePoints(double, double, double)
 Curve3d.HasEndPoint
 Curve3d.HasStartPoint
 Curve3d.OrthoBoundBlock
 Curve3d.BoundBlock
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Degree
public int Degree { get; }
Property Value
int
 EndParameter
public double EndParameter { get; }
Property Value
double
 EndPoint
public Point3d EndPoint { get; }
Property Value
Point3d
 HasFitData
public bool HasFitData { get; }
Property Value
bool
 IsRational
public bool IsRational { get; }
Property Value
bool
 Knots
public KnotCollection Knots { get; }
Property Value
KnotCollection
 NumberOfControlPoints
public int NumberOfControlPoints { get; }
Property Value
int
 NumberOfKnots
public int NumberOfKnots { get; }
Property Value
int
 Order
public int Order { get; }
Property Value
int
 StartParameter
public double StartParameter { get; }
Property Value
double
 StartPoint
public Point3d StartPoint { get; }
Property Value
Point3d
Methods
 ControlPointAt(int)
public Point3d ControlPointAt(int i)
Parameters
i int
Returns
Point3d
 Create(IntPtr, bool)
public static SplineEntity3d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
SplineEntity3d
 GetContinuityAtKnot(int)
public int GetContinuityAtKnot(int i)
Parameters
i int
Returns
int
 GetContinuityAtKnot(int, Tolerance)
public int GetContinuityAtKnot(int i, Tolerance tolerance)
Parameters
i int
tolerance Tolerance
Returns
int
 KnotAt(int)
public double KnotAt(int i)
Parameters
i int
Returns
double
 SetControlPointAt(int, Point3d)
public void SetControlPointAt(int i, Point3d point)
Parameters
i int
point Point3d
 SetKnotAt(int, double)
public void SetKnotAt(int i, double value)
Parameters
i int
value double