Table of Contents
 Class NurbCurve3d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeNurbCurve3d")]
public sealed class NurbCurve3d : SplineEntity3d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
Curve3d
SplineEntity3d
NurbCurve3d
Implements
IDisposable
ICloneable
Inherited Members
 SplineEntity3d.GetContinuityAtKnot(int)
 SplineEntity3d.GetContinuityAtKnot(int, Tolerance)
 SplineEntity3d.KnotAt(int)
 SplineEntity3d.SetKnotAt(int, double)
 SplineEntity3d.ControlPointAt(int)
 SplineEntity3d.SetControlPointAt(int, Point3d)
 SplineEntity3d.HasFitData
 SplineEntity3d.EndPoint
 SplineEntity3d.StartPoint
 SplineEntity3d.EndParameter
 SplineEntity3d.StartParameter
 SplineEntity3d.NumberOfControlPoints
 SplineEntity3d.Knots
 SplineEntity3d.NumberOfKnots
 SplineEntity3d.Order
 SplineEntity3d.Degree
 SplineEntity3d.IsRational
 Curve3d.GetInterval()
 Curve3d.SetInterval(Interval)
 Curve3d.GetReverseParameterCurve()
 Curve3d.GetDistanceTo(Curve3d)
 Curve3d.GetDistanceTo(Curve3d, Tolerance)
 Curve3d.GetDistanceTo(Point3d)
 Curve3d.GetDistanceTo(Point3d, Tolerance)
 Curve3d.GetClosestPointTo(Curve3d)
 Curve3d.GetClosestPointTo(Curve3d, Tolerance)
 Curve3d.GetClosestPointTo(Point3d)
 Curve3d.GetClosestPointTo(Point3d, Tolerance)
 Curve3d.GetProjectedClosestPointTo(Curve3d, Vector3d)
 Curve3d.GetProjectedClosestPointTo(Curve3d, Vector3d, Tolerance)
 Curve3d.GetProjectedClosestPointTo(Point3d, Vector3d)
 Curve3d.GetProjectedClosestPointTo(Point3d, Vector3d, Tolerance)
 Curve3d.GetNormalPoint(Point3d)
 Curve3d.GetNormalPoint(Point3d, Tolerance)
 Curve3d.GetBoundBlockOf(Interval)
 Curve3d.GetOrthoBoundBlockOf(Interval)
 Curve3d.GetProjectedEntity(Plane, Vector3d)
 Curve3d.GetProjectedEntity(Plane, Vector3d, Tolerance)
 Curve3d.GetOrthoProjectEntity(Plane)
 Curve3d.GetOrthoProjectEntity(Plane, Tolerance)
 Curve3d.IsOn(double)
 Curve3d.IsOn(double, Tolerance)
 Curve3d.IsOn(Point3d, out double)
 Curve3d.IsOn(Point3d, out double, Tolerance)
 Curve3d.IsOn(Point3d)
 Curve3d.IsOn(Point3d, Tolerance)
 Curve3d.GetParameterOf(Point3d)
 Curve3d.GetParameterOf(Point3d, Tolerance)
 Curve3d.GetTrimmedOffset(double, Vector3d, OffsetCurveExtensionType)
 Curve3d.GetTrimmedOffset(double, Vector3d, OffsetCurveExtensionType, Tolerance)
 Curve3d.IsClosed()
 Curve3d.IsClosed(Tolerance)
 Curve3d.IsPlanar(out Plane)
 Curve3d.IsPlanar(out Plane, Tolerance)
 Curve3d.IsLinear(out Line3d)
 Curve3d.IsLinear(out Line3d, Tolerance)
 Curve3d.IsCoplanarWith(Curve3d, out Plane)
 Curve3d.IsCoplanarWith(Curve3d, out Plane, Tolerance)
 Curve3d.IsPeriodic(out double)
 Curve3d.IsDegenerate(out Entity3d)
 Curve3d.IsDegenerate(out Entity3d, Tolerance)
 Curve3d.GetLength(double, double, double)
 Curve3d.GetParameterAtLength(double, double, bool, double)
 Curve3d.GetArea(double, double)
 Curve3d.GetArea(double, double, Tolerance)
 Curve3d.GetSplitCurves(double)
 Curve3d.Explode(Interval)
 Curve3d.EvaluatePoint(double)
 Curve3d.GetSamplePoints(int)
 Curve3d.GetSamplePoints(double, double, double)
 Curve3d.GetNewSamplePoints(double, double, double)
 Curve3d.HasEndPoint
 Curve3d.HasStartPoint
 Curve3d.OrthoBoundBlock
 Curve3d.BoundBlock
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 NurbCurve3d()
public NurbCurve3d()
 NurbCurve3d(EllipticalArc3d)
public NurbCurve3d(EllipticalArc3d ellipse)
Parameters
ellipse EllipticalArc3d
 NurbCurve3d(LineSegment3d)
public NurbCurve3d(LineSegment3d lineSegment)
Parameters
lineSegment LineSegment3d
 NurbCurve3d(Point3dCollection)
public NurbCurve3d(Point3dCollection fitPoints)
Parameters
fitPoints Point3dCollection
 NurbCurve3d(Point3dCollection, Tolerance)
public NurbCurve3d(Point3dCollection fitPoints, Tolerance fitTolerance)
Parameters
fitPoints Point3dCollection
fitTolerance Tolerance
 NurbCurve3d(Point3dCollection, Vector3d, Vector3d, bool, bool)
public NurbCurve3d(Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, bool startTangentDefined, bool endTangentDefined)
Parameters
fitPoints Point3dCollection
startTangent Vector3d
endTangent Vector3d
startTangentDefined bool
endTangentDefined bool
 NurbCurve3d(Point3dCollection, Vector3d, Vector3d, bool, bool, KnotParameterizationEnum)
public NurbCurve3d(Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, bool startTangentDefined, bool endTangentDefined, KnotParameterizationEnum knotParam)
Parameters
fitPoints Point3dCollection
startTangent Vector3d
endTangent Vector3d
startTangentDefined bool
endTangentDefined bool
knotParam KnotParameterizationEnum
 NurbCurve3d(Point3dCollection, Vector3d, Vector3d, bool, bool, KnotParameterizationEnum, Tolerance)
public NurbCurve3d(Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, bool startTangentDefined, bool endTangentDefined, KnotParameterizationEnum knotParam, Tolerance fitTolerance)
Parameters
fitPoints Point3dCollection
startTangent Vector3d
endTangent Vector3d
startTangentDefined bool
endTangentDefined bool
knotParam KnotParameterizationEnum
fitTolerance Tolerance
 NurbCurve3d(Point3dCollection, Vector3d, Vector3d, bool, bool, Tolerance)
public NurbCurve3d(Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, bool startTangentDefined, bool endTangentDefined, Tolerance fitTolerance)
Parameters
fitPoints Point3dCollection
startTangent Vector3d
endTangent Vector3d
startTangentDefined bool
endTangentDefined bool
fitTolerance Tolerance
 NurbCurve3d(Point3dCollection, Vector3dCollection, Tolerance, bool)
public NurbCurve3d(Point3dCollection fitPoints, Vector3dCollection fitTangents, Tolerance fitTolerance, bool periodic)
Parameters
fitPoints Point3dCollection
fitTangents Vector3dCollection
fitTolerance Tolerance
periodic bool
 NurbCurve3d(Point3dCollection, Vector3dCollection, bool)
public NurbCurve3d(Point3dCollection fitPoints, Vector3dCollection fitTangents, bool periodic)
Parameters
fitPoints Point3dCollection
fitTangents Vector3dCollection
periodic bool
 NurbCurve3d(int, KnotCollection, Point3dCollection, DoubleCollection, bool)
public NurbCurve3d(int degree, KnotCollection knots, Point3dCollection controlPoints, DoubleCollection weights, bool periodic)
Parameters
degree int
knots KnotCollection
controlPoints Point3dCollection
weights DoubleCollection
periodic bool
 NurbCurve3d(int, KnotCollection, Point3dCollection, bool)
public NurbCurve3d(int degree, KnotCollection knots, Point3dCollection controlPoints, bool periodic)
Parameters
degree int
knots KnotCollection
controlPoints Point3dCollection
periodic bool
 NurbCurve3d(int, PolylineCurve3d, bool)
public NurbCurve3d(int degree, PolylineCurve3d fitPolyline, bool periodic)
Parameters
degree int
fitPolyline PolylineCurve3d
periodic bool
Properties
 DefinitionData
public NurbCurve3dData DefinitionData { get; }
Property Value
NurbCurve3dData
 EvalMode
public bool EvalMode { get; }
Property Value
bool
 FitData
public NurbCurve3dFitData FitData { get; }
Property Value
NurbCurve3dFitData
 FitKnotParameterization
public KnotParameterizationEnum FitKnotParameterization { get; set; }
Property Value
KnotParameterizationEnum
 FitTolerance
public Tolerance FitTolerance { get; set; }
Property Value
Tolerance
 NumFitPoints
public int NumFitPoints { get; }
Property Value
int
 NumWeights
public int NumWeights { get; }
Property Value
int
Methods
 AddControlPointAt(double, Point3d, double)
public void AddControlPointAt(double newKnot, Point3d point, double weight)
Parameters
newKnot double
point Point3d
weight double
 AddFitPointAt(int, Point3d)
public bool AddFitPointAt(int index, Point3d point)
Parameters
index int
point Point3d
Returns
bool
 AddKnot(double)
public void AddKnot(double newKnot)
Parameters
newKnot double
 Create(IntPtr, bool)
public static NurbCurve3d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
NurbCurve3d
 DeleteControlPointAt(int)
public void DeleteControlPointAt(int index)
Parameters
index int
 DeleteFitPointAt(int)
public bool DeleteFitPointAt(int index)
Parameters
index int
Returns
bool
 ElevateDegree(int)
public void ElevateDegree(int plusDegree)
Parameters
plusDegree int
 GetFitPointAt(int)
public Point3d GetFitPointAt(int index)
Parameters
index int
Returns
Point3d
 GetFitTangents()
public Vector3d[] GetFitTangents()
Returns
Vector3d[]
 GetParametersOfC1Discontinuity()
public DoubleCollection GetParametersOfC1Discontinuity()
Returns
DoubleCollection
 GetParametersOfC1Discontinuity(Tolerance)
public DoubleCollection GetParametersOfC1Discontinuity(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
DoubleCollection
 GetParametersOfG1Discontinuity()
public DoubleCollection GetParametersOfG1Discontinuity()
Returns
DoubleCollection
 GetParametersOfG1Discontinuity(Tolerance)
public DoubleCollection GetParametersOfG1Discontinuity(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
DoubleCollection
 GetWeightAt(int)
public double GetWeightAt(int index)
Parameters
index int
Returns
double
 HardTrimByParams(double, double)
public void HardTrimByParams(double newStartParameter, double newEndParameter)
Parameters
newStartParameter double
newEndParameter double
 InsertKnot(double)
public void InsertKnot(double newKnot)
Parameters
newKnot double
 JoinWith(NurbCurve3d)
public void JoinWith(NurbCurve3d curve)
Parameters
curve NurbCurve3d
 MakeClosed()
public void MakeClosed()
 MakeNonPeriodic()
public void MakeNonPeriodic()
 MakeOpen()
public void MakeOpen()
 MakePeriodic()
public void MakePeriodic()
 MakeRational(double)
public void MakeRational(double weight)
Parameters
weight double
 PurgeFitData()
public bool PurgeFitData()
Returns
bool
 SetEvaluateMode(bool)
public void SetEvaluateMode(bool evaluateMode)
Parameters
evaluateMode bool
 SetFitData(KnotCollection, Point3dCollection, Vector3d, Vector3d, Tolerance, bool)
public void SetFitData(KnotCollection fitKnots, Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, Tolerance fitTolerance, bool periodic)
Parameters
fitKnots KnotCollection
fitPoints Point3dCollection
startTangent Vector3d
endTangent Vector3d
fitTolerance Tolerance
periodic bool
 SetFitData(KnotCollection, Point3dCollection, Vector3d, Vector3d, bool)
public void SetFitData(KnotCollection fitKnots, Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, bool periodic)
Parameters
fitKnots KnotCollection
fitPoints Point3dCollection
startTangent Vector3d
endTangent Vector3d
periodic bool
 SetFitData(Point3dCollection, Vector3d, Vector3d)
public void SetFitData(Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent)
Parameters
fitPoints Point3dCollection
startTangent Vector3d
endTangent Vector3d
 SetFitData(Point3dCollection, Vector3d, Vector3d, KnotParameterizationEnum, Tolerance)
public void SetFitData(Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, KnotParameterizationEnum knotParam, Tolerance fitTolerance)
Parameters
fitPoints Point3dCollection
startTangent Vector3d
endTangent Vector3d
knotParam KnotParameterizationEnum
fitTolerance Tolerance
 SetFitData(Point3dCollection, Vector3d, Vector3d, Tolerance)
public void SetFitData(Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, Tolerance fitTolerance)
Parameters
fitPoints Point3dCollection
startTangent Vector3d
endTangent Vector3d
fitTolerance Tolerance
 SetFitData(int, Point3dCollection)
public void SetFitData(int degree, Point3dCollection fitPoints)
Parameters
degree int
fitPoints Point3dCollection
 SetFitData(int, Point3dCollection, Tolerance)
public void SetFitData(int degree, Point3dCollection fitPoints, Tolerance fitTolerance)
Parameters
degree int
fitPoints Point3dCollection
fitTolerance Tolerance
 SetFitPointAt(int, Point3d)
public bool SetFitPointAt(int index, Point3d point)
Parameters
index int
point Point3d
Returns
bool
 SetFitTangents(Vector3d, Vector3d)
public bool SetFitTangents(Vector3d startTangent, Vector3d endTangent)
Parameters
startTangent Vector3d
endTangent Vector3d
Returns
bool
 SetWeightAt(int, double)
public void SetWeightAt(int index, double value)
Parameters
index int
value double