Table of Contents
 Class VisualStyleTraits
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiVisualStyleTraits")]
public abstract class VisualStyleTraits : DrawableTraits, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
SubEntityTraits
DrawableTraits
VisualStyleTraits
Implements
IDisposable
ICloneable
Inherited Members
 DrawableTraits.SetupForEntity(Entity)
 DrawableTraits.AddLight(ObjectId)
 DrawableTraits.SetHighlightProperty(DrawableTraits.HighlightProperty, object)
 DrawableTraits.GetHighlightProperty(DrawableTraits.HighlightProperty)
 DrawableTraits.SetLayerFlags(DrawableTraits.LayerFlags)
 DrawableTraits.SelectionFlags
 DrawableTraits.LinePattern
 SubEntityTraits.SetSelectionMarker(IntPtr)
 SubEntityTraits.Fill
 SubEntityTraits.LineType
 SubEntityTraits.Layer
 SubEntityTraits.Transparency
 SubEntityTraits.TrueColor
 SubEntityTraits.Color
 SubEntityTraits.SelectionOnlyGeometry
 SubEntityTraits.ShadowFlags
 SubEntityTraits.DrawFlags
 SubEntityTraits.VisualStyle
 SubEntityTraits.Sectionable
 SubEntityTraits.Mapper
 SubEntityTraits.Material
 SubEntityTraits.PlotStyleDescriptor
 SubEntityTraits.Thickness
 SubEntityTraits.LineTypeScale
 SubEntityTraits.LineWeight
 SubEntityTraits.FillType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 VisualStyleTraits(IntPtr, bool)
protected VisualStyleTraits(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 AcGiVisualStyle
public abstract VisualStyle AcGiVisualStyle { get; set; }
Property Value
VisualStyle