Table of Contents
 Enum SaveType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::SaveType")]
public enum SaveType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
NoSave = 0
Save12 = 1
Save13 = 2
Save14 = 3
Save2000 = 4
Save2004 = 5
Save2007 = 6
Save2010 = 7