Table of Contents
 Class SkyParameters
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiSkyParameters")]
public sealed class SkyParameters : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
SkyParameters
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 SkyParameters()
public SkyParameters()
 SkyParameters(IntPtr, bool)
protected SkyParameters(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 AerialPerspective
public bool AerialPerspective { get; set; }
Property Value
bool
 DiskIntensity
public double DiskIntensity { get; set; }
Property Value
double
 DiskScale
public double DiskScale { get; set; }
Property Value
double
 GlowIntensity
public double GlowIntensity { get; set; }
Property Value
double
 GroundColor
public Color GroundColor { get; set; }
Property Value
Color
 Haze
public double Haze { get; set; }
Property Value
double
 HorizonBlur
public double HorizonBlur { get; set; }
Property Value
double
 HorizonHeight
public double HorizonHeight { get; set; }
Property Value
double
 Illumination
public bool Illumination { get; set; }
Property Value
bool
 IntensityFactor
public double IntensityFactor { get; set; }
Property Value
double
 NightColor
public Color NightColor { get; set; }
Property Value
Color
 RedBlueShift
public double RedBlueShift { get; set; }
Property Value
double
 Saturation
public double Saturation { get; set; }
Property Value
double
 SolarDiskSamples
public short SolarDiskSamples { get; set; }
Property Value
short
 SunDirection
public Vector3d SunDirection { get; set; }
Property Value
Vector3d
 VisibilityDistance
public double VisibilityDistance { get; set; }
Property Value
double
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
Operators
 operator ==(SkyParameters, SkyParameters)
public static bool operator ==(SkyParameters a, SkyParameters b)
Parameters
a SkyParameters
b SkyParameters
Returns
bool
 operator !=(SkyParameters, SkyParameters)
public static bool operator !=(SkyParameters a, SkyParameters b)
Parameters
a SkyParameters
b SkyParameters
Returns
bool