Table of Contents
 Class MentalRayRenderSettingsTraits
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiMentalRayRenderSettingsTraits")]
public abstract class MentalRayRenderSettingsTraits : RenderSettingsTraits, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
SubEntityTraits
DrawableTraits
NonEntityTraits
RenderSettingsTraits
MentalRayRenderSettingsTraits
Implements
IDisposable
ICloneable
Inherited Members
 RenderSettingsTraits.ShadowsEnabled
 RenderSettingsTraits.BackFacesEnabled
 RenderSettingsTraits.TextureSampling
 RenderSettingsTraits.MaterialEnabled
 NonEntityTraits.SetupForEntity(Entity)
 NonEntityTraits.SetSelectionMarker(IntPtr)
 NonEntityTraits.AddLight(ObjectId)
 NonEntityTraits.SetLayerFlags(DrawableTraits.LayerFlags)
 NonEntityTraits.SetHighlightProperty(DrawableTraits.HighlightProperty, object)
 NonEntityTraits.GetHighlightProperty(DrawableTraits.HighlightProperty)
 NonEntityTraits.SelectionFlags
 NonEntityTraits.LinePattern
 NonEntityTraits.Fill
 NonEntityTraits.SelectionOnlyGeometry
 NonEntityTraits.ShadowFlags
 NonEntityTraits.DrawFlags
 NonEntityTraits.VisualStyle
 NonEntityTraits.Sectionable
 NonEntityTraits.Mapper
 NonEntityTraits.Material
 NonEntityTraits.PlotStyleDescriptor
 NonEntityTraits.Thickness
 NonEntityTraits.LineTypeScale
 NonEntityTraits.LineWeight
 NonEntityTraits.FillType
 NonEntityTraits.LineType
 NonEntityTraits.Layer
 NonEntityTraits.Transparency
 NonEntityTraits.TrueColor
 NonEntityTraits.Color
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 MentalRayRenderSettingsTraits()
protected MentalRayRenderSettingsTraits()
 MentalRayRenderSettingsTraits(IntPtr, bool)
protected MentalRayRenderSettingsTraits(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 DiagnosticBSPMode
public abstract DiagnosticBSPMode DiagnosticBSPMode { get; set; }
Property Value
DiagnosticBSPMode
 DiagnosticBackgroundEnabled
public override abstract bool DiagnosticBackgroundEnabled { get; set; }
Property Value
bool
 DiagnosticGridMode
public abstract MentalRayRenderSettingsTraitsDiagnosticGridModeParameter DiagnosticGridMode { get; set; }
Property Value
MentalRayRenderSettingsTraitsDiagnosticGridModeParameter
 DiagnosticMode
public abstract DiagnosticMode DiagnosticMode { get; set; }
Property Value
DiagnosticMode
 DiagnosticPhotonMode
public abstract DiagnosticPhotonMode DiagnosticPhotonMode { get; set; }
Property Value
DiagnosticPhotonMode
 EnergyMultiplier
public abstract float EnergyMultiplier { get; set; }
Property Value
float
 ExportMIEnabled
public abstract bool ExportMIEnabled { get; set; }
Property Value
bool
 ExportMIFileName
public abstract string ExportMIFileName { get; set; }
Property Value
string
 ExposureType
public abstract ExposureType ExposureType { get; set; }
Property Value
ExposureType
 FGRayCount
public abstract int FGRayCount { get; set; }
Property Value
int
 FGSampleRadius
public abstract MentalRayRenderSettingsTraitsDoubleRangeParameter FGSampleRadius { get; set; }
Property Value
MentalRayRenderSettingsTraitsDoubleRangeParameter
 FGSampleRadiusState
public abstract MentalRayRenderSettingsTraitsBoolParameter FGSampleRadiusState { get; set; }
Property Value
MentalRayRenderSettingsTraitsBoolParameter
 FinalGatheringEnabled
public abstract bool FinalGatheringEnabled { get; set; }
Property Value
bool
 FinalGatheringMode
public abstract FinalGatheringMode FinalGatheringMode { get; set; }
Property Value
FinalGatheringMode
 GIPhotonsPerLight
public abstract int GIPhotonsPerLight { get; set; }
Property Value
int
 GISampleCount
public abstract int GISampleCount { get; set; }
Property Value
int
 GISampleRadius
public abstract double GISampleRadius { get; set; }
Property Value
double
 GISampleRadiusEnabled
public abstract bool GISampleRadiusEnabled { get; set; }
Property Value
bool
 GlobalIlluminationEnabled
public abstract bool GlobalIlluminationEnabled { get; set; }
Property Value
bool
 LightLuminanceScale
public abstract double LightLuminanceScale { get; set; }
Property Value
double
 MemoryLimit
public abstract int MemoryLimit { get; set; }
Property Value
int
 ModelScaleFactor
public override abstract double ModelScaleFactor { get; set; }
Property Value
double
 MrExportMIMode
public abstract MrExportMIMode MrExportMIMode { get; set; }
Property Value
MrExportMIMode
 PhotonTraceDepth
public abstract MentalRayRenderSettingsTraitsTraceParameter PhotonTraceDepth { get; set; }
Property Value
MentalRayRenderSettingsTraitsTraceParameter
 ProgressMonitor
public abstract IntPtr ProgressMonitor { get; set; }
Property Value
IntPtr
 RayTraceDepth
public abstract MentalRayRenderSettingsTraitsTraceParameter RayTraceDepth { get; set; }
Property Value
MentalRayRenderSettingsTraitsTraceParameter
 RayTraceEnabled
public abstract bool RayTraceEnabled { get; set; }
Property Value
bool
 Sampling
public abstract MentalRayRenderSettingsTraitsIntegerRangeParameter Sampling { get; set; }
Property Value
MentalRayRenderSettingsTraitsIntegerRangeParameter
 SamplingContrastColor
public abstract MentalRayRenderSettingsTraitsFloatParameter SamplingContrastColor { get; set; }
Property Value
MentalRayRenderSettingsTraitsFloatParameter
 SamplingFilter
public abstract MentalRayRenderSettingsTraitsSamplingParameter SamplingFilter { get; set; }
Property Value
MentalRayRenderSettingsTraitsSamplingParameter
 ShadowMapEnabled
public abstract bool ShadowMapEnabled { get; set; }
Property Value
bool
 ShadowMode
public abstract ShadowMode ShadowMode { get; set; }
Property Value
ShadowMode
 ShadowSamplingMultiplier
public abstract double ShadowSamplingMultiplier { get; set; }
Property Value
double
 TileOrder
public abstract TileOrder TileOrder { get; set; }
Property Value
TileOrder
 TileSize
public abstract int TileSize { get; set; }
Property Value
int