Table of Contents
 Enum CellOption
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[TypeConverter(typeof(EnumConverter))]
[Wrapper("AcDb::CellOption")]
public enum CellOption
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
InheritCellFormat = 1
None = 0