Table of Contents
 Enum ApplicationLoadReasons
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcadApp::LoadReasons")]
[Flags]
public enum ApplicationLoadReasons
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
LoadDisabled = 16
OnAutoCADStartup = 2
OnCommandInvocation = 4
OnLoadRequest = 8
OnProxyDetection = 1
TransparentlyLoadable = 32