Table of Contents
 Class Mapper
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiMapper")]
public sealed class Mapper : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Mapper
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Mapper()
public Mapper()
 Mapper(Projection, Tiling, Tiling, AutoTransform, Matrix3d)
public Mapper(Projection projection, Tiling uTiling, Tiling vTiling, AutoTransform autoTransform, Matrix3d transform)
Parameters
projection Projection
uTiling Tiling
vTiling Tiling
autoTransform AutoTransform
transform Matrix3d
Properties
 AutoTransform
public AutoTransform AutoTransform { get; }
Property Value
AutoTransform
 Projection
public Projection Projection { get; }
Property Value
Projection
 Transform
public Matrix3d Transform { get; }
Property Value
Matrix3d
 UTiling
public Tiling UTiling { get; set; }
Property Value
Tiling
 VTiling
public Tiling VTiling { get; set; }
Property Value
Tiling
Methods
 Equals(object)
public override sealed bool Equals(object other)
Parameters
other object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int