Table of Contents
 Struct PatternDefinition
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct PatternDefinition
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 PatternDefinition(double, Point2d, Point2d, DoubleCollection)
public PatternDefinition(double patternAngle, Point2d basePoint, Point2d offsetVector, DoubleCollection dashOffsets)
Parameters
patternAngle double
basePoint Point2d
offsetVector Point2d
dashOffsets DoubleCollection
Properties
 Angle
[UnitType(UnitType.Angle)]
public double Angle { get; }
Property Value
double
 BaseX
[UnitType(UnitType.Distance)]
public double BaseX { get; }
Property Value
double
 BaseY
[UnitType(UnitType.Distance)]
public double BaseY { get; }
Property Value
double
 OffsetX
[UnitType(UnitType.Distance)]
public double OffsetX { get; }
Property Value
double
 OffsetY
[UnitType(UnitType.Distance)]
public double OffsetY { get; }
Property Value
double
Methods
 GetDashes()
public DoubleCollection GetDashes()
Returns
DoubleCollection