Table of Contents
 Enum DrawableType
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiDrawable::DrawableType")]
public enum DrawableType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AmbientLight = 4
DistantLight = 1
Geometry = 0
GradientBackground = 6
GroundPlaneBackground = 8
ImageBackground = 7
ImageBasedLightingBackground = 12
PointLight = 2
SkyBackground = 11
SolidBackground = 5
SpotLight = 3
Viewport = 9
WebLight = 10