Table of Contents
 Enum NewLayerNotification
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcDb::NewLayerNotification")]
public enum NewLayerNotification
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
NoNewLayerNotification = 0
NotifyOnInsert = 32
NotifyOnLayerStateRestore = 8
NotifyOnOpen = 2
NotifyOnPlot = 1
NotifyOnSave = 16
NotifyOnXrefAttachAndReload = 4