Table of Contents
 Class SubDMesh
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbSubDMesh")]
public class SubDMesh : Entity, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
Entity
SubDMesh
Implements
IDisposable
ICloneable
Inherited Members
 Entity.SetLayerId(ObjectId, bool)
 Entity.SetPropertiesFrom(Entity)
 Entity.GetPlane()
 Entity.AddSubentityPaths(FullSubentityPath[])
 Entity.DeleteSubentityPaths(FullSubentityPath[])
 Entity.TransformSubentityPathsBy(FullSubentityPath[], Matrix3d)
 Entity.GetGripPointsAtSubentityPath(FullSubentityPath, GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.MoveGripPointsAtSubentityPaths(FullSubentityPath[], IntPtr[], Vector3d, MoveGripPointsFlags)
 Entity.GetSubentityGeometricExtents(FullSubentityPath)
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, IntPtr, Point3d, Matrix3d, ObjectId[])
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, long, Point3d, Matrix3d, int, ObjectId[])
 Entity.GetGraphicsMarkersAtSubentityPathIntPtr(FullSubentityPath)
 Entity.Highlight(FullSubentityPath, bool)
 Entity.Highlight()
 Entity.Unhighlight(FullSubentityPath, bool)
 Entity.Unhighlight()
 Entity.PushHighlight(FullSubentityPath, HighlightStyle)
 Entity.PopHighlight(FullSubentityPath)
 Entity.HighlightState(FullSubentityPath)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection, Matrix3d)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection)
 Entity.IsContentSnappable()
 Entity.GetGripPoints(GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.GetGripPoints(Point3dCollection, IntegerCollection, IntegerCollection)
 Entity.MoveGripPointsAt(GripDataCollection, Vector3d, MoveGripPointsFlags)
 Entity.MoveGripPointsAt(IntegerCollection, Vector3d)
 Entity.GetStretchPoints(Point3dCollection)
 Entity.MoveStretchPointsAt(IntegerCollection, Vector3d)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.List()
 Entity.TransformBy(Matrix3d)
 Entity.GetTransformedCopy(Matrix3d)
 Entity.GetSubentity(FullSubentityPath)
 Entity.Explode(DBObjectCollection)
 Entity.RecordGraphicsModified(bool)
 Entity.Draw()
 Entity.SaveAs(WorldDraw, SaveType)
 Entity.SetDatabaseDefaults(Database)
 Entity.SetDatabaseDefaults()
 Entity.SetGripStatus(GripStatus)
 Entity.SetSubentityGripStatus(GripStatus, FullSubentityPath)
 Entity.JoinEntity(Entity)
 Entity.JoinEntities(Entity[])
 Entity.EdgeStyleId
 Entity.FaceStyleId
 Entity.VisualStyleId
 Entity.ForceAnnoAllVisible
 Entity.BlockName
 Entity.MaterialMapper
 Entity.MaterialId
 Entity.Material
 Entity.ReceiveShadows
 Entity.CastShadows
 Entity.Hyperlinks
 Entity.CloneMeForDragging
 Entity.CompoundObjectTransform
 Entity.GeometricExtents
 Entity.Ecs
 Entity.IsPlanar
 Entity.CollisionType
 Entity.LineWeight
 Entity.Visible
 Entity.LinetypeScale
 Entity.LinetypeId
 Entity.Linetype
 Entity.LayerId
 Entity.Layer
 Entity.PlotStyleNameId
 Entity.PlotStyleName
 Entity.Transparency
 Entity.EntityColor
 Entity.ColorIndex
 Entity.Color
 Entity.BlockId
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 SubDMesh()
public SubDMesh()
 SubDMesh(IntPtr, bool)
protected SubDMesh(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 EdgeArray
public Int32Collection EdgeArray { get; }
Property Value
Int32Collection
 FaceArray
public Int32Collection FaceArray { get; }
Property Value
Int32Collection
 NormalArray
public Vector3dCollection NormalArray { get; }
Property Value
Vector3dCollection
 NumberOfEdges
public int NumberOfEdges { get; }
Property Value
int
 NumberOfFaces
public int NumberOfFaces { get; }
Property Value
int
 NumberOfSubDividedFaces
public int NumberOfSubDividedFaces { get; }
Property Value
int
 NumberOfSubDividedVertices
public int NumberOfSubDividedVertices { get; }
Property Value
int
 NumberOfVertices
public int NumberOfVertices { get; }
Property Value
int
 SmoothLevel
public int SmoothLevel { get; }
Property Value
int
 SubDividedFaceArray
public Int32Collection SubDividedFaceArray { get; }
Property Value
Int32Collection
 SubDividedNormalArray
public Vector3dCollection SubDividedNormalArray { get; }
Property Value
Vector3dCollection
 SubDividedVertices
public Point3dCollection SubDividedVertices { get; }
Property Value
Point3dCollection
 VertexColorArray
public EntityColor[] VertexColorArray { get; set; }
Property Value
EntityColor[]
 VertexNormalArray
public Vector3dCollection VertexNormalArray { get; set; }
Property Value
Vector3dCollection
 VertexTextureArray
public Point3dCollection VertexTextureArray { get; set; }
Property Value
Point3dCollection
 Vertices
public Point3dCollection Vertices { get; }
Property Value
Point3dCollection
 Watertight
public bool Watertight { get; }
Property Value
bool
Methods
 Cap(FullSubentityPath[])
public void Cap(FullSubentityPath[] edges)
Parameters
edges FullSubentityPath[]
 Collapse(SubentityId)
public void Collapse(SubentityId subentityId)
Parameters
subentityId SubentityId
 ComputeSurfaceArea()
public double ComputeSurfaceArea()
Returns
double
 ComputeVolume()
public double ComputeVolume()
Returns
double
 ConvertToSolid(bool, bool)
public Solid3d ConvertToSolid(bool convertAsSmooth, bool optimize)
Parameters
convertAsSmooth bool
optimize bool
Returns
Solid3d
 ConvertToSurface(bool, SubentityId)
public Surface ConvertToSurface(bool convertAsSmooth, SubentityId subentId)
Parameters
convertAsSmooth bool
subentId SubentityId
Returns
Surface
 ConvertToSurface(bool, bool)
public Surface ConvertToSurface(bool convertAsSmooth, bool optimize)
Parameters
convertAsSmooth bool
optimize bool
Returns
Surface
 ExtrudeConnectedFaces(FullSubentityPath[], Point3dCollection, double)
public void ExtrudeConnectedFaces(FullSubentityPath[] paths, Point3dCollection alongPath, double taper)
Parameters
paths FullSubentityPath[]
alongPath Point3dCollection
taper double
 ExtrudeConnectedFaces(FullSubentityPath[], double, Vector3d, double)
public void ExtrudeConnectedFaces(FullSubentityPath[] paths, double length, Vector3d dir, double taper)
Parameters
paths FullSubentityPath[]
length double
dir Vector3d
taper double
 ExtrudeFaces(FullSubentityPath[], Point3dCollection, double)
public void ExtrudeFaces(FullSubentityPath[] paths, Point3dCollection alongPath, double taper)
Parameters
paths FullSubentityPath[]
alongPath Point3dCollection
taper double
 ExtrudeFaces(FullSubentityPath[], double, Vector3d, double)
public void ExtrudeFaces(FullSubentityPath[] paths, double length, Vector3d dir, double taper)
Parameters
paths FullSubentityPath[]
length double
dir Vector3d
taper double
 GetAdjacentSubentPath(FullSubentityPath, SubentityType)
public FullSubentityPath[] GetAdjacentSubentPath(FullSubentityPath path, SubentityType type)
Parameters
path FullSubentityPath
type SubentityType
Returns
FullSubentityPath[]
 GetCrease(FullSubentityPath[])
public DoubleCollection GetCrease(FullSubentityPath[] subentPaths)
Parameters
subentPaths FullSubentityPath[]
Returns
DoubleCollection
 GetCrease(SubentityId)
public double GetCrease(SubentityId id)
Parameters
id SubentityId
Returns
double
 GetFacePlane(SubentityId)
public Plane GetFacePlane(SubentityId subentId)
Parameters
subentId SubentityId
Returns
Plane
 GetNumberOfSubDividedFacesAt(FullSubentityPath[])
public int GetNumberOfSubDividedFacesAt(FullSubentityPath[] paths)
Parameters
paths FullSubentityPath[]
Returns
int
 GetObjectMesh(DBObject, MeshFaceterData)
public static MeshDataCollection GetObjectMesh(DBObject dbObj, MeshFaceterData faceterData)
Parameters
dbObj DBObject
faceterData MeshFaceterData
Returns
MeshDataCollection
 GetSubDividedVertexAt(SubentityId)
public Point3d GetSubDividedVertexAt(SubentityId subentId)
Parameters
subentId SubentityId
Returns
Point3d
 GetSubDividedVertexAt(int)
public Point3d GetSubDividedVertexAt(int index)
Parameters
index int
Returns
Point3d
 GetSubentColor(SubentityId)
public Color GetSubentColor(SubentityId subentId)
Parameters
subentId SubentityId
Returns
Color
 GetSubentMaterial(SubentityId)
public ObjectId GetSubentMaterial(SubentityId subentId)
Parameters
subentId SubentityId
Returns
ObjectId
 GetSubentMaterialMapper(SubentityId)
public Mapper GetSubentMaterialMapper(SubentityId subentId)
Parameters
subentId SubentityId
Returns
Mapper
 GetSubentPath(int, SubentityType)
public FullSubentityPath[] GetSubentPath(int index, SubentityType type)
Parameters
index int
type SubentityType
Returns
FullSubentityPath[]
 GetVertexAt(SubentityId)
public Point3d GetVertexAt(SubentityId subentId)
Parameters
subentId SubentityId
Returns
Point3d
 GetVertexAt(int)
public Point3d GetVertexAt(int index)
Parameters
index int
Returns
Point3d
 MergeFaces(FullSubentityPath[])
public void MergeFaces(FullSubentityPath[] faces)
Parameters
faces FullSubentityPath[]
 SetCone(double, double, double, int, int, int, double, int)
public void SetCone(double majorRadius, double minorRadius, double height, int divAxis, int divHeight, int divCap, double radiusRatio, int smoothLevel)
Parameters
majorRadius double
minorRadius double
height double
divAxis int
divHeight int
divCap int
radiusRatio double
smoothLevel int
 SetCrease(FullSubentityPath[], double)
public void SetCrease(FullSubentityPath[] subentPaths, double creaseVal)
Parameters
subentPaths FullSubentityPath[]
creaseVal double
 SetCrease(double)
public void SetCrease(double creaseVal)
Parameters
creaseVal double
 SetCylinder(double, double, double, int, int, int, int)
public void SetCylinder(double majorRadius, double minorRadius, double height, int divAxis, int divHeight, int divCap, int smoothLevel)
Parameters
majorRadius double
minorRadius double
height double
divAxis int
divHeight int
divCap int
smoothLevel int
 SetDragStatus(DragStatus)
public override void SetDragStatus(DragStatus status)
Parameters
status DragStatus
 SetPyramid(double, double, int, int, int, int, double, int)
public void SetPyramid(double radius, double height, int divLength, int divHeight, int divCap, int nSides, double radiusRatio, int smoothLevel)
Parameters
radius double
height double
divLength int
divHeight int
divCap int
nSides int
radiusRatio double
smoothLevel int
 SetSphere(double, int, int, int)
public void SetSphere(double radius, int divAxis, int divHeight, int smoothLevel)
Parameters
radius double
divAxis int
divHeight int
smoothLevel int
 SetSubDMesh(Point3dCollection, Int32Collection, int)
public void SetSubDMesh(Point3dCollection vertexArray, Int32Collection indexArray, int smoothLevel)
Parameters
vertexArray Point3dCollection
indexArray Int32Collection
smoothLevel int
 SetSubentColor(SubentityId, Color)
public void SetSubentColor(SubentityId subentId, Color color)
Parameters
subentId SubentityId
color Color
 SetSubentMaterial(SubentityId, ObjectId)
public void SetSubentMaterial(SubentityId subentId, ObjectId matId)
Parameters
subentId SubentityId
matId ObjectId
 SetSubentMaterialMapper(SubentityId, Mapper)
public void SetSubentMaterialMapper(SubentityId subentId, Mapper mapper)
Parameters
subentId SubentityId
mapper Mapper
 SetTorus(double, int, int, double, double, int)
public void SetTorus(double majorRadius, int divSection, int divSweepPath, double sectionRadiusRatio, double sectionRotate, int smoothLevel)
Parameters
majorRadius double
divSection int
divSweepPath int
sectionRadiusRatio double
sectionRotate double
smoothLevel int
 SetVertexAt(SubentityId, Point3d)
public void SetVertexAt(SubentityId subentId, Point3d position)
Parameters
subentId SubentityId
position Point3d
 SetVertexAt(int, Point3d)
public void SetVertexAt(int index, Point3d position)
Parameters
index int
position Point3d
 SetWedge(double, double, double, int, int, int, int, int, int)
public void SetWedge(double xLen, double yLen, double zLen, int divLength, int divWidth, int divHeight, int divSlope, int divCap, int smoothLevel)
Parameters
xLen double
yLen double
zLen double
divLength int
divWidth int
divHeight int
divSlope int
divCap int
smoothLevel int
 Setbox(double, double, double, int, int, int, int)
public void Setbox(double xlen, double ylen, double zlen, int divx, int divy, int divz, int smoothLevel)
Parameters
xlen double
ylen double
zlen double
divx int
divy int
divz int
smoothLevel int
 Spin(SubentityId)
public void Spin(SubentityId subentFaceId)
Parameters
subentFaceId SubentityId
 SplitFace(SubentityId, SubentityId, Point3d, SubentityId, Point3d)
public void SplitFace(SubentityId subentFaceId, SubentityId subent0, Point3d point0, SubentityId subent1, Point3d point1)
Parameters
subentFaceId SubentityId
subent0 SubentityId
point0 Point3d
subent1 SubentityId
point1 Point3d
 SubdDivideDown()
public void SubdDivideDown()
 SubdDivideUp()
public void SubdDivideUp()
 SubdRefine()
public void SubdRefine()
 SubdRefine(FullSubentityPath[])
public void SubdRefine(FullSubentityPath[] paths)
Parameters
paths FullSubentityPath[]