Table of Contents
 Class BlockPropertiesTableRowCollection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class BlockPropertiesTableRowCollection : ICollection, IEnumerable
Inheritance
object
BlockPropertiesTableRowCollection
Implements
ICollection
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Count
public virtual int Count { get; }
Property Value
int
 IsSynchronized
public virtual bool IsSynchronized { get; }
Property Value
bool
 this[int]
public BlockPropertiesTableRow this[int index] { get; }
Parameters
index int
Property Value
BlockPropertiesTableRow
 SyncRoot
public virtual object SyncRoot { get; }
Property Value
object
Methods
 AddAt(int)
public void AddAt(int index)
Parameters
index int
 AddItem()
public void AddItem()
 Clear()
public void Clear()
 CopyTo(Array, int)
public virtual void CopyTo(Array array, int index)
Parameters
array Array
index int
 GetEnumerator()
public virtual IEnumerator GetEnumerator()
Returns
IEnumerator
 GetIndex(BlockPropertiesTableRow)
public int GetIndex(BlockPropertiesTableRow row)
Parameters
row BlockPropertiesTableRow
Returns
int
 Move(BlockPropertiesTableRow, int)
public void Move(BlockPropertiesTableRow row, int newIndex)
Parameters
row BlockPropertiesTableRow
newIndex int
 Move(int, int)
public void Move(int index, int newIndex)
Parameters
index int
newIndex int
 Remove(BlockPropertiesTableRow)
public void Remove(BlockPropertiesTableRow row)
Parameters
row BlockPropertiesTableRow
 Remove(int)
public void Remove(int index)
Parameters
index int
 Sort(BlockPropertiesTableColumn, bool)
public void Sort(BlockPropertiesTableColumn column, bool ascending)
Parameters
column BlockPropertiesTableColumn
ascending bool