Table of Contents
 Struct SurfaceSurfaceIntersectorConfigurations
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public struct SurfaceSurfaceIntersectorConfigurations
Inherited Members
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Properties
 Dimension
public int Dimension { get; }
Property Value
int
 IntersectionType
public SurfaceSurfaceIntersectorType IntersectionType { get; }
Property Value
SurfaceSurfaceIntersectorType
 Surface1Left
public SurfaceSurfaceIntersectorConfiguration Surface1Left { get; }
Property Value
SurfaceSurfaceIntersectorConfiguration
 Surface1Right
public SurfaceSurfaceIntersectorConfiguration Surface1Right { get; }
Property Value
SurfaceSurfaceIntersectorConfiguration
 Surface2Left
public SurfaceSurfaceIntersectorConfiguration Surface2Left { get; }
Property Value
SurfaceSurfaceIntersectorConfiguration
 Surface2Right
public SurfaceSurfaceIntersectorConfiguration Surface2Right { get; }
Property Value
SurfaceSurfaceIntersectorConfiguration
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 IsEqualTo(SurfaceSurfaceIntersectorConfigurations)
public bool IsEqualTo(SurfaceSurfaceIntersectorConfigurations a)
Parameters
a SurfaceSurfaceIntersectorConfigurations
Returns
bool
Operators
 operator ==(SurfaceSurfaceIntersectorConfigurations, SurfaceSurfaceIntersectorConfigurations)
public static bool operator ==(SurfaceSurfaceIntersectorConfigurations a, SurfaceSurfaceIntersectorConfigurations b)
Parameters
a SurfaceSurfaceIntersectorConfigurations
b SurfaceSurfaceIntersectorConfigurations
Returns
bool
 operator !=(SurfaceSurfaceIntersectorConfigurations, SurfaceSurfaceIntersectorConfigurations)
public static bool operator !=(SurfaceSurfaceIntersectorConfigurations a, SurfaceSurfaceIntersectorConfigurations b)
Parameters
a SurfaceSurfaceIntersectorConfigurations
b SurfaceSurfaceIntersectorConfigurations
Returns
bool