Table of Contents
 Enum RowType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::RowType")]
public enum RowType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
DataRow = 1
HeaderRow = 4
TitleRow = 2
UnknownRow = 0