Table of Contents
 Class UnderlayItemCollection
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public sealed class UnderlayItemCollection : ICollection, IEnumerable
Inheritance
object
UnderlayItemCollection
Implements
ICollection
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Count
public int Count { get; }
Property Value
int
 this[int]
public UnderlayItem this[int index] { get; }
Parameters
index int
Property Value
UnderlayItem
Methods
 CopyTo(UnderlayItem[], int)
public void CopyTo(UnderlayItem[] array, int index)
Parameters
array UnderlayItem[]
index int
Explicit Interface Implementations
 GetEnumerator()
IEnumerator GetEnumerator()
Returns
IEnumerator