Table of Contents
 Class AbstractViewTableRecord
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAbstractViewTableRecord")]
public abstract class AbstractViewTableRecord : SymbolTableRecord, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
SymbolTableRecord
AbstractViewTableRecord
Implements
IDisposable
ICloneable
Derived
ViewTableRecord
ViewportTableRecord
Inherited Members
 SymbolTableRecord.IsResolved
 SymbolTableRecord.IsDependent
 SymbolTableRecord.Name
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AbstractViewTableRecord(IntPtr, bool)
protected AbstractViewTableRecord(IntPtr obj, bool autoDelete)
Parameters
obj IntPtr
autoDelete bool
Properties
 AmbientLightColor
public Color AmbientLightColor { get; set; }
Property Value
Color
 BackClipDistance
[UnitType(UnitType.Distance)]
public double BackClipDistance { get; set; }
Property Value
double
 BackClipEnabled
public bool BackClipEnabled { get; set; }
Property Value
bool
 Background
public ObjectId Background { get; set; }
Property Value
ObjectId
 Brightness
[UnitType(UnitType.Unitless)]
public double Brightness { get; set; }
Property Value
double
 CenterPoint
public Point2d CenterPoint { get; set; }
Property Value
Point2d
 Contrast
[UnitType(UnitType.Unitless)]
public double Contrast { get; set; }
Property Value
double
 DefaultLightingOn
public bool DefaultLightingOn { get; set; }
Property Value
bool
 DefaultLightingType
public DefaultLightingType DefaultLightingType { get; set; }
Property Value
DefaultLightingType
 Elevation
[UnitType(UnitType.Distance)]
public double Elevation { get; set; }
Property Value
double
 FrontClipAtEye
public bool FrontClipAtEye { get; set; }
Property Value
bool
 FrontClipDistance
[UnitType(UnitType.Distance)]
public double FrontClipDistance { get; set; }
Property Value
double
 FrontClipEnabled
public bool FrontClipEnabled { get; set; }
Property Value
bool
 Height
[UnitType(UnitType.Distance)]
public double Height { get; set; }
Property Value
double
 LensLength
[UnitType(UnitType.Distance)]
public double LensLength { get; set; }
Property Value
double
 PerspectiveEnabled
public bool PerspectiveEnabled { get; set; }
Property Value
bool
 SunId
public ObjectId SunId { get; }
Property Value
ObjectId
 Target
public Point3d Target { get; set; }
Property Value
Point3d
 ToneOperatorParameters
public ToneOperatorParameters ToneOperatorParameters { get; set; }
Property Value
ToneOperatorParameters
 Ucs
public CoordinateSystem3d Ucs { get; }
Property Value
CoordinateSystem3d
 UcsName
public ObjectId UcsName { get; }
Property Value
ObjectId
 UcsOrthographic
public OrthographicView UcsOrthographic { get; }
Property Value
OrthographicView
 ViewDirection
public Vector3d ViewDirection { get; set; }
Property Value
Vector3d
 ViewOrthographic
public OrthographicView ViewOrthographic { get; }
Property Value
OrthographicView
 ViewTwist
[UnitType(UnitType.Angle)]
public double ViewTwist { get; set; }
Property Value
double
 VisualStyleId
public ObjectId VisualStyleId { get; set; }
Property Value
ObjectId
 Width
[UnitType(UnitType.Distance)]
public double Width { get; set; }
Property Value
double
Methods
 SetSun(DBObject)
public ObjectId SetSun(DBObject sun)
Parameters
sun DBObject
Returns
ObjectId
 SetUcs(ObjectId)
public void SetUcs(ObjectId id)
Parameters
id ObjectId
 SetUcs(OrthographicView)
public void SetUcs(OrthographicView view)
Parameters
view OrthographicView
 SetUcs(Point3d, Vector3d, Vector3d)
public void SetUcs(Point3d origin, Vector3d x, Vector3d y)
Parameters
origin Point3d
x Vector3d
y Vector3d
 SetUcsToWorld()
public void SetUcsToWorld()
 SetViewDirection(OrthographicView)
public void SetViewDirection(OrthographicView view)
Parameters
view OrthographicView