Table of Contents
 Class VariableChangingEventArgs
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public sealed class VariableChangingEventArgs : EventArgs, IDisposable
Inheritance
object
EventArgs
VariableChangingEventArgs
Implements
IDisposable
Inherited Members
 EventArgs.Empty
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 IsResetting
public bool IsResetting { get; }
Property Value
bool
 NewValue
public object NewValue { get; set; }
Property Value
object
 OldValue
public object OldValue { get; }
Property Value
object
Methods
 Dispose()
public override sealed void Dispose()
 Dispose(bool)
protected void Dispose(bool A_0)
Parameters
A_0 bool
 Veto(string)
public void Veto(string reason)
Parameters
reason string