Table of Contents
 Class FormattedTableData
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbFormattedTableData")]
public class FormattedTableData : LinkedTableData, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
LinkedData
LinkedTableData
FormattedTableData
Implements
IDisposable
ICloneable
Derived
TableContent
Inherited Members
 LinkedTableData.GetEnumerator(TableEnumeratorOption)
 LinkedTableData.GetEnumerator()
 LinkedTableData.SetSize(int, int)
 LinkedTableData.GetColumnName(int)
 LinkedTableData.SetColumnName(int, string)
 LinkedTableData.AppendColumn(int)
 LinkedTableData.InsertColumn(int, int)
 LinkedTableData.DeleteColumn(int, int)
 LinkedTableData.AppendRow(int)
 LinkedTableData.InsertRow(int, int)
 LinkedTableData.DeleteRow(int, int)
 LinkedTableData.DeleteContent(int, int)
 LinkedTableData.GetContentTypes(int, int)
 LinkedTableData.IsContentEditable(int, int)
 LinkedTableData.GetCellState(int, int)
 LinkedTableData.SetCellState(int, int, CellStates)
 LinkedTableData.DataType(int, int)
 LinkedTableData.UnitType(int, int)
 LinkedTableData.SetDataType(int, int, DataType, UnitType)
 LinkedTableData.GetDataFormat(int, int)
 LinkedTableData.SetDataFormat(int, int, string)
 LinkedTableData.GetValue(int, int, int, FormatOption)
 LinkedTableData.GetValue(int, int)
 LinkedTableData.SetValue(int, int, int, object, ParseOption)
 LinkedTableData.SetValue(int, int, object)
 LinkedTableData.GetFieldId(int, int)
 LinkedTableData.SetFieldId(int, int, ObjectId)
 LinkedTableData.GetBlockTableRecordId(int, int)
 LinkedTableData.SetBlockTableRecordId(int, int, ObjectId)
 LinkedTableData.GetBlockAttributeValue(int, int, ObjectId)
 LinkedTableData.SetBlockAttributeValue(int, int, ObjectId, string)
 LinkedTableData.GetToolTip(int, int)
 LinkedTableData.SetToolTip(int, int, string)
 LinkedTableData.GetCustomData(int, int, string)
 LinkedTableData.SetCustomData(int, int, string, object)
 LinkedTableData.IsLinked(int, int)
 LinkedTableData.GetDataLink(CellRange)
 LinkedTableData.GetDataLink()
 LinkedTableData.GetDataLink(int, int)
 LinkedTableData.SetDataLink(CellRange, ObjectId, bool)
 LinkedTableData.SetDataLink(int, int, ObjectId, bool)
 LinkedTableData.UpdateDataLink(UpdateDirection, UpdateOption)
 LinkedTableData.UpdateDataLink(int, int, UpdateDirection, UpdateOption)
 LinkedTableData.NumberOfRows
 LinkedTableData.NumberOfColumns
 LinkedData.Clear()
 LinkedData.Name
 LinkedData.IsEmpty
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 FormattedTableData()
public FormattedTableData()
 FormattedTableData(IntPtr, bool)
protected FormattedTableData(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Methods
 Create(IntPtr, bool)
protected static FormattedTableData Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
FormattedTableData
 GetAlignment(int, int)
public virtual CellAlignment GetAlignment(int row, int column)
Parameters
row int
column int
Returns
CellAlignment
 GetBackgroundColor(int, int)
public virtual Color GetBackgroundColor(int row, int column)
Parameters
row int
column int
Returns
Color
 GetContentColor(int, int)
public virtual Color GetContentColor(int row, int column)
Parameters
row int
column int
Returns
Color
 GetGridColor(int, int, GridLineType)
public virtual Color GetGridColor(int row, int column, GridLineType gridLinetype)
Parameters
row int
column int
gridLinetype GridLineType
Returns
Color
 GetGridLineWeight(int, int, GridLineType)
public virtual LineWeight GetGridLineWeight(int row, int column, GridLineType gridLinetype)
Parameters
row int
column int
gridLinetype GridLineType
Returns
LineWeight
 GetGridLinetype(int, int, GridLineType)
public virtual ObjectId GetGridLinetype(int row, int column, GridLineType gridLinetype)
Parameters
row int
column int
gridLinetype GridLineType
Returns
ObjectId
 GetGridVisibility(int, int, GridLineType)
public virtual Visibility GetGridVisibility(int row, int column, GridLineType gridLinetype)
Parameters
row int
column int
gridLinetype GridLineType
Returns
Visibility
 GetMargin(int, int, CellMargins)
public virtual double GetMargin(int row, int column, CellMargins margin)
Parameters
row int
column int
margin CellMargins
Returns
double
 GetMergeRange(int, int)
public virtual CellRange GetMergeRange(int row, int column)
Parameters
row int
column int
Returns
CellRange
 GetOverride(int, int, GridLineType)
public virtual GridProperties GetOverride(int row, int column, GridLineType gridLinetype)
Parameters
row int
column int
gridLinetype GridLineType
Returns
GridProperties
 GetOverride(int, int, int)
public virtual CellProperties GetOverride(int row, int column, int content)
Parameters
row int
column int
content int
Returns
CellProperties
 GetRotation(int, int)
public virtual double GetRotation(int row, int column)
Parameters
row int
column int
Returns
double
 GetScale(int, int)
public virtual double GetScale(int row, int column)
Parameters
row int
column int
Returns
double
 GetTextHeight(int, int)
public virtual double GetTextHeight(int row, int column)
Parameters
row int
column int
Returns
double
 GetTextStyle(int, int)
public virtual ObjectId GetTextStyle(int row, int column)
Parameters
row int
column int
Returns
ObjectId
 IsFormatEditable(int, int)
public virtual bool IsFormatEditable(int row, int column)
Parameters
row int
column int
Returns
bool
 IsMerged(int, int)
public virtual bool IsMerged(int row, int column)
Parameters
row int
column int
Returns
bool
 Merge(CellRange)
public virtual void Merge(CellRange range)
Parameters
range CellRange
 RemoveAllOverrides(int, int)
public virtual void RemoveAllOverrides(int row, int column)
Parameters
row int
column int
 SetAlignment(int, int, CellAlignment)
public virtual void SetAlignment(int row, int column, CellAlignment value)
Parameters
row int
column int
value CellAlignment
 SetBackgroundColor(int, int, Color)
public virtual void SetBackgroundColor(int row, int column, Color value)
Parameters
row int
column int
value Color
 SetContentColor(int, int, Color)
public virtual void SetContentColor(int row, int column, Color value)
Parameters
row int
column int
value Color
 SetGridColor(int, int, GridLineType, Color)
public virtual void SetGridColor(int row, int column, GridLineType gridLinetype, Color value)
Parameters
row int
column int
gridLinetype GridLineType
value Color
 SetGridLineWeight(int, int, GridLineType, LineWeight)
public virtual void SetGridLineWeight(int row, int column, GridLineType gridLinetype, LineWeight value)
Parameters
row int
column int
gridLinetype GridLineType
value LineWeight
 SetGridLinetype(int, int, GridLineType, ObjectId)
public virtual void SetGridLinetype(int row, int column, GridLineType gridLinetype, ObjectId value)
Parameters
row int
column int
gridLinetype GridLineType
value ObjectId
 SetGridVisibility(int, int, GridLineType, Visibility)
public virtual void SetGridVisibility(int row, int column, GridLineType gridLinetype, Visibility value)
Parameters
row int
column int
gridLinetype GridLineType
value Visibility
 SetMargin(int, int, CellMargins, double)
public virtual void SetMargin(int row, int column, CellMargins margin, double value)
Parameters
row int
column int
margin CellMargins
value double
 SetOverride(int, int, GridLineType, GridProperties)
public virtual void SetOverride(int row, int column, GridLineType gridLinetype, GridProperties gridProperty)
Parameters
row int
column int
gridLinetype GridLineType
gridProperty GridProperties
 SetOverride(int, int, int, CellProperties)
public virtual void SetOverride(int row, int column, int content, CellProperties cellProperty)
Parameters
row int
column int
content int
cellProperty CellProperties
 SetRotation(int, int, double)
public virtual void SetRotation(int row, int column, double value)
Parameters
row int
column int
value double
 SetScale(int, int, double)
public virtual void SetScale(int row, int column, double value)
Parameters
row int
column int
value double
 SetTextHeight(int, int, double)
public virtual void SetTextHeight(int row, int column, double value)
Parameters
row int
column int
value double
 SetTextStyle(int, int, ObjectId)
public virtual void SetTextStyle(int row, int column, ObjectId value)
Parameters
row int
column int
value ObjectId
 Unmerge(CellRange)
public virtual void Unmerge(CellRange range)
Parameters
range CellRange