Table of Contents
 Class FaceData
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiFaceData")]
public sealed class FaceData
Inheritance
object
FaceData
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 FaceData()
public FaceData()
Methods
 GetColors()
public short[] GetColors()
Returns
short[]
 GetLayers()
public ObjectId[] GetLayers()
Returns
ObjectId[]
 GetMappers()
public Mapper[] GetMappers()
Returns
Mapper[]
 GetMaterials()
public ObjectId[] GetMaterials()
Returns
ObjectId[]
 GetNormalVectors()
public Vector3d[] GetNormalVectors()
Returns
Vector3d[]
 GetSelectionMarkers()
public IntPtr[] GetSelectionMarkers()
Returns
IntPtr[]
 GetTransparency()
public Transparency[] GetTransparency()
Returns
Transparency[]
 GetTrueColors()
public EntityColor[] GetTrueColors()
Returns
EntityColor[]
 GetVisibility()
public byte[] GetVisibility()
Returns
byte[]
 SetColors(short[])
public void SetColors(short[] colors)
Parameters
colors short[]
 SetLayers(ObjectId[])
public void SetLayers(ObjectId[] layers)
Parameters
layers ObjectId[]
 SetMappers(Mapper[])
public void SetMappers(Mapper[] mappers)
Parameters
mappers Mapper[]
 SetMaterials(ObjectId[])
public void SetMaterials(ObjectId[] materials)
Parameters
materials ObjectId[]
 SetNormalVectors(Vector3d[])
public void SetNormalVectors(Vector3d[] normal)
Parameters
normal Vector3d[]
 SetSelectionMarkers(IntPtr[])
public void SetSelectionMarkers(IntPtr[] selectionMarker)
Parameters
selectionMarker IntPtr[]
 SetTransparency(Transparency[])
public void SetTransparency(Transparency[] transparency)
Parameters
transparency Transparency[]
 SetTrueColors(EntityColor[])
public void SetTrueColors(EntityColor[] colors)
Parameters
colors EntityColor[]
 SetVisibility(byte[])
public void SetVisibility(byte[] visibility)
Parameters
visibility byte[]