Table of Contents
 Class Field
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcdbField")]
public class Field : DBObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
Field
Implements
IDisposable
ICloneable
Inherited Members
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Field()
public Field()
 Field(IntPtr, bool)
protected Field(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
 Field(string)
public Field(string fieldCode)
Parameters
fieldCode string
 Field(string, bool)
public Field(string fieldCode, bool textField)
Parameters
fieldCode string
textField bool
Properties
 DataType
public DataType DataType { get; }
Property Value
DataType
 EvaluationOption
public FieldEvaluationOptions EvaluationOption { get; set; }
Property Value
FieldEvaluationOptions
 EvaluationStatus
public FieldEvaluationStatusResult EvaluationStatus { get; }
Property Value
FieldEvaluationStatusResult
 EvaluatorId
public string EvaluatorId { get; set; }
Property Value
string
 FilingOption
public FieldFilingOptions FilingOption { get; set; }
Property Value
FieldFilingOptions
 Format
public string Format { get; set; }
Property Value
string
 HyperLink
public HyperLink HyperLink { get; set; }
Property Value
HyperLink
 IsTextField
public bool IsTextField { get; }
Property Value
bool
 State
public FieldState State { get; }
Property Value
FieldState
 Value
public object Value { get; }
Property Value
object
Methods
 ConvertToTextField()
public void ConvertToTextField()
 Evaluate()
public void Evaluate()
 Evaluate(int, Database)
public void Evaluate(int evaluationOptions, Database database)
Parameters
evaluationOptions int
database Database
 FindField(string, int, ref int, ref int)
public static bool FindField(string text, int iSearchFrom, ref int nStartPos, ref int nEndPos)
Parameters
text string
iSearchFrom int
nStartPos int
nEndPos int
Returns
bool
 GetChildren()
public Field[] GetChildren()
Returns
Field[]
 GetChildrenIds()
public ObjectId[] GetChildrenIds()
Returns
ObjectId[]
 GetData(string)
public object GetData(string key)
Parameters
key string
Returns
object
 GetFieldCode()
public string GetFieldCode()
Returns
string
 GetFieldCode(FieldCodeFlags)
public string GetFieldCode(FieldCodeFlags flags)
Parameters
flags FieldCodeFlags
Returns
string
 GetFieldCodeWithChildren()
public FieldCodeWithChildren GetFieldCodeWithChildren()
Returns
FieldCodeWithChildren
 GetFieldCodeWithChildren(FieldCodeFlags)
public FieldCodeWithChildren GetFieldCodeWithChildren(FieldCodeFlags flags)
Parameters
flags FieldCodeFlags
Returns
FieldCodeWithChildren
 GetStringValue()
public string GetStringValue()
Returns
string
 SetData(string, object)
public void SetData(string key, object data)
Parameters
key string
data object
 SetData(string, object, bool)
public void SetData(string key, object data, bool recursive)
Parameters
key string
data object
recursive bool
 SetFieldCode(string)
public void SetFieldCode(string fieldCode)
Parameters
fieldCode string
 SetFieldCodeWithChildren(FieldCodeFlags, FieldCodeWithChildren)
public void SetFieldCodeWithChildren(FieldCodeFlags flag, FieldCodeWithChildren fieldCode)
Parameters
flag FieldCodeFlags
fieldCode FieldCodeWithChildren
 SetFieldCodeWithChildren(FieldCodeWithChildren)
public void SetFieldCodeWithChildren(FieldCodeWithChildren fieldCode)
Parameters
fieldCode FieldCodeWithChildren