Table of Contents
 Enum TextAlignmentType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMLeaderStyle::TextAlignmentType")]
public enum TextAlignmentType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CenterAlignment = 1
LeftAlignment = 0
RightAlignment = 2