Table of Contents
 Class MTextFragment
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMTextFragment")]
public sealed class MTextFragment : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
MTextFragment
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 BigFont
public string BigFont { get; }
Property Value
string
 Bold
public bool Bold { get; }
Property Value
bool
 CapsHeight
[UnitType(UnitType.Distance)]
public double CapsHeight { get; }
Property Value
double
 Color
public EntityColor Color { get; }
Property Value
EntityColor
 Direction
public Vector3d Direction { get; }
Property Value
Vector3d
 Extents
public Point2d Extents { get; }
Property Value
Point2d
 Italic
public bool Italic { get; }
Property Value
bool
 Location
public Point3d Location { get; }
Property Value
Point3d
 Normal
public Vector3d Normal { get; }
Property Value
Vector3d
 ObliqueAngle
[UnitType(UnitType.Angle)]
public double ObliqueAngle { get; }
Property Value
double
 Overlined
public bool Overlined { get; }
Property Value
bool
 ShxFont
public string ShxFont { get; }
Property Value
string
 StackBottom
public bool StackBottom { get; }
Property Value
bool
 StackTop
public bool StackTop { get; }
Property Value
bool
 Strikethrough
public bool Strikethrough { get; }
Property Value
bool
 Text
public string Text { get; }
Property Value
string
 TrackingFactor
[UnitType(UnitType.Unitless)]
public double TrackingFactor { get; }
Property Value
double
 TrueTypeFont
public string TrueTypeFont { get; }
Property Value
string
 Underlined
public bool Underlined { get; }
Property Value
bool
 WidthFactor
[UnitType(UnitType.Unitless)]
public double WidthFactor { get; }
Property Value
double
Methods
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 GetOverLinePoints()
public Point3d[] GetOverLinePoints()
Returns
Point3d[]
 GetStrikethroughPoints()
public Point3d[] GetStrikethroughPoints()
Returns
Point3d[]
 GetUnderLinePoints()
public Point3d[] GetUnderLinePoints()
Returns
Point3d[]