Table of Contents
 Enum XrefStatus
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::XrefStatus")]
[TypeConverter(typeof(EnumConverter))]
public enum XrefStatus
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
FileNotFound = 4
NotAnXref = 0
Resolved = 1
Unloaded = 2
Unreferenced = 3
Unresolved = 5