Table of Contents
 Enum PlotType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbPlotSettings::PlotType")]
public enum PlotType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Display = 0
Extents = 1
Layout = 5
Limits = 2
View = 3
Window = 4