Table of Contents
 Struct NurbCurve2dFitData
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public struct NurbCurve2dFitData
Inherited Members
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Properties
 Degree
public int Degree { get; }
Property Value
int
 EndTangent
public Vector2d EndTangent { get; }
Property Value
Vector2d
 FitPoints
public Point2dCollection FitPoints { get; }
Property Value
Point2dCollection
 FitTolerance
public Tolerance FitTolerance { get; }
Property Value
Tolerance
 KnotParam
public KnotParameterizationEnum KnotParam { get; }
Property Value
KnotParameterizationEnum
 StartTangent
public Vector2d StartTangent { get; }
Property Value
Vector2d
 TangentsExist
public bool TangentsExist { get; }
Property Value
bool
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 IsEqualTo(NurbCurve2dFitData)
public bool IsEqualTo(NurbCurve2dFitData a)
Parameters
a NurbCurve2dFitData
Returns
bool
Operators
 operator ==(NurbCurve2dFitData, NurbCurve2dFitData)
public static bool operator ==(NurbCurve2dFitData a, NurbCurve2dFitData b)
Parameters
a NurbCurve2dFitData
b NurbCurve2dFitData
Returns
bool
 operator !=(NurbCurve2dFitData, NurbCurve2dFitData)
public static bool operator !=(NurbCurve2dFitData a, NurbCurve2dFitData b)
Parameters
a NurbCurve2dFitData
b NurbCurve2dFitData
Returns
bool