Table of Contents
 Enum FieldState
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
public enum FieldState
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Compiled = 2
Evaluated = 8
HasCache = 16
HasFormattedString = 32
Initialized = 1
Modified = 4