Table of Contents
 Class GroundPlaneBackgroundTraits
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiGroundPlaneBackgroundTraits")]
public abstract class GroundPlaneBackgroundTraits : NonEntityTraits, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
SubEntityTraits
DrawableTraits
NonEntityTraits
GroundPlaneBackgroundTraits
Implements
IDisposable
ICloneable
Inherited Members
 NonEntityTraits.SetupForEntity(Entity)
 NonEntityTraits.SetSelectionMarker(IntPtr)
 NonEntityTraits.AddLight(ObjectId)
 NonEntityTraits.SetLayerFlags(DrawableTraits.LayerFlags)
 NonEntityTraits.SetHighlightProperty(DrawableTraits.HighlightProperty, object)
 NonEntityTraits.GetHighlightProperty(DrawableTraits.HighlightProperty)
 NonEntityTraits.SelectionFlags
 NonEntityTraits.LinePattern
 NonEntityTraits.Fill
 NonEntityTraits.SelectionOnlyGeometry
 NonEntityTraits.ShadowFlags
 NonEntityTraits.DrawFlags
 NonEntityTraits.VisualStyle
 NonEntityTraits.Sectionable
 NonEntityTraits.Mapper
 NonEntityTraits.Material
 NonEntityTraits.PlotStyleDescriptor
 NonEntityTraits.Thickness
 NonEntityTraits.LineTypeScale
 NonEntityTraits.LineWeight
 NonEntityTraits.FillType
 NonEntityTraits.LineType
 NonEntityTraits.Layer
 NonEntityTraits.Transparency
 NonEntityTraits.TrueColor
 NonEntityTraits.Color
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 GroundPlaneBackgroundTraits()
protected GroundPlaneBackgroundTraits()
 GroundPlaneBackgroundTraits(IntPtr, bool)
protected GroundPlaneBackgroundTraits(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 ColorGroundPlaneFar
public abstract EntityColor ColorGroundPlaneFar { get; set; }
Property Value
EntityColor
 ColorGroundPlaneNear
public abstract EntityColor ColorGroundPlaneNear { get; set; }
Property Value
EntityColor
 ColorSkyHorizon
public abstract EntityColor ColorSkyHorizon { get; set; }
Property Value
EntityColor
 ColorSkyZenith
public abstract EntityColor ColorSkyZenith { get; set; }
Property Value
EntityColor
 ColorUndergroundAzimuth
public abstract EntityColor ColorUndergroundAzimuth { get; set; }
Property Value
EntityColor
 ColorUndergroundHorizon
public abstract EntityColor ColorUndergroundHorizon { get; set; }
Property Value
EntityColor