Table of Contents
 Class TextStyle
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiTextStyle")]
public sealed class TextStyle : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
TextStyle
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 TextStyle()
public TextStyle()
 TextStyle(IntPtr, bool)
protected TextStyle(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
 TextStyle(string, string, double, double, double, double, bool, bool, bool, bool, bool, bool, string)
public TextStyle(string fontName, string bigFontName, double textSize, double x, double obliqueAngle, double trackingPercent, bool isBackward, bool isUpsideDown, bool isVertical, bool isOverLined, bool isUnderlined, bool isStrikethrough, string styleName)
Parameters
fontName string
bigFontName string
textSize double
x double
obliqueAngle double
trackingPercent double
isBackward bool
isUpsideDown bool
isVertical bool
isOverLined bool
isUnderlined bool
isStrikethrough bool
styleName string
Properties
 Backward
public bool Backward { get; set; }
Property Value
bool
 BigFontFileName
public string BigFontFileName { get; set; }
Property Value
string
 FileName
public string FileName { get; set; }
Property Value
string
 Font
public FontDescriptor Font { get; set; }
Property Value
FontDescriptor
 LoadStyleRec
public byte LoadStyleRec { get; }
Property Value
byte
 ObliquingAngle
public double ObliquingAngle { get; set; }
Property Value
double
 Overlined
public bool Overlined { get; set; }
Property Value
bool
 PreLoaded
public bool PreLoaded { get; set; }
Property Value
bool
 Strikethrough
public bool Strikethrough { get; set; }
Property Value
bool
 StyleName
public string StyleName { get; set; }
Property Value
string
 TextSize
public double TextSize { get; set; }
Property Value
double
 TrackingPercent
public double TrackingPercent { get; set; }
Property Value
double
 Underlined
public bool Underlined { get; set; }
Property Value
bool
 UpsideDown
public bool UpsideDown { get; set; }
Property Value
bool
 Vertical
public bool Vertical { get; set; }
Property Value
bool
 XScale
public double XScale { get; set; }
Property Value
double
Methods
 Create(IntPtr, bool)
public static TextStyle Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
TextStyle
 ExtentsBox(string, bool, bool, WorldDraw)
public Extents2d ExtentsBox(string value1, bool includeSpaces, bool raw, WorldDraw context)
Parameters
value1 string
includeSpaces bool
raw bool
context WorldDraw
Returns
Extents2d
 FromTextStyleTableRecord(ObjectId)
public void FromTextStyleTableRecord(ObjectId AcDbStyleId)
Parameters
AcDbStyleId ObjectId
 FromTextStyleTableRecord(string)
public void FromTextStyleTableRecord(string AcDbStyleName)
Parameters
AcDbStyleName string
 SetTrackKerning(double)
public void SetTrackKerning(double trackPercent)
Parameters
trackPercent double
 ToTextStyleTableRecord()
public ObjectId ToTextStyleTableRecord()
Returns
ObjectId
 ToTextStyleTableRecord(ObjectId)
public void ToTextStyleTableRecord(ObjectId AcDbStyleId)
Parameters
AcDbStyleId ObjectId
 ToTextStyleTableRecord(string)
public ObjectId ToTextStyleTableRecord(string AcDbStyleName)
Parameters
AcDbStyleName string
Returns
ObjectId