Table of Contents
 Enum VSEdgeJitterAmount
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiVisualStyleProperties::EdgeJitterAmount")]
public enum VSEdgeJitterAmount
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
JitterHigh = 3
JitterLow = 1
JitterMedium = 2