Table of Contents
 Enum UnderlayLayerState
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcUnderlayLayer::State")]
[Flags]
public enum UnderlayLayerState
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Off = 0
On = 1