Table of Contents
 Enum SectionGeneration
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcDbSectionSettings::Generation")]
public enum SectionGeneration
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
DestinationFile = 64
DestinationNewBlock = 16
DestinationReplaceBlock = 32
SourceAllObjects = 1
SourceSelectedObjects = 2