Table of Contents
 Struct Tolerance
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeTol")]
public struct Tolerance
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 Tolerance(double, double)
public Tolerance(double equalVector, double equalPoint)
Parameters
equalVector double
equalPoint double
Properties
 EqualPoint
public double EqualPoint { get; }
Property Value
double
 EqualVector
public double EqualVector { get; }
Property Value
double
 Global
public static Tolerance Global { get; set; }
Property Value
Tolerance