Table of Contents
 Class Point2dCollectionEnumerator
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public sealed class Point2dCollectionEnumerator : IEnumerator
Inheritance
object
Point2dCollectionEnumerator
Implements
IEnumerator
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Point2dCollectionEnumerator(Point2dCollection)
public Point2dCollectionEnumerator(Point2dCollection col)
Parameters
col Point2dCollection
Properties
 Current
public Point2d Current { get; }
Property Value
Point2d
Methods
 MoveNext()
public bool MoveNext()
Returns
bool
 Reset()
public void Reset()