Table of Contents
 Enum ShadePlotType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbViewport::ShadePlotType")]
public enum ShadePlotType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AsDisplayed = 0
Hidden = 2
RenderPreset = 5
Rendered = 3
VisualStyle = 4
Wireframe = 1