Table of Contents
 Class ExternalBoundedSurface
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeExternalBoundedSurface")]
public sealed class ExternalBoundedSurface : Surface, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
Surface
ExternalBoundedSurface
Implements
IDisposable
ICloneable
Inherited Members
 Surface.GetClosestPointTo(Point3d)
 Surface.GetClosestPointTo(Point3d, Tolerance)
 Surface.GetEnvelope()
 Surface.ParameterOf(Point3d)
 Surface.ParameterOf(Point3d, Tolerance)
 Surface.IsOn(Point3d, Point2d)
 Surface.IsOn(Point3d, Point2d, Tolerance)
 Surface.ClosestPointTo(Point3d)
 Surface.ClosestPointTo(Point3d, Tolerance)
 Surface.DistanceTo(Point3d)
 Surface.DistanceTo(Point3d, Tolerance)
 Surface.IsClosedInU()
 Surface.IsClosedInU(Tolerance)
 Surface.IsClosedInV()
 Surface.IsClosedInV(Tolerance)
 Surface.EvaluatePoint(Point2d, int, ref Vector3dCollection, ref Vector3d)
 Surface.EvaluatePoint(Point2d, int, ref Vector3dCollection)
 Surface.EvaluatePoint(Point2d)
 Surface.ReverseNormal
 Surface.IsNormalReversed
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.IsOn(Point3d)
 Entity3d.IsOn(Point3d, Tolerance)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ExternalBoundedSurface()
public ExternalBoundedSurface()
 ExternalBoundedSurface(IntPtr, ExternalEntityKind)
public ExternalBoundedSurface(IntPtr surfaceDefinition, ExternalEntityKind surfaceKind)
Parameters
surfaceDefinition IntPtr
surfaceKind ExternalEntityKind
Properties
 BaseSurface
public Surface BaseSurface { get; }
Property Value
Surface
 ExternalBaseSurface
public ExternalSurface ExternalBaseSurface { get; }
Property Value
ExternalSurface
 ExternalSurfaceDefinition
public IntPtr ExternalSurfaceDefinition { get; }
Property Value
IntPtr
 ExternalSurfaceKind
public ExternalEntityKind ExternalSurfaceKind { get; }
Property Value
ExternalEntityKind
 IsCone
public bool IsCone { get; }
Property Value
bool
 IsCylinder
public bool IsCylinder { get; }
Property Value
bool
 IsDefined
public bool IsDefined { get; }
Property Value
bool
 IsExternalSurface
public bool IsExternalSurface { get; }
Property Value
bool
 IsNurbs
public bool IsNurbs { get; }
Property Value
bool
 IsOwnerOfSurface
public bool IsOwnerOfSurface { get; }
Property Value
bool
 IsPlane
public bool IsPlane { get; }
Property Value
bool
 IsSphere
public bool IsSphere { get; }
Property Value
bool
 IsTorus
public bool IsTorus { get; }
Property Value
bool
 NumContours
public int NumContours { get; }
Property Value
int
Methods
 Create(IntPtr, bool)
public static ExternalBoundedSurface Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
ExternalBoundedSurface
 GetContours()
public CurveBoundary[] GetContours()
Returns
CurveBoundary[]
 Set(IntPtr, ExternalEntityKind)
public void Set(IntPtr surfaceDef, ExternalEntityKind surfaceKind)
Parameters
surfaceDef IntPtr
surfaceKind ExternalEntityKind
 SetToOwnSurface()
public void SetToOwnSurface()