Table of Contents
 Class BoundBlock2d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeBoundBlock2d")]
public sealed class BoundBlock2d : Entity2d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity2d
BoundBlock2d
Implements
IDisposable
ICloneable
Inherited Members
 Entity2d.Clone()
 Entity2d.IsEqualTo(Entity2d)
 Entity2d.IsEqualTo(Entity2d, Tolerance)
 Entity2d.TransformBy(Matrix2d)
 Entity2d.TranslateBy(Vector2d)
 Entity2d.RotateBy(double, Point2d)
 Entity2d.Mirror(Line2d)
 Entity2d.ScaleBy(double, Point2d)
 Entity2d.IsOn(Point2d)
 Entity2d.IsOn(Point2d, Tolerance)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 BoundBlock2d()
public BoundBlock2d()
 BoundBlock2d(Point2d, Point2d)
public BoundBlock2d(Point2d point1, Point2d point2)
Parameters
point1 Point2d
point2 Point2d
 BoundBlock2d(Point2d, Vector2d, Vector2d)
public BoundBlock2d(Point2d basePoint, Vector2d direction1, Vector2d direction2)
Parameters
basePoint Point2d
direction1 Vector2d
direction2 Vector2d
Properties
 BasePoint
public Point2d BasePoint { get; }
Property Value
Point2d
 Direction1
public Vector2d Direction1 { get; }
Property Value
Vector2d
 Direction2
public Vector2d Direction2 { get; }
Property Value
Vector2d
 IsBox
public bool IsBox { get; set; }
Property Value
bool
Methods
 Contains(Point2d)
public bool Contains(Point2d point)
Parameters
point Point2d
Returns
bool
 Create(IntPtr, bool)
public static BoundBlock2d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
BoundBlock2d
 Extend(Point2d)
public void Extend(Point2d point)
Parameters
point Point2d
 GetMaximumPoint()
public Point2d GetMaximumPoint()
Returns
Point2d
 GetMinimumPoint()
public Point2d GetMinimumPoint()
Returns
Point2d
 IsDisjoint(BoundBlock2d)
public bool IsDisjoint(BoundBlock2d block)
Parameters
block BoundBlock2d
Returns
bool
 Set(Point2d, Point2d)
public void Set(Point2d firstPoint, Point2d secondPoint)
Parameters
firstPoint Point2d
secondPoint Point2d
 Set(Point2d, Vector2d, Vector2d)
public void Set(Point2d basePoint, Vector2d direction1, Vector2d direction2)
Parameters
basePoint Point2d
direction1 Vector2d
direction2 Vector2d
 Swell(double)
public void Swell(double distance)
Parameters
distance double