Table of Contents
 Enum GeoCSProjectionCode
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbGeoCoordinateSystem::ProjectionCode")]
public enum GeoCSProjectionCode
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Alber = 4
Azede = 59
Azmea = 11
Azmed = 7
Bipolar = 31
Bonne = 24
Cassini = 22
Eckert4 = 25
Eckert6 = 26
Edcnc = 12
Edcyl = 20
EdcylE = 67
GaussK = 46
Gnomonic = 19
Goode = 28
Hom1uv = 1281
Hom1xy = 1282
Hom2uv = 1283
Hom2xy = 1284
Krovak = 47
Krvk95 = 51
LL = 1
Lm1sp = 36
Lm2sp = 37
Lmblg = 38
Lmbrtaf = 65
Lmtan = 8
Miller = 13
Mndotl = 41
Mndott = 42
Modpc = 10
Mollweid = 27
Mrcat = 6
MrcatK = 49
Mstero = 15
Neacyl = 29
Nerth = 55
Nrthsrt = 64
Nzealand = 16
OblqM = 5
Obqcyl = 56
Ortho = 18
Ostn02 = 60
Ostn97 = 58
Ostro = 34
PlateCarree = 68
Plycn = 9
Pstro = 33
Pstrosl = 53
PvMercator = 69
Robinson = 23
Rskew = 1285
Rskewc = 1286
Rskewo = 1287
Sinus = 17
Sotrm = 43
Sstro = 35
Swiss = 32
Sys34 = 57
Sys34_01 = 66
Sys34_99 = 61
Teacyl = 30
Tm = 3
Trmeraf = 54
Trmrkrg = 62
Trmrs = 45
Unknown = 0
Utm = 44
Vdgrntn = 21
Wccsl = 39
Wccst = 40
Winkl = 63