Table of Contents
 Enum AssocDraggingState
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocDraggingState")]
public enum AssocDraggingState
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
FirstSampleAssocDraggingState = 1
IntermediateSampleAssocDraggingState = 2
LastSampleAssocDraggingState = 3
NotDraggingAssocDraggingState = 0