Table of Contents
 Class Spline
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbSpline")]
public class Spline : Curve, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
Entity
Curve
Spline
Implements
IDisposable
ICloneable
Derived
Helix
Inherited Members
 Curve.GetPointAtParameter(double)
 Curve.GetParameterAtPoint(Point3d)
 Curve.GetDistanceAtParameter(double)
 Curve.GetParameterAtDistance(double)
 Curve.GetDistAtPoint(Point3d)
 Curve.GetPointAtDist(double)
 Curve.GetFirstDerivative(Point3d)
 Curve.GetFirstDerivative(double)
 Curve.GetSecondDerivative(Point3d)
 Curve.GetSecondDerivative(double)
 Curve.GetClosestPointTo(Point3d, Vector3d, bool)
 Curve.GetClosestPointTo(Point3d, bool)
 Curve.GetOrthoProjectedCurve(Plane)
 Curve.GetProjectedCurve(Plane, Vector3d)
 Curve.GetOffsetCurves(double)
 Curve.GetOffsetCurvesGivenPlaneNormal(Vector3d, double)
 Curve.GetSplitCurves(Point3dCollection)
 Curve.GetSplitCurves(DoubleCollection)
 Curve.Extend(bool, Point3d)
 Curve.Extend(double)
 Curve.ReverseCurve()
 Curve.GetGeCurve()
 Curve.GetGeCurve(Tolerance)
 Curve.CreateFromGeCurve(Curve3d)
 Curve.CreateFromGeCurve(Curve3d, Tolerance)
 Curve.CreateFromGeCurve(Curve3d, Vector3d)
 Curve.CreateFromGeCurve(Curve3d, Vector3d, Tolerance)
 Curve.SetFromGeCurve(Curve3d)
 Curve.SetFromGeCurve(Curve3d, Tolerance)
 Curve.SetFromGeCurve(Curve3d, Vector3d)
 Curve.SetFromGeCurve(Curve3d, Vector3d, Tolerance)
 Curve.Area
 Curve.Spline
 Curve.EndPoint
 Curve.StartPoint
 Curve.EndParam
 Curve.StartParam
 Curve.IsPeriodic
 Curve.Closed
 Entity.SetLayerId(ObjectId, bool)
 Entity.SetPropertiesFrom(Entity)
 Entity.GetPlane()
 Entity.AddSubentityPaths(FullSubentityPath[])
 Entity.DeleteSubentityPaths(FullSubentityPath[])
 Entity.TransformSubentityPathsBy(FullSubentityPath[], Matrix3d)
 Entity.GetGripPointsAtSubentityPath(FullSubentityPath, GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.MoveGripPointsAtSubentityPaths(FullSubentityPath[], IntPtr[], Vector3d, MoveGripPointsFlags)
 Entity.GetSubentityGeometricExtents(FullSubentityPath)
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, IntPtr, Point3d, Matrix3d, ObjectId[])
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, long, Point3d, Matrix3d, int, ObjectId[])
 Entity.GetGraphicsMarkersAtSubentityPathIntPtr(FullSubentityPath)
 Entity.Highlight(FullSubentityPath, bool)
 Entity.Highlight()
 Entity.Unhighlight(FullSubentityPath, bool)
 Entity.Unhighlight()
 Entity.PushHighlight(FullSubentityPath, HighlightStyle)
 Entity.PopHighlight(FullSubentityPath)
 Entity.HighlightState(FullSubentityPath)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection, Matrix3d)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection)
 Entity.IsContentSnappable()
 Entity.GetGripPoints(GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.GetGripPoints(Point3dCollection, IntegerCollection, IntegerCollection)
 Entity.MoveGripPointsAt(GripDataCollection, Vector3d, MoveGripPointsFlags)
 Entity.MoveGripPointsAt(IntegerCollection, Vector3d)
 Entity.GetStretchPoints(Point3dCollection)
 Entity.MoveStretchPointsAt(IntegerCollection, Vector3d)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.List()
 Entity.TransformBy(Matrix3d)
 Entity.GetTransformedCopy(Matrix3d)
 Entity.GetSubentity(FullSubentityPath)
 Entity.Explode(DBObjectCollection)
 Entity.RecordGraphicsModified(bool)
 Entity.Draw()
 Entity.SaveAs(WorldDraw, SaveType)
 Entity.SetDatabaseDefaults(Database)
 Entity.SetDatabaseDefaults()
 Entity.SetDragStatus(DragStatus)
 Entity.SetGripStatus(GripStatus)
 Entity.SetSubentityGripStatus(GripStatus, FullSubentityPath)
 Entity.JoinEntity(Entity)
 Entity.JoinEntities(Entity[])
 Entity.EdgeStyleId
 Entity.FaceStyleId
 Entity.VisualStyleId
 Entity.ForceAnnoAllVisible
 Entity.BlockName
 Entity.MaterialMapper
 Entity.MaterialId
 Entity.Material
 Entity.ReceiveShadows
 Entity.CastShadows
 Entity.Hyperlinks
 Entity.CloneMeForDragging
 Entity.CompoundObjectTransform
 Entity.GeometricExtents
 Entity.Ecs
 Entity.CollisionType
 Entity.LineWeight
 Entity.Visible
 Entity.LinetypeScale
 Entity.LinetypeId
 Entity.Linetype
 Entity.LayerId
 Entity.Layer
 Entity.PlotStyleNameId
 Entity.PlotStyleName
 Entity.Transparency
 Entity.EntityColor
 Entity.ColorIndex
 Entity.Color
 Entity.BlockId
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Spline()
public Spline()
 Spline(Point3d, Vector3d, Vector3d, double, double, double)
public Spline(Point3d center, Vector3d unitNormal, Vector3d majorAxis, double radiusRatio, double startAngle, double endAngle)
Parameters
center Point3d
unitNormal Vector3d
majorAxis Vector3d
radiusRatio double
startAngle double
endAngle double
 Spline(Point3dCollection, KnotParameterizationEnum, int, double)
public Spline(Point3dCollection fitPoints, KnotParameterizationEnum knotParam, int degree, double fitTolerance)
Parameters
fitPoints Point3dCollection
knotParam KnotParameterizationEnum
degree int
fitTolerance double
 Spline(Point3dCollection, Vector3d, Vector3d, KnotParameterizationEnum, int, double)
public Spline(Point3dCollection fitPoints, Vector3d startTangent, Vector3d endTangent, KnotParameterizationEnum knotParam, int degree, double fitTolerance)
Parameters
fitPoints Point3dCollection
startTangent Vector3d
endTangent Vector3d
knotParam KnotParameterizationEnum
degree int
fitTolerance double
 Spline(Point3dCollection, Vector3d, Vector3d, int, double)
public Spline(Point3dCollection point, Vector3d startTangent, Vector3d endTangent, int order, double fitTolerance)
Parameters
point Point3dCollection
startTangent Vector3d
endTangent Vector3d
order int
fitTolerance double
 Spline(Point3dCollection, bool, KnotParameterizationEnum, int, double)
public Spline(Point3dCollection fitPoints, bool isPeriodic, KnotParameterizationEnum knotParam, int degree, double fitTolerance)
Parameters
fitPoints Point3dCollection
isPeriodic bool
knotParam KnotParameterizationEnum
degree int
fitTolerance double
 Spline(Point3dCollection, int, double)
public Spline(Point3dCollection point, int order, double fitTolerance)
Parameters
point Point3dCollection
order int
fitTolerance double
 Spline(int, bool, bool, bool, Point3dCollection, DoubleCollection, DoubleCollection, double, double)
public Spline(int degree, bool rational, bool closed, bool periodic, Point3dCollection controlPoints, DoubleCollection knots, DoubleCollection weights, double controlPointTolerance, double knotTolerance)
Parameters
degree int
rational bool
closed bool
periodic bool
controlPoints Point3dCollection
knots DoubleCollection
weights DoubleCollection
controlPointTolerance double
knotTolerance double
 Spline(IntPtr, bool)
protected Spline(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 Degree
public int Degree { get; }
Property Value
int
 EndFitTangent
public Vector3d EndFitTangent { get; }
Property Value
Vector3d
 FitData
public FitData FitData { get; set; }
Property Value
FitData
 FitTolerance
[UnitType(UnitType.Distance)]
public double FitTolerance { get; set; }
Property Value
double
 HasFitData
public bool HasFitData { get; }
Property Value
bool
 IsNull
public bool IsNull { get; }
Property Value
bool
 IsPlanar
public override bool IsPlanar { get; }
Property Value
bool
 IsRational
public bool IsRational { get; }
Property Value
bool
 NumControlPoints
public int NumControlPoints { get; }
Property Value
int
 NumFitPoints
public int NumFitPoints { get; }
Property Value
int
 NurbsData
public NurbsData NurbsData { get; set; }
Property Value
NurbsData
 StartFitTangent
public Vector3d StartFitTangent { get; }
Property Value
Vector3d
 Type
public SplineType Type { get; set; }
Property Value
SplineType
Methods
 ElevateDegree(int)
public void ElevateDegree(int newDegree)
Parameters
newDegree int
 GetControlPointAt(int)
public Point3d GetControlPointAt(int index)
Parameters
index int
Returns
Point3d
 GetFitPointAt(int)
public Point3d GetFitPointAt(int index)
Parameters
index int
Returns
Point3d
 InsertControlPointAt(double, Point3d, double)
public ErrorStatus InsertControlPointAt(double knotParam, Point3d controlPoint, double weight)
Parameters
knotParam double
controlPoint Point3d
weight double
Returns
ErrorStatus
 InsertFitPointAt(int, Point3d)
public void InsertFitPointAt(int index, Point3d point)
Parameters
index int
point Point3d
 InsertKnot(double)
public void InsertKnot(double value)
Parameters
value double
 ModifyPositionAndTangent(double, Point3d, Vector3d)
public ErrorStatus ModifyPositionAndTangent(double param, Point3d point, Vector3d deriv)
Parameters
param double
point Point3d
deriv Vector3d
Returns
ErrorStatus
 PurgeFitData()
public void PurgeFitData()
 Rebuild(int, int)
public ErrorStatus Rebuild(int degree, int numCtrlPts)
Parameters
degree int
numCtrlPts int
Returns
ErrorStatus
 RemoveControlPointAt(int)
public ErrorStatus RemoveControlPointAt(int index)
Parameters
index int
Returns
ErrorStatus
 RemoveFitPointAt(int)
public void RemoveFitPointAt(int index)
Parameters
index int
 SetControlPointAt(int, Point3d)
public void SetControlPointAt(int index, Point3d point)
Parameters
index int
point Point3d
 SetFitPointAt(int, Point3d)
public void SetFitPointAt(int index, Point3d point)
Parameters
index int
point Point3d
 SetWeightAt(int, double)
public void SetWeightAt(int index, double weight)
Parameters
index int
weight double
 ToPolyline()
public Curve ToPolyline()
Returns
Curve
 ToPolyline(bool, bool)
public Curve ToPolyline(bool bConvertAsArcs, bool bToLWPolyline)
Parameters
bConvertAsArcs bool
bToLWPolyline bool
Returns
Curve
 ToPolyline(uint)
public Curve ToPolyline(uint numOfVertices)
Parameters
numOfVertices uint
Returns
Curve
 ToPolyline(uint, bool, bool)
public Curve ToPolyline(uint numOfVertices, bool bConvertAsArcs, bool bToLWPolyline)
Parameters
numOfVertices uint
bConvertAsArcs bool
bToLWPolyline bool
Returns
Curve
 ToPolylineWithPrecision(int)
public Curve ToPolylineWithPrecision(int precision)
Parameters
precision int
Returns
Curve
 ToPolylineWithPrecision(int, bool, bool)
public Curve ToPolylineWithPrecision(int precision, bool bConvertAsArcs, bool bToLWPolyline)
Parameters
precision int
bConvertAsArcs bool
bToLWPolyline bool
Returns
Curve
 UpdateFitData()
public void UpdateFitData()
 WeightAt(int)
public double WeightAt(int index)
Parameters
index int
Returns
double