Table of Contents
 Class Int32Collection
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeInt32Array")]
public class Int32Collection : IList, ICollection, IEnumerable
Inheritance
object
Int32Collection
Implements
IList
ICollection
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Int32Collection()
public Int32Collection()
 Int32Collection(int)
public Int32Collection(int capacity)
Parameters
capacity int
 Int32Collection(int[])
public Int32Collection(int[] values)
Parameters
values int[]
Fields
 DefaultSize
public const int DefaultSize = 10
Field Value
int
Properties
 Capacity
public virtual int Capacity { get; set; }
Property Value
int
 Count
public virtual int Count { get; }
Property Value
int
 IsFixedSize
public virtual bool IsFixedSize { get; }
Property Value
bool
 IsReadOnly
public virtual bool IsReadOnly { get; }
Property Value
bool
 IsSynchronized
public virtual bool IsSynchronized { get; }
Property Value
bool
 this[int]
public virtual int this[int index] { get; set; }
Parameters
index int
Property Value
int
 SyncRoot
public virtual object SyncRoot { get; }
Property Value
object
Methods
 Add(int)
public virtual int Add(int value)
Parameters
value int
Returns
int
 AddRange(int[])
public virtual void AddRange(int[] range)
Parameters
range int[]
 Clear()
public virtual void Clear()
 Contains(int)
public virtual bool Contains(int value)
Parameters
value int
Returns
bool
 CopyTo(int[], int)
public virtual void CopyTo(int[] array, int index)
Parameters
array int[]
index int
 GetEnumerator()
public virtual Int32CollectionEnumerator GetEnumerator()
Returns
Int32CollectionEnumerator
 IndexOf(int)
public virtual int IndexOf(int value)
Parameters
value int
Returns
int
 Insert(int, int)
public virtual void Insert(int index, int value)
Parameters
index int
value int
 Remove(int)
public virtual void Remove(int value)
Parameters
value int
 RemoveAt(int)
public virtual void RemoveAt(int index)
Parameters
index int
 ToArray()
public virtual int[] ToArray()
Returns
int[]
 TrimToSize()
public virtual void TrimToSize()