Table of Contents
 Class TextEditorCursor
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbTextEditorCursor")]
public class TextEditorCursor : TextEditorSelectionbase, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
TextEditorSelectionbase
TextEditorCursor
Implements
IDisposable
Inherited Members
 TextEditorSelectionbase.InsertSymbol(char, int)
 TextEditorSelectionbase.InsertString(string)
 TextEditorSelectionbase.InsertImportedText(TextEditorSelectionbase.InsertTextType, byte[])
 TextEditorSelectionbase.InputSpecialChar(char)
 TextEditorSelectionbase.InsertColumnBreak()
 TextEditorSelectionbase.MaxWidthScale
 TextEditorSelectionbase.MinWidthScale
 TextEditorSelectionbase.MaxTrackingFactor
 TextEditorSelectionbase.MinTrackingFactor
 TextEditorSelectionbase.MaxObliqueAngle
 TextEditorSelectionbase.MinObliqueAngle
 TextEditorSelectionbase.FlowAlignment
 TextEditorSelectionbase.WidthScale
 TextEditorSelectionbase.TrackingFactor
 TextEditorSelectionbase.ObliqueAngle
 TextEditorSelectionbase.Strikethrough
 TextEditorSelectionbase.Overline
 TextEditorSelectionbase.Underline
 TextEditorSelectionbase.Color
 TextEditorSelectionbase.Height
 TextEditorSelectionbase.Italic
 TextEditorSelectionbase.Bold
 TextEditorSelectionbase.Font
 TextEditorSelectionbase.Language
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Column
public TextEditorColumn Column { get; }
Property Value
TextEditorColumn
 Location
public TextEditorLocation Location { get; set; }
Property Value
TextEditorLocation
 Paragraph
public TextEditorParagraph Paragraph { get; }
Property Value
TextEditorParagraph
Methods
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()