Table of Contents
 Struct Vector2d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeVector2d")]
public struct Vector2d : IFormattable
Implements
IFormattable
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 Vector2d(double, double)
public Vector2d(double x, double y)
Parameters
x double
y double
 Vector2d(double[])
public Vector2d(double[] A_0)
Parameters
A_0 double[]
Properties
 Angle
public double Angle { get; }
Property Value
double
 this[int]
public double this[int A_0] { get; }
Parameters
A_0 int
Property Value
double
 Length
public double Length { get; }
Property Value
double
 LengthSqrd
public double LengthSqrd { get; }
Property Value
double
 X
public double X { get; }
Property Value
double
 XAxis
public static Vector2d XAxis { get; }
Property Value
Vector2d
 Y
public double Y { get; }
Property Value
double
 YAxis
public static Vector2d YAxis { get; }
Property Value
Vector2d
Methods
 Add(Vector2d)
public Vector2d Add(Vector2d v)
Parameters
v Vector2d
Returns
Vector2d
 DivideBy(double)
public Vector2d DivideBy(double value)
Parameters
value double
Returns
Vector2d
 DotProduct(Vector2d)
public double DotProduct(Vector2d v)
Parameters
v Vector2d
Returns
double
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetAngleTo(Vector2d)
public double GetAngleTo(Vector2d vector)
Parameters
vector Vector2d
Returns
double
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 GetNormal()
public Vector2d GetNormal()
Returns
Vector2d
 GetNormal(Tolerance)
public Vector2d GetNormal(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
Vector2d
 GetPerpendicularVector()
public Vector2d GetPerpendicularVector()
Returns
Vector2d
 IsCodirectionalTo(Vector2d)
public bool IsCodirectionalTo(Vector2d vector)
Parameters
vector Vector2d
Returns
bool
 IsCodirectionalTo(Vector2d, Tolerance)
public bool IsCodirectionalTo(Vector2d vector, Tolerance tolerance)
Parameters
vector Vector2d
tolerance Tolerance
Returns
bool
 IsEqualTo(Vector2d)
public bool IsEqualTo(Vector2d vector)
Parameters
vector Vector2d
Returns
bool
 IsEqualTo(Vector2d, Tolerance)
public bool IsEqualTo(Vector2d vector, Tolerance tolerance)
Parameters
vector Vector2d
tolerance Tolerance
Returns
bool
 IsParallelTo(Vector2d)
public bool IsParallelTo(Vector2d vector)
Parameters
vector Vector2d
Returns
bool
 IsParallelTo(Vector2d, Tolerance)
public bool IsParallelTo(Vector2d vector, Tolerance tolerance)
Parameters
vector Vector2d
tolerance Tolerance
Returns
bool
 IsPerpendicularTo(Vector2d)
public bool IsPerpendicularTo(Vector2d vector)
Parameters
vector Vector2d
Returns
bool
 IsPerpendicularTo(Vector2d, Tolerance)
public bool IsPerpendicularTo(Vector2d vector, Tolerance tolerance)
Parameters
vector Vector2d
tolerance Tolerance
Returns
bool
 IsUnitLength()
public bool IsUnitLength()
Returns
bool
 IsUnitLength(Tolerance)
public bool IsUnitLength(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 IsZeroLength()
public bool IsZeroLength()
Returns
bool
 IsZeroLength(Tolerance)
public bool IsZeroLength(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 Mirror(Vector2d)
public Vector2d Mirror(Vector2d line)
Parameters
line Vector2d
Returns
Vector2d
 MultiplyBy(double)
public Vector2d MultiplyBy(double value)
Parameters
value double
Returns
Vector2d
 Negate()
public Vector2d Negate()
Returns
Vector2d
 RotateBy(double)
public Vector2d RotateBy(double angle)
Parameters
angle double
Returns
Vector2d
 Subtract(Vector2d)
public Vector2d Subtract(Vector2d v)
Parameters
v Vector2d
Returns
Vector2d
 ToArray()
public double[] ToArray()
Returns
double[]
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
 ToString(string, IFormatProvider)
public string ToString(string format, IFormatProvider provider)
Parameters
format string
provider IFormatProvider
Returns
string
 TransformBy(Matrix2d)
public Vector2d TransformBy(Matrix2d leftSide)
Parameters
leftSide Matrix2d
Returns
Vector2d
Operators
 operator +(Vector2d, Vector2d)
public static Vector2d operator +(Vector2d a, Vector2d b)
Parameters
a Vector2d
b Vector2d
Returns
Vector2d
 operator /(Vector2d, double)
public static Vector2d operator /(Vector2d a, double factor)
Parameters
a Vector2d
factor double
Returns
Vector2d
 operator ==(Vector2d, Vector2d)
public static bool operator ==(Vector2d a, Vector2d b)
Parameters
a Vector2d
b Vector2d
Returns
bool
 operator !=(Vector2d, Vector2d)
public static bool operator !=(Vector2d a, Vector2d b)
Parameters
a Vector2d
b Vector2d
Returns
bool
 operator *(Matrix2d, Vector2d)
public static Vector2d operator *(Matrix2d a, Vector2d b)
Parameters
a Matrix2d
b Vector2d
Returns
Vector2d
 operator *(Vector2d, double)
public static Vector2d operator *(Vector2d a, double factor)
Parameters
a Vector2d
factor double
Returns
Vector2d
 operator *(double, Vector2d)
public static Vector2d operator *(double factor, Vector2d a)
Parameters
factor double
a Vector2d
Returns
Vector2d
 operator -(Vector2d, Vector2d)
public static Vector2d operator -(Vector2d a, Vector2d b)
Parameters
a Vector2d
b Vector2d
Returns
Vector2d
 operator -(Vector2d)
public static Vector2d operator -(Vector2d a)
Parameters
a Vector2d
Returns
Vector2d