Table of Contents
 Class IntPtrCollection
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeIntPtrArray")]
public class IntPtrCollection : IList, ICollection, IEnumerable
Inheritance
object
IntPtrCollection
Implements
IList
ICollection
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 IntPtrCollection()
public IntPtrCollection()
 IntPtrCollection(int)
public IntPtrCollection(int capacity)
Parameters
capacity int
 IntPtrCollection(IntPtr[])
public IntPtrCollection(IntPtr[] values)
Parameters
values IntPtr[]
Fields
 DefaultSize
public const int DefaultSize = 10
Field Value
int
Properties
 Capacity
public virtual int Capacity { get; set; }
Property Value
int
 Count
public virtual int Count { get; }
Property Value
int
 IsFixedSize
public virtual bool IsFixedSize { get; }
Property Value
bool
 IsReadOnly
public virtual bool IsReadOnly { get; }
Property Value
bool
 IsSynchronized
public virtual bool IsSynchronized { get; }
Property Value
bool
 this[int]
public virtual IntPtr this[int index] { get; set; }
Parameters
index int
Property Value
IntPtr
 SyncRoot
public virtual object SyncRoot { get; }
Property Value
object
Methods
 Add(IntPtr)
public virtual int Add(IntPtr value)
Parameters
value IntPtr
Returns
int
 AddRange(IntPtr[])
public virtual void AddRange(IntPtr[] range)
Parameters
range IntPtr[]
 Clear()
public virtual void Clear()
 Contains(IntPtr)
public virtual bool Contains(IntPtr value)
Parameters
value IntPtr
Returns
bool
 CopyTo(IntPtr[], int)
public virtual void CopyTo(IntPtr[] array, int index)
Parameters
array IntPtr[]
index int
 GetEnumerator()
public virtual IntPtrCollectionEnumerator GetEnumerator()
Returns
IntPtrCollectionEnumerator
 IndexOf(IntPtr)
public virtual int IndexOf(IntPtr value)
Parameters
value IntPtr
Returns
int
 Insert(int, IntPtr)
public virtual void Insert(int index, IntPtr value)
Parameters
index int
value IntPtr
 Remove(IntPtr)
public virtual void Remove(IntPtr value)
Parameters
value IntPtr
 RemoveAt(int)
public virtual void RemoveAt(int index)
Parameters
index int
 ToArray()
public virtual IntPtr[] ToArray()
Returns
IntPtr[]
 TrimToSize()
public virtual void TrimToSize()