Table of Contents
 Class DynamicDimensionData
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDimData")]
public sealed class DynamicDimensionData : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
DynamicDimensionData
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DynamicDimensionData()
public DynamicDimensionData()
 DynamicDimensionData(Dimension)
public DynamicDimensionData(Dimension dimension)
Parameters
dimension Dimension
 DynamicDimensionData(Dimension, bool)
public DynamicDimensionData(Dimension dimension, bool editable)
Parameters
dimension Dimension
editable bool
 DynamicDimensionData(Dimension, bool, bool)
public DynamicDimensionData(Dimension dimension, bool editable, bool hideIfValueIsZero)
Parameters
dimension Dimension
editable bool
hideIfValueIsZero bool
Properties
 ApplicationData
public object ApplicationData { get; set; }
Property Value
object
 Dimension
public Dimension Dimension { get; set; }
Property Value
Dimension
 Editable
public bool Editable { get; set; }
Property Value
bool
 Focal
public bool Focal { get; set; }
Property Value
bool
 HideIfValueIsZero
public bool HideIfValueIsZero { get; set; }
Property Value
bool
 Visible
public bool Visible { get; set; }
Property Value
bool
Methods
 Create(IntPtr, bool)
public static DynamicDimensionData Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
DynamicDimensionData
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()