Table of Contents
 Struct Solid3dMassProperties
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct Solid3dMassProperties
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 Solid3dMassProperties(int)
public Solid3dMassProperties(int dummy)
Parameters
dummy int
Properties
 Centroid
public Point3d Centroid { get; }
Property Value
Point3d
 Extents
public Extents3d Extents { get; }
Property Value
Extents3d
 MomentsOfIntertia
public Vector3d MomentsOfIntertia { get; }
Property Value
Vector3d
 this[int]
public Vector3d this[int c] { get; }
Parameters
c int
Property Value
Vector3d
 PrincipalMoments
public Vector3d PrincipalMoments { get; }
Property Value
Vector3d
 ProductsOfIntertia
public Vector3d ProductsOfIntertia { get; }
Property Value
Vector3d
 RadiiOfGyration
public Vector3d RadiiOfGyration { get; }
Property Value
Vector3d
 Volume
[UnitType(UnitType.Volume)]
public double Volume { get; }
Property Value
double