Table of Contents
 Struct SpatialFilterVolume
Namespace
Autodesk.AutoCAD.DatabaseServices.Filters
Assembly
Acdbmgd.dll
public struct SpatialFilterVolume
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 SpatialFilterVolume(Point3d, Point3d, Vector3d, Vector2d)
public SpatialFilterVolume(Point3d fromPoint, Point3d toPoint, Vector3d upDir, Vector2d viewField)
Parameters
fromPoint Point3d
toPoint Point3d
upDir Vector3d
viewField Vector2d
Properties
 FromPoint
public Point3d FromPoint { get; }
Property Value
Point3d
 ToPoint
public Point3d ToPoint { get; }
Property Value
Point3d
 UpDirection
public Vector3d UpDirection { get; }
Property Value
Vector3d
 ViewField
public Vector2d ViewField { get; }
Property Value
Vector2d