Table of Contents
 Class LoftProfile
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbLoftProfile")]
public class LoftProfile : Profile3d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Profile3d
LoftProfile
Implements
IDisposable
ICloneable
Inherited Members
 Profile3d.ConvertProfile(PathRef[])
 Profile3d.ConvertProfile(bool, bool, bool, bool)
 Profile3d.MergeProfiles(Profile3d[], bool, bool)
 Profile3d.IsValid
 Profile3d.IsEdge
 Profile3d.IsFace
 Profile3d.IsSubent
 Profile3d.IsPlanar
 Profile3d.IsClosed
 Profile3d.ProfileVertexRef
 Profile3d.ProfilePathRef
 Profile3d.Entity
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 LoftProfile()
public LoftProfile()
 LoftProfile(Entity)
public LoftProfile(Entity entity)
Parameters
entity Entity
 LoftProfile(LoftProfile)
public LoftProfile(LoftProfile LoftProfile)
Parameters
LoftProfile LoftProfile
 LoftProfile(PathRef)
public LoftProfile(PathRef pathRef)
Parameters
pathRef PathRef
 LoftProfile(Point3d)
public LoftProfile(Point3d pnt)
Parameters
pnt Point3d
 LoftProfile(IntPtr, bool)
protected LoftProfile(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 Continuity
public short Continuity { get; set; }
Property Value
short
 Magnitude
public double Magnitude { get; set; }
Property Value
double
Methods
 CopyFrom(LoftProfile)
public void CopyFrom(LoftProfile source)
Parameters
source LoftProfile
 CopyFrom(Profile3d)
public void CopyFrom(Profile3d source)
Parameters
source Profile3d