Table of Contents
 Enum RapidRTQuitCondition
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiQuitCondition")]
public enum RapidRTQuitCondition
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ERenderLevel = 0
ERenderTime = 1