Table of Contents
 Class EntityAlignmentEventArgs
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class EntityAlignmentEventArgs : EventArgs
Inheritance
object
EventArgs
EntityAlignmentEventArgs
Inherited Members
 EventArgs.Empty
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 EntityAlignmentEventArgs(Entity, Point3d, Vector3d, Point3d, Vector3d, FullSubentityPath[])
public EntityAlignmentEventArgs(Entity Entity, Point3d PickPoint, Vector3d Normal, Point3d ClosestPoint, Vector3d Direction, FullSubentityPath[] Path)
Parameters
Entity Entity
PickPoint Point3d
Normal Vector3d
ClosestPoint Point3d
Direction Vector3d
Path FullSubentityPath[]
Properties
 ClosestPoint
public Point3d ClosestPoint { get; set; }
Property Value
Point3d
 Direction
public Vector3d Direction { get; set; }
Property Value
Vector3d
 Entity
public Entity Entity { get; }
Property Value
Entity
 Normal
public Vector3d Normal { get; }
Property Value
Vector3d
 PickPoint
public Point3d PickPoint { get; }
Property Value
Point3d
Methods
 GetPickedEntities()
public FullSubentityPath[] GetPickedEntities()
Returns
FullSubentityPath[]