Table of Contents
 Struct TextEditorParagraphTab
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct TextEditorParagraphTab
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 TextEditorParagraphTab()
public TextEditorParagraphTab()
Properties
 DecimalChar
public char DecimalChar { get; set; }
Property Value
char
 Offset
public double Offset { get; set; }
Property Value
double
 Type
public TextEditorParagraphTab.ParagraphTabType Type { get; set; }
Property Value
TextEditorParagraphTab.ParagraphTabType