Table of Contents
 Enum GsMarkType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMLeader::gsMarkType")]
public enum GsMarkType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ArrowMark = 1
BlockMark = 15004
DoglegMark = 10001
LeaderLineMark = 5001
MTextMark = 15001
MTextUnderLineMark = 15002
None = 0
ToleranceMark = 15003