Table of Contents
 Class Overrule
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
[Wrapper("AcRxOverrule")]
public abstract class Overrule : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Overrule
Implements
IDisposable
ICloneable
Derived
DimensionStyleOverrule
GeometryOverrule
GripOverrule
HighlightOverrule
HighlightStateOverrule
ObjectOverrule
OsnapOverrule
PropertiesOverrule
SubentityOverrule
TransformOverrule
VisibilityOverrule
DrawableOverrule
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Overruling
public static bool Overruling { get; set; }
Property Value
bool
Methods
 AddOverrule(RXClass, Overrule, bool)
public static void AddOverrule(RXClass targetClass, Overrule overrule, bool bAtLast)
Parameters
targetClass RXClass
overrule Overrule
bAtLast bool
 HasOverrule(RXObject, RXClass)
public static bool HasOverrule(RXObject overruledSubject, RXClass targetClass)
Parameters
overruledSubject RXObject
targetClass RXClass
Returns
bool
 IsApplicable(RXObject)
public virtual bool IsApplicable(RXObject overruledSubject)
Parameters
overruledSubject RXObject
Returns
bool
 RemoveOverrule(RXClass, Overrule)
public static void RemoveOverrule(RXClass targetClass, Overrule overrule)
Parameters
targetClass RXClass
overrule Overrule
 SetCustomFilter()
public abstract void SetCustomFilter()
 SetExtensionDictionaryEntryFilter(string)
public abstract void SetExtensionDictionaryEntryFilter(string entryName)
Parameters
entryName string
 SetIdFilter(ObjectId[])
public abstract void SetIdFilter(ObjectId[] ids)
Parameters
ids ObjectId[]
 SetNoFilter()
public abstract void SetNoFilter()
 SetXDataFilter(string)
public abstract void SetXDataFilter(string registeredApplicationName)
Parameters
registeredApplicationName string