Table of Contents
 Struct GeoDataLonLatAltInfo
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public struct GeoDataLonLatAltInfo
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 GeoDataLonLatAltInfo(double, double, double)
public GeoDataLonLatAltInfo(double dbLong, double dbLat, double dbAlt)
Parameters
dbLong double
dbLat double
dbAlt double
Properties
 Altitude
public double Altitude { get; set; }
Property Value
double
 Latitude
public double Latitude { get; set; }
Property Value
double
 Longitude
public double Longitude { get; set; }
Property Value
double