Table of Contents
 Enum FieldEvaluationStatus
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum FieldEvaluationStatus
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
EvaluatorNotFound = 4
InvalidCode = 16
InvalidContext = 32
NotYetEvaluated = 1
OtherError = 64
Success = 2
SyntaxError = 8