Table of Contents
 Class MaterialMap
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiMaterialMap")]
public sealed class MaterialMap : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
MaterialMap
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 MaterialMap()
public MaterialMap()
 MaterialMap(Source, MaterialTexture, double, Mapper)
public MaterialMap(Source source, MaterialTexture pTexture, double blendFactor, Mapper mapper)
Parameters
source Source
pTexture MaterialTexture
blendFactor double
mapper Mapper
 MaterialMap(Source, MaterialTexture, double, Mapper, MapFilter)
public MaterialMap(Source source, MaterialTexture pTexture, double blendFactor, Mapper mapper, MapFilter filter)
Parameters
source Source
pTexture MaterialTexture
blendFactor double
mapper Mapper
filter MapFilter
 MaterialMap(Source, string, MaterialTexture, double, Mapper)
[Obsolete("Use an alternate constructor for MaterialMap.")]
public MaterialMap(Source source, string fileName, MaterialTexture pTexture, double blendFactor, Mapper mapper)
Parameters
source Source
fileName string
pTexture MaterialTexture
blendFactor double
mapper Mapper
Properties
 BlendFactor
public double BlendFactor { get; }
Property Value
double
 Filter
public MapFilter Filter { get; }
Property Value
MapFilter
 Mapper
public Mapper Mapper { get; }
Property Value
Mapper
 Source
public Source Source { get; }
Property Value
Source
 SourceFileName
[Obsolete("Use Texture property, and if type is ImageFileTexture, use its SourceFileName property.")]
public string SourceFileName { get; }
Property Value
string
 Texture
public MaterialTexture Texture { get; }
Property Value
MaterialTexture
Methods
 Equals(object)
public override sealed bool Equals(object other)
Parameters
other object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
Operators
 operator ==(MaterialMap, MaterialMap)
public static bool operator ==(MaterialMap lhs, MaterialMap rhs)
Parameters
lhs MaterialMap
rhs MaterialMap
Returns
bool
 operator !=(MaterialMap, MaterialMap)
public static bool operator !=(MaterialMap lhs, MaterialMap rhs)
Parameters
lhs MaterialMap
rhs MaterialMap
Returns
bool