Table of Contents
 Enum JoinStyle
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::JoinStyle")]
public enum JoinStyle
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
StyleAngle = 2
StyleFlat = 3
StyleNone = 0
StyleRound = 1