Table of Contents
 Enum GripMode.CursorType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum GripMode.CursorType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CursorCrosshairAngle = 5
CursorCrosshairCurve = 3
CursorCrosshairLine = 4
CursorCrosshairMinus = 2
CursorCrosshairPlus = 1
CursorNone = 0