Table of Contents
 Struct SurfaceSliceResults
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct SurfaceSliceResults
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 SurfaceSliceResults(Surface, Surface)
public SurfaceSliceResults(Surface negativeHalfSurface, Surface newSurface)
Parameters
negativeHalfSurface Surface
newSurface Surface
Properties
 NegativeHalfSurface
public Surface NegativeHalfSurface { get; set; }
Property Value
Surface
 NewSurface
public Surface NewSurface { get; set; }
Property Value
Surface