Table of Contents
 Class SubEntityTraits
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiSubEntityTraits")]
public abstract class SubEntityTraits : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
SubEntityTraits
Implements
IDisposable
ICloneable
Derived
DrawableTraits
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 SubEntityTraits()
protected SubEntityTraits()
Properties
 Color
public abstract short Color { get; set; }
Property Value
short
 DrawFlags
public abstract int DrawFlags { get; set; }
Property Value
int
 Fill
public abstract Fill Fill { get; set; }
Property Value
Fill
 FillType
public abstract FillType FillType { get; set; }
Property Value
FillType
 Layer
public abstract ObjectId Layer { get; set; }
Property Value
ObjectId
 LineType
public abstract ObjectId LineType { get; set; }
Property Value
ObjectId
 LineTypeScale
public abstract double LineTypeScale { get; set; }
Property Value
double
 LineWeight
public abstract LineWeight LineWeight { get; set; }
Property Value
LineWeight
 Mapper
public abstract Mapper Mapper { get; set; }
Property Value
Mapper
 Material
public abstract ObjectId Material { get; set; }
Property Value
ObjectId
 PlotStyleDescriptor
public abstract PlotStyleDescriptor PlotStyleDescriptor { get; set; }
Property Value
PlotStyleDescriptor
 Sectionable
public abstract bool Sectionable { get; set; }
Property Value
bool
 SelectionOnlyGeometry
public abstract bool SelectionOnlyGeometry { get; set; }
Property Value
bool
 ShadowFlags
public abstract ShadowFlags ShadowFlags { get; set; }
Property Value
ShadowFlags
 Thickness
public abstract double Thickness { get; set; }
Property Value
double
 Transparency
public abstract Transparency Transparency { get; set; }
Property Value
Transparency
 TrueColor
public abstract EntityColor TrueColor { get; set; }
Property Value
EntityColor
 VisualStyle
public abstract ObjectId VisualStyle { get; set; }
Property Value
ObjectId
Methods
 SetSelectionMarker(IntPtr)
public abstract void SetSelectionMarker(IntPtr markerId)
Parameters
markerId IntPtr