Table of Contents
 Enum CellType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDataCell::CellType")]
[TypeConverter(typeof(EnumConverter))]
public enum CellType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Bool = 10
CharPtr = 3
Double = 2
HardOwnerId = 6
HardPtrId = 8
Integer = 1
ObjectId = 5
Point = 4
SoftOwnerId = 7
SoftPtrId = 9
Unknown = 0
Vector = 11