Table of Contents
 Struct GradientColor
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct GradientColor
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 GradientColor(Color, float)
public GradientColor(Color color, float value)
Parameters
color Color
value float
Methods
 get_Color()
public Color get_Color()
Returns
Color
 get_Value()
public float get_Value()
Returns
float