Table of Contents
 Struct Matrix2dInfo
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public struct Matrix2dInfo
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Properties
 Angle
public double Angle { get; }
Property Value
double
 IsMirror
public bool IsMirror { get; }
Property Value
bool
 Reflex
public Vector2d Reflex { get; }
Property Value
Vector2d
 Scale
public double Scale { get; }
Property Value
double
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 IsEqualTo(Matrix2dInfo)
public bool IsEqualTo(Matrix2dInfo a)
Parameters
a Matrix2dInfo
Returns
bool
 IsEqualTo(Matrix2dInfo, Tolerance)
public bool IsEqualTo(Matrix2dInfo a, Tolerance tolerance)
Parameters
a Matrix2dInfo
tolerance Tolerance
Returns
bool
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
Operators
 operator ==(Matrix2dInfo, Matrix2dInfo)
public static bool operator ==(Matrix2dInfo a, Matrix2dInfo b)
Parameters
a Matrix2dInfo
b Matrix2dInfo
Returns
bool
 operator !=(Matrix2dInfo, Matrix2dInfo)
public static bool operator !=(Matrix2dInfo a, Matrix2dInfo b)
Parameters
a Matrix2dInfo
b Matrix2dInfo
Returns
bool