Table of Contents
 Enum Unit
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbRasterImageDef::Units")]
public enum Unit
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Angstroms = 11
Astronomical = 18
Centimeter = 2
Decimeters = 14
Dekameters = 15
Foot = 6
GigaMeters = 17
Hectometers = 16
Inch = 5
Kilometer = 4
LightYears = 19
Meter = 3
Microinches = 9
Microns = 13
Mile = 8
Millimeter = 1
Mils = 10
Nanometers = 12
None = 0
Parsecs = 20
Yard = 7