Table of Contents
 Enum GeoCSType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbGeoCoordinateSystem::Type")]
public enum GeoCSType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Arbitrary = 1
Geographic = 2
Projected = 3
Unknown = 0