Table of Contents
 Enum LayerEvaluation
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcDb::LayerEvaluation")]
public enum LayerEvaluation
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
EvalAllNewLayers = 2
EvalNewXrefLayers = 1
NoNewLayerEvaluation = 0