Table of Contents
 Struct SectionHitTestInfo
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct SectionHitTestInfo
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 SectionHitTestInfo()
public SectionHitTestInfo()
Properties
 Index
public int Index { get; }
Property Value
int
 PtOnSegment
public Point3d PtOnSegment { get; }
Property Value
Point3d
 SubItem
public SectionSubItem SubItem { get; }
Property Value
SectionSubItem