Table of Contents
 Class AssocDependency
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocDependency")]
public class AssocDependency : DBObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
AssocDependency
Implements
IDisposable
ICloneable
Derived
AssocGeomDependency
AssocValueDependency
Inherited Members
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocDependency()
public AssocDependency()
 AssocDependency(IntPtr, bool)
protected AssocDependency(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 CurrentEvaluationCallback
public AssocEvaluationCallback CurrentEvaluationCallback { get; }
Property Value
AssocEvaluationCallback
 DependencyBody
public ObjectId DependencyBody { get; set; }
Property Value
ObjectId
 DependentOnCompoundObject
public CompoundObjectId DependentOnCompoundObject { get; }
Property Value
CompoundObjectId
 DependentOnObject
public ObjectId DependentOnObject { get; }
Property Value
ObjectId
 DependentOnObjectStatus
public ErrorStatus DependentOnObjectStatus { get; }
Property Value
ErrorStatus
 HasCachedValue
public bool HasCachedValue { get; }
Property Value
bool
 IsActionEvaluationInProgress
public bool IsActionEvaluationInProgress { get; }
Property Value
bool
 IsAttachedToObject
public bool IsAttachedToObject { get; }
Property Value
bool
 IsDelegatingToOwningAction
public bool IsDelegatingToOwningAction { get; set; }
Property Value
bool
 IsDependentOnCompoundObject
public bool IsDependentOnCompoundObject { get; }
Property Value
bool
 IsDependentOnObjectReadOnly
public bool IsDependentOnObjectReadOnly { get; }
Property Value
bool
 IsObjectStateDependent
public bool IsObjectStateDependent { get; set; }
Property Value
bool
 IsReadDependency
public bool IsReadDependency { get; set; }
Property Value
bool
 IsRelevantChange
public bool IsRelevantChange { get; }
Property Value
bool
 IsWriteDependency
public bool IsWriteDependency { get; set; }
Property Value
bool
 NextDependencyOnObject
public ObjectId NextDependencyOnObject { get; }
Property Value
ObjectId
 Order
public int Order { get; set; }
Property Value
int
 OwningAction
public ObjectId OwningAction { get; set; }
Property Value
ObjectId
 PrevDependencyOnObject
public ObjectId PrevDependencyOnObject { get; }
Property Value
ObjectId
 Status
public AssocStatus Status { get; set; }
Property Value
AssocStatus
Methods
 AttachToObject(CompoundObjectId)
public void AttachToObject(CompoundObjectId compoundId)
Parameters
compoundId CompoundObjectId
 DetachFromObject()
public void DetachFromObject()
 Evaluate()
public void Evaluate()
 GetDependenciesOnObject(DBObject, bool, bool)
public static ObjectIdCollection GetDependenciesOnObject(DBObject dbObj, bool readDependenciesWanted, bool writeDependenciesWanted)
Parameters
dbObj DBObject
readDependenciesWanted bool
writeDependenciesWanted bool
Returns
ObjectIdCollection
 GetFirstDependencyOnObject(DBObject)
public static ObjectId GetFirstDependencyOnObject(DBObject dbObj)
Parameters
dbObj DBObject
Returns
ObjectId
 IsDependentOnTheSameThingAs(AssocDependency)
public bool IsDependentOnTheSameThingAs(AssocDependency otherDependency)
Parameters
otherDependency AssocDependency
Returns
bool
 IsEqualTo(AssocDependency)
public bool IsEqualTo(AssocDependency otherDependency)
Parameters
otherDependency AssocDependency
Returns
bool
 NotifyDependenciesOnObject(DBObject, AssocStatus)
public static void NotifyDependenciesOnObject(DBObject dbObj, AssocStatus newStatus)
Parameters
dbObj DBObject
newStatus AssocStatus
 SetDependentOnObject(CompoundObjectId)
public void SetDependentOnObject(CompoundObjectId compoundId)
Parameters
compoundId CompoundObjectId
 SetStatus(AssocStatus, bool)
public void SetStatus(AssocStatus newStatus, bool notifyOwningNetwork)
Parameters
newStatus AssocStatus
notifyOwningNetwork bool
 UpdateDependentOnObject()
public void UpdateDependentOnObject()