Table of Contents
 Enum CompoundObjectId.StatusType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum CompoundObjectId.StatusType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CouldNotResolveNonTerminal = 2
CouldNotResolveTerminal = 3
CouldNotResolveTooEarly = 4
IncompatibleIdType = 1000
Valid = 0
WasLoadedNowUnloaded = 1