Table of Contents
 Class Entity2d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeEntity2d")]
public abstract class Entity2d : DisposableWrapper, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity2d
Implements
IDisposable
ICloneable
Derived
BoundBlock2d
ClipBoundary2d
Curve2d
CurveCurveIntersector2d
PointEntity2d
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Methods
 Clone()
public virtual object Clone()
Returns
object
 Create(IntPtr, bool)
public static Entity2d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
Entity2d
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 IsEqualTo(Entity2d)
public bool IsEqualTo(Entity2d entity)
Parameters
entity Entity2d
Returns
bool
 IsEqualTo(Entity2d, Tolerance)
public bool IsEqualTo(Entity2d entity, Tolerance tolerance)
Parameters
entity Entity2d
tolerance Tolerance
Returns
bool
 IsOn(Point2d)
public bool IsOn(Point2d point)
Parameters
point Point2d
Returns
bool
 IsOn(Point2d, Tolerance)
public bool IsOn(Point2d point, Tolerance tolerance)
Parameters
point Point2d
tolerance Tolerance
Returns
bool
 Mirror(Line2d)
public void Mirror(Line2d line)
Parameters
line Line2d
 RotateBy(double, Point2d)
public void RotateBy(double angle, Point2d point)
Parameters
angle double
point Point2d
 ScaleBy(double, Point2d)
public void ScaleBy(double scaleFactor, Point2d point)
Parameters
scaleFactor double
point Point2d
 TransformBy(Matrix2d)
public void TransformBy(Matrix2d transform)
Parameters
transform Matrix2d
 TranslateBy(Vector2d)
public void TranslateBy(Vector2d translateVector)
Parameters
translateVector Vector2d