Table of Contents
 Struct FitData
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct FitData
Inherited Members
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 FitData()
public FitData()
Properties
 Degree
public int Degree { get; set; }
Property Value
int
 EndTangent
public Vector3d EndTangent { get; set; }
Property Value
Vector3d
 FitTolerance
[UnitType(UnitType.Distance)]
public double FitTolerance { get; set; }
Property Value
double
 KnotParam
public KnotParameterizationEnum KnotParam { get; set; }
Property Value
KnotParameterizationEnum
 Periodic
public bool Periodic { get; set; }
Property Value
bool
 StartTangent
public Vector3d StartTangent { get; set; }
Property Value
Vector3d
 TangentsExist
public bool TangentsExist { get; set; }
Property Value
bool
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetFitPoints()
public Point3dCollection GetFitPoints()
Returns
Point3dCollection
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 IsEqualTo(FitData)
public bool IsEqualTo(FitData other)
Parameters
other FitData
Returns
bool
 IsEqualTo(FitData, Tolerance)
public bool IsEqualTo(FitData other, Tolerance tolerance)
Parameters
other FitData
tolerance Tolerance
Returns
bool
Operators
 operator ==(FitData, FitData)
public static bool operator ==(FitData a, FitData b)
Parameters
a FitData
b FitData
Returns
bool
 operator !=(FitData, FitData)
public static bool operator !=(FitData a, FitData b)
Parameters
a FitData
b FitData
Returns
bool