Table of Contents
 Class TableTemplate
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbTableTemplate")]
public class TableTemplate : TableContent, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
LinkedData
LinkedTableData
FormattedTableData
TableContent
TableTemplate
Implements
IDisposable
ICloneable
Inherited Members
 TableContent.GetCellStyle(int, int)
 TableContent.SetCellStyle(int, int, string)
 TableContent.GetRowHeight(int)
 TableContent.SetRowHeight(int, double)
 TableContent.GetColumnWidth(int)
 TableContent.SetColumnWidth(int, double)
 TableContent.TableStyleId
 FormattedTableData.Create(IntPtr, bool)
 FormattedTableData.IsFormatEditable(int, int)
 FormattedTableData.GetRotation(int, int)
 FormattedTableData.SetRotation(int, int, double)
 FormattedTableData.GetScale(int, int)
 FormattedTableData.SetScale(int, int, double)
 FormattedTableData.GetAlignment(int, int)
 FormattedTableData.SetAlignment(int, int, CellAlignment)
 FormattedTableData.GetContentColor(int, int)
 FormattedTableData.SetContentColor(int, int, Color)
 FormattedTableData.GetBackgroundColor(int, int)
 FormattedTableData.SetBackgroundColor(int, int, Color)
 FormattedTableData.GetTextStyle(int, int)
 FormattedTableData.SetTextStyle(int, int, ObjectId)
 FormattedTableData.GetTextHeight(int, int)
 FormattedTableData.SetTextHeight(int, int, double)
 FormattedTableData.GetMargin(int, int, CellMargins)
 FormattedTableData.SetMargin(int, int, CellMargins, double)
 FormattedTableData.GetGridColor(int, int, GridLineType)
 FormattedTableData.SetGridColor(int, int, GridLineType, Color)
 FormattedTableData.GetGridLineWeight(int, int, GridLineType)
 FormattedTableData.SetGridLineWeight(int, int, GridLineType, LineWeight)
 FormattedTableData.GetGridLinetype(int, int, GridLineType)
 FormattedTableData.SetGridLinetype(int, int, GridLineType, ObjectId)
 FormattedTableData.GetGridVisibility(int, int, GridLineType)
 FormattedTableData.SetGridVisibility(int, int, GridLineType, Visibility)
 FormattedTableData.GetOverride(int, int, GridLineType)
 FormattedTableData.GetOverride(int, int, int)
 FormattedTableData.SetOverride(int, int, GridLineType, GridProperties)
 FormattedTableData.SetOverride(int, int, int, CellProperties)
 FormattedTableData.RemoveAllOverrides(int, int)
 FormattedTableData.Merge(CellRange)
 FormattedTableData.Unmerge(CellRange)
 FormattedTableData.IsMerged(int, int)
 FormattedTableData.GetMergeRange(int, int)
 LinkedTableData.GetEnumerator(TableEnumeratorOption)
 LinkedTableData.GetEnumerator()
 LinkedTableData.SetSize(int, int)
 LinkedTableData.GetColumnName(int)
 LinkedTableData.SetColumnName(int, string)
 LinkedTableData.AppendColumn(int)
 LinkedTableData.InsertColumn(int, int)
 LinkedTableData.DeleteColumn(int, int)
 LinkedTableData.AppendRow(int)
 LinkedTableData.InsertRow(int, int)
 LinkedTableData.DeleteRow(int, int)
 LinkedTableData.DeleteContent(int, int)
 LinkedTableData.GetContentTypes(int, int)
 LinkedTableData.IsContentEditable(int, int)
 LinkedTableData.GetCellState(int, int)
 LinkedTableData.SetCellState(int, int, CellStates)
 LinkedTableData.DataType(int, int)
 LinkedTableData.UnitType(int, int)
 LinkedTableData.SetDataType(int, int, DataType, UnitType)
 LinkedTableData.GetDataFormat(int, int)
 LinkedTableData.SetDataFormat(int, int, string)
 LinkedTableData.GetValue(int, int, int, FormatOption)
 LinkedTableData.GetValue(int, int)
 LinkedTableData.SetValue(int, int, int, object, ParseOption)
 LinkedTableData.SetValue(int, int, object)
 LinkedTableData.GetFieldId(int, int)
 LinkedTableData.SetFieldId(int, int, ObjectId)
 LinkedTableData.GetBlockTableRecordId(int, int)
 LinkedTableData.SetBlockTableRecordId(int, int, ObjectId)
 LinkedTableData.GetBlockAttributeValue(int, int, ObjectId)
 LinkedTableData.SetBlockAttributeValue(int, int, ObjectId, string)
 LinkedTableData.GetToolTip(int, int)
 LinkedTableData.SetToolTip(int, int, string)
 LinkedTableData.GetCustomData(int, int, string)
 LinkedTableData.SetCustomData(int, int, string, object)
 LinkedTableData.IsLinked(int, int)
 LinkedTableData.GetDataLink(CellRange)
 LinkedTableData.GetDataLink()
 LinkedTableData.GetDataLink(int, int)
 LinkedTableData.SetDataLink(CellRange, ObjectId, bool)
 LinkedTableData.SetDataLink(int, int, ObjectId, bool)
 LinkedTableData.UpdateDataLink(UpdateDirection, UpdateOption)
 LinkedTableData.UpdateDataLink(int, int, UpdateDirection, UpdateOption)
 LinkedTableData.NumberOfRows
 LinkedTableData.NumberOfColumns
 LinkedData.Clear()
 LinkedData.Name
 LinkedData.IsEmpty
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 TableTemplate(Table, TableCopyOptions)
public TableTemplate(Table table, TableCopyOptions copyOption)
Parameters
table Table
copyOption TableCopyOptions
 TableTemplate(IntPtr, bool)
protected TableTemplate(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Methods
 Capture(Table, TableCopyOptions)
public void Capture(Table table, TableCopyOptions copyOption)
Parameters
table Table
copyOption TableCopyOptions
 CreateTable(TableCopyOptions)
public Table CreateTable(TableCopyOptions copyOption)
Parameters
copyOption TableCopyOptions
Returns
Table