Table of Contents
 Class Entity
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbEntity")]
public abstract class Entity : DBObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
Entity
Implements
IDisposable
ICloneable
Derived
BlockBegin
BlockEnd
BlockReference
Body
Curve
DBPoint
DBText
DetailSymbol
Dimension
Face
FeatureControlFrame
GeoPositionMarker
Hatch
Image
Light
MLeader
MText
Mline
Ole2Frame
PointCloud
PointCloudEx
PolyFaceMesh
PolygonMesh
ProxyEntity
Region
Section
SectionSymbol
SequenceEnd
Shape
Solid
Solid3d
SubDMesh
Surface
Trace
UnderlayReference
Vertex
ViewBorder
Viewport
Inherited Members
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Entity(IntPtr, bool)
protected Entity(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 BlockId
public ObjectId BlockId { get; }
Property Value
ObjectId
 BlockName
public string BlockName { get; }
Property Value
string
 CastShadows
public virtual bool CastShadows { get; set; }
Property Value
bool
 CloneMeForDragging
public virtual bool CloneMeForDragging { get; }
Property Value
bool
 CollisionType
public virtual CollisionType CollisionType { get; }
Property Value
CollisionType
 Color
public virtual Color Color { get; set; }
Property Value
Color
 ColorIndex
public virtual int ColorIndex { get; set; }
Property Value
int
 CompoundObjectTransform
public virtual Matrix3d CompoundObjectTransform { get; }
Property Value
Matrix3d
 Ecs
public virtual Matrix3d Ecs { get; }
Property Value
Matrix3d
 EdgeStyleId
public ObjectId EdgeStyleId { get; set; }
Property Value
ObjectId
 EntityColor
public EntityColor EntityColor { get; }
Property Value
EntityColor
 FaceStyleId
public ObjectId FaceStyleId { get; set; }
Property Value
ObjectId
 ForceAnnoAllVisible
public virtual bool ForceAnnoAllVisible { get; set; }
Property Value
bool
 GeometricExtents
public virtual Extents3d GeometricExtents { get; }
Property Value
Extents3d
 Hyperlinks
public HyperLinkCollection Hyperlinks { get; }
Property Value
HyperLinkCollection
 IsPlanar
public virtual bool IsPlanar { get; }
Property Value
bool
 Layer
public virtual string Layer { get; set; }
Property Value
string
 LayerId
public virtual ObjectId LayerId { get; set; }
Property Value
ObjectId
 LineWeight
public virtual LineWeight LineWeight { get; set; }
Property Value
LineWeight
 Linetype
public virtual string Linetype { get; set; }
Property Value
string
 LinetypeId
public virtual ObjectId LinetypeId { get; set; }
Property Value
ObjectId
 LinetypeScale
[UnitType(UnitType.Unitless)]
public virtual double LinetypeScale { get; set; }
Property Value
double
 Material
public string Material { get; set; }
Property Value
string
 MaterialId
public ObjectId MaterialId { get; set; }
Property Value
ObjectId
 MaterialMapper
public Mapper MaterialMapper { get; set; }
Property Value
Mapper
 PlotStyleName
public virtual string PlotStyleName { get; set; }
Property Value
string
 PlotStyleNameId
public virtual PlotStyleDescriptor PlotStyleNameId { get; set; }
Property Value
PlotStyleDescriptor
 ReceiveShadows
public virtual bool ReceiveShadows { get; set; }
Property Value
bool
 Transparency
public virtual Transparency Transparency { get; set; }
Property Value
Transparency
 Visible
public virtual bool Visible { get; set; }
Property Value
bool
 VisualStyleId
public ObjectId VisualStyleId { get; set; }
Property Value
ObjectId
Methods
 AddSubentityPaths(FullSubentityPath[])
public void AddSubentityPaths(FullSubentityPath[] subPaths)
Parameters
subPaths FullSubentityPath[]
 BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
[Obsolete("Use the overload taking IntPtr instead.")]
public void BoundingBoxIntersectWith(Entity entityPointer, Intersect intersectType, Plane projectionPlane, Point3dCollection points, long thisGraphicSystemMarker, long otherGraphicSystemMarker)
Parameters
entityPointer Entity
intersectType Intersect
projectionPlane Plane
points Point3dCollection
thisGraphicSystemMarker long
otherGraphicSystemMarker long
 BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
public void BoundingBoxIntersectWith(Entity entityPointer, Intersect intersectType, Plane projectionPlane, Point3dCollection points, IntPtr thisGraphicSystemMarker, IntPtr otherGraphicSystemMarker)
Parameters
entityPointer Entity
intersectType Intersect
projectionPlane Plane
points Point3dCollection
thisGraphicSystemMarker IntPtr
otherGraphicSystemMarker IntPtr
 BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, long, long)
[Obsolete("Use the overload taking IntPtr instead.")]
public void BoundingBoxIntersectWith(Entity entityPointer, Intersect intersectType, Point3dCollection points, long thisGraphicSystemMarker, long otherGraphicSystemMarker)
Parameters
entityPointer Entity
intersectType Intersect
points Point3dCollection
thisGraphicSystemMarker long
otherGraphicSystemMarker long
 BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
public void BoundingBoxIntersectWith(Entity entityPointer, Intersect intersectType, Point3dCollection points, IntPtr thisGraphicSystemMarker, IntPtr otherGraphicSystemMarker)
Parameters
entityPointer Entity
intersectType Intersect
points Point3dCollection
thisGraphicSystemMarker IntPtr
otherGraphicSystemMarker IntPtr
 DeleteSubentityPaths(FullSubentityPath[])
public void DeleteSubentityPaths(FullSubentityPath[] subPaths)
Parameters
subPaths FullSubentityPath[]
 Draw()
[OpenMode(OpenMode.ForRead)]
public void Draw()
 Explode(DBObjectCollection)
public void Explode(DBObjectCollection entitySet)
Parameters
entitySet DBObjectCollection
 GetGraphicsMarkersAtSubentityPathIntPtr(FullSubentityPath)
public IntPtrCollection GetGraphicsMarkersAtSubentityPathIntPtr(FullSubentityPath subPath)
Parameters
subPath FullSubentityPath
Returns
IntPtrCollection
 GetGripPoints(GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
public bool GetGripPoints(GripDataCollection grips, double curViewUnitSize, int gripSize, Vector3d curViewDir, GetGripPointsFlags bitFlags)
Parameters
grips GripDataCollection
curViewUnitSize double
gripSize int
curViewDir Vector3d
bitFlags GetGripPointsFlags
Returns
bool
 GetGripPoints(Point3dCollection, IntegerCollection, IntegerCollection)
public void GetGripPoints(Point3dCollection gripPoints, IntegerCollection snapModes, IntegerCollection geometryIds)
Parameters
gripPoints Point3dCollection
snapModes IntegerCollection
geometryIds IntegerCollection
 GetGripPointsAtSubentityPath(FullSubentityPath, GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
public bool GetGripPointsAtSubentityPath(FullSubentityPath subPath, GripDataCollection grips, double curViewUnitSize, int gripSize, Vector3d curViewDir, GetGripPointsFlags bitFlags)
Parameters
subPath FullSubentityPath
grips GripDataCollection
curViewUnitSize double
gripSize int
curViewDir Vector3d
bitFlags GetGripPointsFlags
Returns
bool
 GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection)
public void GetObjectSnapPoints(ObjectSnapModes snapMode, int gsSelectionMark, Point3d pickPoint, Point3d lastPoint, Matrix3d viewTransform, Point3dCollection snapPoints, IntegerCollection geometryIds)
Parameters
snapMode ObjectSnapModes
gsSelectionMark int
pickPoint Point3d
lastPoint Point3d
viewTransform Matrix3d
snapPoints Point3dCollection
geometryIds IntegerCollection
 GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection, Matrix3d)
public void GetObjectSnapPoints(ObjectSnapModes snapMode, int gsSelectionMark, Point3d pickPoint, Point3d lastPoint, Matrix3d viewTransform, Point3dCollection snapPoints, IntegerCollection geometryIds, Matrix3d insertionMat)
Parameters
snapMode ObjectSnapModes
gsSelectionMark int
pickPoint Point3d
lastPoint Point3d
viewTransform Matrix3d
snapPoints Point3dCollection
geometryIds IntegerCollection
insertionMat Matrix3d
 GetPlane()
public virtual Plane GetPlane()
Returns
Plane
 GetStretchPoints(Point3dCollection)
public void GetStretchPoints(Point3dCollection stretchPoints)
Parameters
stretchPoints Point3dCollection
 GetSubentity(FullSubentityPath)
public Entity GetSubentity(FullSubentityPath id)
Parameters
id FullSubentityPath
Returns
Entity
 GetSubentityGeometricExtents(FullSubentityPath)
public Extents3d GetSubentityGeometricExtents(FullSubentityPath subPath)
Parameters
subPath FullSubentityPath
Returns
Extents3d
 GetSubentityPathsAtGraphicsMarker(SubentityType, long, Point3d, Matrix3d, int, ObjectId[])
[Obsolete("Use the overload taking IntPtr instead.")]
public FullSubentityPath[] GetSubentityPathsAtGraphicsMarker(SubentityType type, long gsMark, Point3d pickPoint, Matrix3d viewTransform, int numInserts, ObjectId[] entityAndInsertStack)
Parameters
type SubentityType
gsMark long
pickPoint Point3d
viewTransform Matrix3d
numInserts int
entityAndInsertStack ObjectId[]
Returns
FullSubentityPath[]
 GetSubentityPathsAtGraphicsMarker(SubentityType, IntPtr, Point3d, Matrix3d, ObjectId[])
public FullSubentityPath[] GetSubentityPathsAtGraphicsMarker(SubentityType type, IntPtr gsMark, Point3d pickPoint, Matrix3d viewTransform, ObjectId[] entityAndInsertStack)
Parameters
type SubentityType
gsMark IntPtr
pickPoint Point3d
viewTransform Matrix3d
entityAndInsertStack ObjectId[]
Returns
FullSubentityPath[]
 GetTransformedCopy(Matrix3d)
public Entity GetTransformedCopy(Matrix3d transform)
Parameters
transform Matrix3d
Returns
Entity
 Highlight()
public void Highlight()
 Highlight(FullSubentityPath, bool)
public void Highlight(FullSubentityPath subId, bool highlightAll)
Parameters
subId FullSubentityPath
highlightAll bool
 HighlightState(FullSubentityPath)
public HighlightStyle HighlightState(FullSubentityPath subId)
Parameters
subId FullSubentityPath
Returns
HighlightStyle
 IntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
[Obsolete("Use the overload taking IntPtr instead.")]
public void IntersectWith(Entity entityPointer, Intersect intersectType, Plane projectionPlane, Point3dCollection points, long thisGraphicSystemMarker, long otherGraphicSystemMarker)
Parameters
entityPointer Entity
intersectType Intersect
projectionPlane Plane
points Point3dCollection
thisGraphicSystemMarker long
otherGraphicSystemMarker long
 IntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
public void IntersectWith(Entity entityPointer, Intersect intersectType, Plane projectionPlane, Point3dCollection points, IntPtr thisGraphicSystemMarker, IntPtr otherGraphicSystemMarker)
Parameters
entityPointer Entity
intersectType Intersect
projectionPlane Plane
points Point3dCollection
thisGraphicSystemMarker IntPtr
otherGraphicSystemMarker IntPtr
 IntersectWith(Entity, Intersect, Point3dCollection, long, long)
[Obsolete("Use the overload taking IntPtr instead.")]
public void IntersectWith(Entity entityPointer, Intersect intersectType, Point3dCollection points, long thisGraphicSystemMarker, long otherGraphicSystemMarker)
Parameters
entityPointer Entity
intersectType Intersect
points Point3dCollection
thisGraphicSystemMarker long
otherGraphicSystemMarker long
 IntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
public void IntersectWith(Entity entityPointer, Intersect intersectType, Point3dCollection points, IntPtr thisGraphicSystemMarker, IntPtr otherGraphicSystemMarker)
Parameters
entityPointer Entity
intersectType Intersect
points Point3dCollection
thisGraphicSystemMarker IntPtr
otherGraphicSystemMarker IntPtr
 IsContentSnappable()
public bool IsContentSnappable()
Returns
bool
 JoinEntities(Entity[])
public IntegerCollection JoinEntities(Entity[] otherEntities)
Parameters
otherEntities Entity[]
Returns
IntegerCollection
 JoinEntity(Entity)
public void JoinEntity(Entity secondaryEntity)
Parameters
secondaryEntity Entity
 List()
public void List()
 MoveGripPointsAt(GripDataCollection, Vector3d, MoveGripPointsFlags)
public void MoveGripPointsAt(GripDataCollection grips, Vector3d offset, MoveGripPointsFlags bitFlags)
Parameters
grips GripDataCollection
offset Vector3d
bitFlags MoveGripPointsFlags
 MoveGripPointsAt(IntegerCollection, Vector3d)
public void MoveGripPointsAt(IntegerCollection indices, Vector3d offset)
Parameters
indices IntegerCollection
offset Vector3d
 MoveGripPointsAtSubentityPaths(FullSubentityPath[], IntPtr[], Vector3d, MoveGripPointsFlags)
public void MoveGripPointsAtSubentityPaths(FullSubentityPath[] subPaths, IntPtr[] appData, Vector3d offset, MoveGripPointsFlags bitFlags)
Parameters
subPaths FullSubentityPath[]
appData IntPtr[]
offset Vector3d
bitFlags MoveGripPointsFlags
 MoveStretchPointsAt(IntegerCollection, Vector3d)
public void MoveStretchPointsAt(IntegerCollection indices, Vector3d offset)
Parameters
indices IntegerCollection
offset Vector3d
 PopHighlight(FullSubentityPath)
public void PopHighlight(FullSubentityPath subId)
Parameters
subId FullSubentityPath
 PushHighlight(FullSubentityPath, HighlightStyle)
public void PushHighlight(FullSubentityPath subId, HighlightStyle highlightStyle)
Parameters
subId FullSubentityPath
highlightStyle HighlightStyle
 RecordGraphicsModified(bool)
public void RecordGraphicsModified(bool setModified)
Parameters
setModified bool
 SaveAs(WorldDraw, SaveType)
public virtual void SaveAs(WorldDraw mode, SaveType st)
Parameters
mode WorldDraw
st SaveType
 SetDatabaseDefaults()
public void SetDatabaseDefaults()
 SetDatabaseDefaults(Database)
public void SetDatabaseDefaults(Database sourceDatabase)
Parameters
sourceDatabase Database
 SetDragStatus(DragStatus)
public virtual void SetDragStatus(DragStatus status)
Parameters
status DragStatus
 SetGripStatus(GripStatus)
public virtual void SetGripStatus(GripStatus status)
Parameters
status GripStatus
 SetLayerId(ObjectId, bool)
public virtual void SetLayerId(ObjectId newValue, bool allowHidden)
Parameters
newValue ObjectId
allowHidden bool
 SetPropertiesFrom(Entity)
public void SetPropertiesFrom(Entity entityPointer)
Parameters
entityPointer Entity
 SetSubentityGripStatus(GripStatus, FullSubentityPath)
public void SetSubentityGripStatus(GripStatus status, FullSubentityPath subentity)
Parameters
status GripStatus
subentity FullSubentityPath
 TransformBy(Matrix3d)
public void TransformBy(Matrix3d transform)
Parameters
transform Matrix3d
 TransformSubentityPathsBy(FullSubentityPath[], Matrix3d)
public void TransformSubentityPathsBy(FullSubentityPath[] subPaths, Matrix3d transform)
Parameters
subPaths FullSubentityPath[]
transform Matrix3d
 Unhighlight()
public void Unhighlight()
 Unhighlight(FullSubentityPath, bool)
public void Unhighlight(FullSubentityPath subId, bool highlightAll)
Parameters
subId FullSubentityPath
highlightAll bool