Table of Contents
 Enum DetailViewModelEdge
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDetailViewStyle::ModelEdge")]
public enum DetailViewModelEdge
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Jagged = 3
Smooth = 0
SmoothWithBorder = 1
SmoothWithConnectionLine = 2