Table of Contents
 Enum TableEnumeratorOption
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::TableIteratorOption")]
public enum TableEnumeratorOption
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
IterateColumns = 4
IterateRows = 2
IterateSelection = 1
None = 0
SkipMerged = 64
SkipReadOnlyContent = 16
SkipReadOnlyFormat = 32