Table of Contents
 Enum LampColorPreset
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbLight::LampColorPreset")]
public enum LampColorPreset
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CoolWhite = 2
Custom = 14
D65White = 0
DaylightFluorescent = 4
Fluorescent = 1
Halogen = 7
HighPressureSodium = 12
Incandescent = 5
LowPressureSodium = 13
Mercury = 10
MetalHalide = 9
PhosphorMercury = 11
Quartz = 8
WhiteFluorescent = 3
Xenon = 6