Table of Contents
 Enum OrthographicView
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::OrthographicView")]
[TypeConverter(typeof(EnumConverter))]
public enum OrthographicView
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BackView = 4
BottomView = 2
FrontView = 3
LeftView = 5
NonOrthoView = 0
RightView = 6
TopView = 1