Table of Contents
 Class ExtractOption
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public class ExtractOption
Inheritance
object
ExtractOption
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ExtractOption()
public ExtractOption()
Fields
 ExtractType
public ExtractionType ExtractType
Field Value
ExtractionType
 FillGap
public double FillGap
Field Value
double
 MiniumSegmentLength
public double MiniumSegmentLength
Field Value
double
 ProcessPoints
public uint ProcessPoints
Field Value
uint
 SnapAngle
public uint SnapAngle
Field Value
uint
 UseLineSegmentOnly
public bool UseLineSegmentOnly
Field Value
bool