Table of Contents
 Class GeoLocationData
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbGeoData")]
public class GeoLocationData : DBObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
GeoLocationData
Implements
IDisposable
ICloneable
Inherited Members
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 GeoLocationData()
public GeoLocationData()
 GeoLocationData(IntPtr, bool)
protected GeoLocationData(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 BlockTableRecordId
public ObjectId BlockTableRecordId { get; set; }
Property Value
ObjectId
 CoordinateProjectionRadius
public double CoordinateProjectionRadius { get; set; }
Property Value
double
 CoordinateSystem
public string CoordinateSystem { get; set; }
Property Value
string
 DesignPoint
public Point3d DesignPoint { get; set; }
Property Value
Point3d
 DoSeaLevelCorrection
public bool DoSeaLevelCorrection { get; set; }
Property Value
bool
 GeoRSSTag
public string GeoRSSTag { get; set; }
Property Value
string
 HorizontalUnits
public UnitsValue HorizontalUnits { get; set; }
Property Value
UnitsValue
 HorizontalUnitsScale
public double HorizontalUnitsScale { get; set; }
Property Value
double
 NorthDirection
public double NorthDirection { get; }
Property Value
double
 NorthDirectionVector
public Vector2d NorthDirectionVector { get; set; }
Property Value
Vector2d
 NumMeshPoints
public int NumMeshPoints { get; }
Property Value
int
 ReferencePoint
public Point3d ReferencePoint { get; set; }
Property Value
Point3d
 ScaleEstimationMethod
public ScaleEstimationMethod ScaleEstimationMethod { get; set; }
Property Value
ScaleEstimationMethod
 ScaleFactor
public double ScaleFactor { get; set; }
Property Value
double
 SeaLevelElevation
public double SeaLevelElevation { get; set; }
Property Value
double
 TypeOfCoordinates
public TypeOfCoordinates TypeOfCoordinates { get; set; }
Property Value
TypeOfCoordinates
 UpDirection
public Vector3d UpDirection { get; set; }
Property Value
Vector3d
 VerticalUnits
public UnitsValue VerticalUnits { get; set; }
Property Value
UnitsValue
 VerticalUnitsScale
public double VerticalUnitsScale { get; set; }
Property Value
double
Methods
 AddMeshPointMap(int, Point2d, Point2d)
public void AddMeshPointMap(int index, Point2d sourcePt, Point2d destPt)
Parameters
index int
sourcePt Point2d
destPt Point2d
 EraseFromDb()
public void EraseFromDb()
 GetMeshPointMap(int)
public MeshPointMap GetMeshPointMap(int index)
Parameters
index int
Returns
MeshPointMap
 GetMeshPointMaps()
public MeshPointMaps GetMeshPointMaps()
Returns
MeshPointMaps
 PostToDb()
public ObjectId PostToDb()
Returns
ObjectId
 ResetMeshPointMaps()
public void ResetMeshPointMaps()
 SetMeshPointMaps(Point2dCollection, Point2dCollection)
public void SetMeshPointMaps(Point2dCollection sourcePts, Point2dCollection destPts)
Parameters
sourcePts Point2dCollection
destPts Point2dCollection
 TransformFromLonLatAlt(Point3d)
public Point3d TransformFromLonLatAlt(Point3d geoPt)
Parameters
geoPt Point3d
Returns
Point3d
 TransformToLonLatAlt(Point3d)
public Point3d TransformToLonLatAlt(Point3d dwgPt)
Parameters
dwgPt Point3d
Returns
Point3d
 TransformToLonLatAlt(double, double, double)
public GeoDataLonLatAltInfo TransformToLonLatAlt(double x, double y, double z)
Parameters
x double
y double
z double
Returns
GeoDataLonLatAltInfo
 UpdateTransformationMatrix()
public void UpdateTransformationMatrix()