Table of Contents
 Enum TableStyleFlags
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcDb::TableStyleFlags")]
public enum TableStyleFlags
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
HorizontalInsideLineFirst = 1
HorizontalInsideLineSecond = 2
HorizontalInsideLineThird = 4
TableStyleModified = 8