Table of Contents
 Enum AssocConstraintType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum AssocConstraintType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Angle0AssocConstraintType = 4
Angle1AssocConstraintType = 5
Angle2AssocConstraintType = 6
Angle3AssocConstraintType = 7
DiameterAssocConstraintType = 9
DistanceAssocConstraintType = 1
HorizontalDistanceAssocConstraintType = 2
NoneAssocConstraintType = 0
RadiusAssocConstraintType = 8
VerticalDistanceAssocConstraintType = 3