Table of Contents
 Class Matrix2dBuilder
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public class Matrix2dBuilder
Inheritance
object
Matrix2dBuilder
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Matrix2dBuilder()
public Matrix2dBuilder()
 Matrix2dBuilder(Matrix2d)
public Matrix2dBuilder(Matrix2d value)
Parameters
value Matrix2d
Properties
 this[int, int]
public double this[int row, int column] { get; set; }
Parameters
row int
column int
Property Value
double
Methods
 ToMatrix2d()
public Matrix2d ToMatrix2d()
Returns
Matrix2d