Table of Contents
 Struct CustomScale
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct CustomScale
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 CustomScale(double, double)
public CustomScale(double numerator, double denominator)
Parameters
numerator double
denominator double
Properties
 Denominator
[UnitType(UnitType.Unitless)]
public double Denominator { get; }
Property Value
double
 Numerator
[UnitType(UnitType.Unitless)]
public double Numerator { get; }
Property Value
double
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 IsEqualTo(CustomScale)
public bool IsEqualTo(CustomScale a)
Parameters
a CustomScale
Returns
bool
 IsEqualTo(CustomScale, Tolerance)
public bool IsEqualTo(CustomScale a, Tolerance tolerance)
Parameters
a CustomScale
tolerance Tolerance
Returns
bool
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
Operators
 operator ==(CustomScale, CustomScale)
public static bool operator ==(CustomScale a, CustomScale b)
Parameters
a CustomScale
b CustomScale
Returns
bool
 operator !=(CustomScale, CustomScale)
public static bool operator !=(CustomScale a, CustomScale b)
Parameters
a CustomScale
b CustomScale
Returns
bool