Table of Contents
 Class Variables
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public class Variables : DisposableWrapper, IDisposable, IEnumerable<Variable>, IEnumerable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Variables
Implements
IDisposable
IEnumerable<Variable>
IEnumerable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 this[string]
public Variable this[string name] { get; }
Parameters
name string
Property Value
Variable
Methods
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 GetAllNames()
public string[] GetAllNames()
Returns
string[]
 GetEnumerator()
public virtual IEnumerator<Variable> GetEnumerator()
Returns
IEnumerator<Variable>
 Reset(StorageType)
public void Reset(Variable.StorageType filter)
Parameters
filter Variable.StorageType
Events
 Changed
public event VariableChangedEventHandler Changed
Event Type
VariableChangedEventHandler
 Changing
public event VariableChangingEventHandler Changing
Event Type
VariableChangingEventHandler