Table of Contents
 Class SecurityParameters
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("SecurityParams")]
public sealed class SecurityParameters
Inheritance
object
SecurityParameters
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 SecurityParameters()
[Obsolete("Use other overloads.", true)]
public SecurityParameters()
 SecurityParameters(string, string, string, string, string, string, string, SecurityActions, SecurityAlgorithm, uint, uint)
public SecurityParameters(string password, string providerName, string subject, string issuer, string serialNumber, string comment, string timeServer, SecurityActions actions, SecurityAlgorithm algorithm, uint keyLength, uint providerType)
Parameters
password string
providerName string
subject string
issuer string
serialNumber string
comment string
timeServer string
actions SecurityActions
algorithm SecurityAlgorithm
keyLength uint
providerType uint
Properties
 Action
public SecurityActions Action { get; set; }
Property Value
SecurityActions
 Algorithm
public SecurityAlgorithm Algorithm { get; set; }
Property Value
SecurityAlgorithm
 Comment
public string Comment { get; set; }
Property Value
string
 Issuer
public string Issuer { get; set; }
Property Value
string
 KeyLength
public int KeyLength { get; set; }
Property Value
int
 Password
public string Password { get; set; }
Property Value
string
 ProviderName
public string ProviderName { get; set; }
Property Value
string
 ProviderType
public int ProviderType { get; set; }
Property Value
int
 SerialNumber
public string SerialNumber { get; set; }
Property Value
string
 Subject
public string Subject { get; set; }
Property Value
string
 TimeServer
public string TimeServer { get; set; }
Property Value
string
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
Operators
 operator ==(SecurityParameters, SecurityParameters)
public static bool operator ==(SecurityParameters a, SecurityParameters b)
Parameters
a SecurityParameters
b SecurityParameters
Returns
bool
 operator !=(SecurityParameters, SecurityParameters)
public static bool operator !=(SecurityParameters a, SecurityParameters b)
Parameters
a SecurityParameters
b SecurityParameters
Returns
bool