Table of Contents
 Enum StdScaleType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbPlotSettings::StdScaleType")]
public enum StdScaleType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ScaleToFit = 0
StdScale1000To1 = 33
StdScale100To1 = 32
StdScale10To1 = 31
StdScale1InchIs1ft = 12
StdScale1To1 = 16
StdScale1To10 = 21
StdScale1To100 = 27
StdScale1To128InchIs1ft = 1
StdScale1To16 = 22
StdScale1To16InchIs1ft = 4
StdScale1To2 = 17
StdScale1To20 = 23
StdScale1To2InchIs1ft = 10
StdScale1To30 = 24
StdScale1To32InchIs1ft = 3
StdScale1To4 = 18
StdScale1To40 = 25
StdScale1To4InchIs1ft = 8
StdScale1To5 = 19
StdScale1To50 = 26
StdScale1To64InchIs1ft = 2
StdScale1To8 = 20
StdScale1To8InchIs1ft = 6
StdScale1ftIs1ft = 15
StdScale2To1 = 28
StdScale3InchIs1ft = 13
StdScale3To16InchIs1ft = 7
StdScale3To32InchIs1ft = 5
StdScale3To4InchIs1ft = 11
StdScale3To8InchIs1ft = 9
StdScale4To1 = 29
StdScale6InchIs1ft = 14
StdScale8To1 = 30