Table of Contents
 Class MText
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbMText")]
public class MText : Entity, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
Entity
MText
Implements
IDisposable
ICloneable
Inherited Members
 Entity.SetLayerId(ObjectId, bool)
 Entity.SetPropertiesFrom(Entity)
 Entity.GetPlane()
 Entity.AddSubentityPaths(FullSubentityPath[])
 Entity.DeleteSubentityPaths(FullSubentityPath[])
 Entity.TransformSubentityPathsBy(FullSubentityPath[], Matrix3d)
 Entity.GetGripPointsAtSubentityPath(FullSubentityPath, GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.MoveGripPointsAtSubentityPaths(FullSubentityPath[], IntPtr[], Vector3d, MoveGripPointsFlags)
 Entity.GetSubentityGeometricExtents(FullSubentityPath)
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, IntPtr, Point3d, Matrix3d, ObjectId[])
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, long, Point3d, Matrix3d, int, ObjectId[])
 Entity.GetGraphicsMarkersAtSubentityPathIntPtr(FullSubentityPath)
 Entity.Highlight(FullSubentityPath, bool)
 Entity.Highlight()
 Entity.Unhighlight(FullSubentityPath, bool)
 Entity.Unhighlight()
 Entity.PushHighlight(FullSubentityPath, HighlightStyle)
 Entity.PopHighlight(FullSubentityPath)
 Entity.HighlightState(FullSubentityPath)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection, Matrix3d)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection)
 Entity.IsContentSnappable()
 Entity.GetGripPoints(GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.GetGripPoints(Point3dCollection, IntegerCollection, IntegerCollection)
 Entity.MoveGripPointsAt(GripDataCollection, Vector3d, MoveGripPointsFlags)
 Entity.MoveGripPointsAt(IntegerCollection, Vector3d)
 Entity.GetStretchPoints(Point3dCollection)
 Entity.MoveStretchPointsAt(IntegerCollection, Vector3d)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.List()
 Entity.TransformBy(Matrix3d)
 Entity.GetTransformedCopy(Matrix3d)
 Entity.GetSubentity(FullSubentityPath)
 Entity.Explode(DBObjectCollection)
 Entity.RecordGraphicsModified(bool)
 Entity.Draw()
 Entity.SaveAs(WorldDraw, SaveType)
 Entity.SetDatabaseDefaults(Database)
 Entity.SetDatabaseDefaults()
 Entity.SetDragStatus(DragStatus)
 Entity.SetGripStatus(GripStatus)
 Entity.SetSubentityGripStatus(GripStatus, FullSubentityPath)
 Entity.JoinEntity(Entity)
 Entity.JoinEntities(Entity[])
 Entity.EdgeStyleId
 Entity.FaceStyleId
 Entity.VisualStyleId
 Entity.ForceAnnoAllVisible
 Entity.BlockName
 Entity.MaterialMapper
 Entity.MaterialId
 Entity.Material
 Entity.ReceiveShadows
 Entity.CastShadows
 Entity.Hyperlinks
 Entity.CloneMeForDragging
 Entity.CompoundObjectTransform
 Entity.GeometricExtents
 Entity.Ecs
 Entity.IsPlanar
 Entity.CollisionType
 Entity.LineWeight
 Entity.Visible
 Entity.LinetypeScale
 Entity.LinetypeId
 Entity.Linetype
 Entity.LayerId
 Entity.Layer
 Entity.PlotStyleNameId
 Entity.PlotStyleName
 Entity.Transparency
 Entity.EntityColor
 Entity.ColorIndex
 Entity.Color
 Entity.BlockId
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 MText()
public MText()
 MText(IntPtr, bool)
protected MText(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 ActualHeight
[UnitType(UnitType.Distance)]
public double ActualHeight { get; }
Property Value
double
 ActualWidth
[UnitType(UnitType.Distance)]
public double ActualWidth { get; }
Property Value
double
 AlignChange
public static string AlignChange { get; }
Property Value
string
 Ascent
[UnitType(UnitType.Distance)]
public double Ascent { get; }
Property Value
double
 Attachment
public AttachmentPoint Attachment { get; set; }
Property Value
AttachmentPoint
 BackgroundFill
public bool BackgroundFill { get; set; }
Property Value
bool
 BackgroundFillColor
public Color BackgroundFillColor { get; set; }
Property Value
Color
 BackgroundScaleFactor
[UnitType(UnitType.Unitless)]
public double BackgroundScaleFactor { get; set; }
Property Value
double
 BackgroundTransparency
public Transparency BackgroundTransparency { get; set; }
Property Value
Transparency
 BlockBegin
public static string BlockBegin { get; }
Property Value
string
 BlockEnd
public static string BlockEnd { get; }
Property Value
string
 ColorChange
public static string ColorChange { get; }
Property Value
string
 ColumnAutoHeight
public bool ColumnAutoHeight { get; set; }
Property Value
bool
 ColumnCount
public int ColumnCount { get; set; }
Property Value
int
 ColumnFlowReversed
public bool ColumnFlowReversed { get; set; }
Property Value
bool
 ColumnGutterWidth
public double ColumnGutterWidth { get; set; }
Property Value
double
 ColumnType
public ColumnType ColumnType { get; set; }
Property Value
ColumnType
 ColumnWidth
public double ColumnWidth { get; set; }
Property Value
double
 Contents
public string Contents { get; set; }
Property Value
string
 ContentsRTF
public string ContentsRTF { get; set; }
Property Value
string
 Descent
[UnitType(UnitType.Distance)]
public double Descent { get; }
Property Value
double
 Direction
public Vector3d Direction { get; set; }
Property Value
Vector3d
 FlowDirection
public FlowDirection FlowDirection { get; set; }
Property Value
FlowDirection
 FontChange
public static string FontChange { get; }
Property Value
string
 Height
public double Height { get; set; }
Property Value
double
 HeightChange
public static string HeightChange { get; }
Property Value
string
 LineBreak
public static string LineBreak { get; }
Property Value
string
 LineSpaceDistance
[UnitType(UnitType.Distance)]
public double LineSpaceDistance { get; set; }
Property Value
double
 LineSpacingFactor
[UnitType(UnitType.Unitless)]
public double LineSpacingFactor { get; set; }
Property Value
double
 LineSpacingStyle
public LineSpacingStyle LineSpacingStyle { get; set; }
Property Value
LineSpacingStyle
 Location
public Point3d Location { get; set; }
Property Value
Point3d
 NonBreakSpace
public static string NonBreakSpace { get; }
Property Value
string
 Normal
public Vector3d Normal { get; set; }
Property Value
Vector3d
 ObliqueChange
public static string ObliqueChange { get; }
Property Value
string
 OverlineOff
public static string OverlineOff { get; }
Property Value
string
 OverlineOn
public static string OverlineOn { get; }
Property Value
string
 ParagraphBreak
public static string ParagraphBreak { get; }
Property Value
string
 Rotation
[UnitType(UnitType.Angle)]
public double Rotation { get; set; }
Property Value
double
 ShowBorders
public bool ShowBorders { get; set; }
Property Value
bool
 StackStart
public static string StackStart { get; }
Property Value
string
 StrikethroughOff
public static string StrikethroughOff { get; }
Property Value
string
 StrikethroughOn
public static string StrikethroughOn { get; }
Property Value
string
 Text
public string Text { get; }
Property Value
string
 TextHeight
[UnitType(UnitType.Distance)]
public double TextHeight { get; set; }
Property Value
double
 TextStyleId
public ObjectId TextStyleId { get; set; }
Property Value
ObjectId
 TextStyleName
public string TextStyleName { get; }
Property Value
string
 TrackChange
public static string TrackChange { get; }
Property Value
string
 UnderlineOff
public static string UnderlineOff { get; }
Property Value
string
 UnderlineOn
public static string UnderlineOn { get; }
Property Value
string
 UseBackgroundColor
public bool UseBackgroundColor { get; set; }
Property Value
bool
 Width
[UnitType(UnitType.Distance)]
public double Width { get; set; }
Property Value
double
 WidthChange
public static string WidthChange { get; }
Property Value
string
Methods
 ConvertFieldToText()
public void ConvertFieldToText()
 CorrectSpelling()
public int CorrectSpelling()
Returns
int
 ExplodeFragments(MTextFragmentCallback)
public void ExplodeFragments(MTextFragmentCallback enumerator)
Parameters
enumerator MTextFragmentCallback
 ExplodeFragments(MTextFragmentCallback, object)
public void ExplodeFragments(MTextFragmentCallback enumerator, object userData)
Parameters
enumerator MTextFragmentCallback
userData object
 ExplodeFragments(MTextFragmentCallback, object, WorldDraw)
public void ExplodeFragments(MTextFragmentCallback enumerator, object userData, WorldDraw context)
Parameters
enumerator MTextFragmentCallback
userData object
context WorldDraw
 GetBoundingPoints()
public Point3dCollection GetBoundingPoints()
Returns
Point3dCollection
 GetColumnHeight(int)
public double GetColumnHeight(int index)
Parameters
index int
Returns
double
 SetAttachmentMovingLocation(AttachmentPoint)
public void SetAttachmentMovingLocation(AttachmentPoint value)
Parameters
value AttachmentPoint
 SetColumnHeight(int, double)
public void SetColumnHeight(int index, double height)
Parameters
index int
height double
 SetContentsRtf(string)
public int SetContentsRtf(string value)
Parameters
value string
Returns
int
 SetDynamicColumns(double, double, bool)
public void SetDynamicColumns(double width, double gutter, bool auto_height)
Parameters
width double
gutter double
auto_height bool
 SetStaticColumns(double, double, int)
public void SetStaticColumns(double width, double gutter, int count)
Parameters
width double
gutter double
count int
 getMTextWithFieldCodes()
public string getMTextWithFieldCodes()
Returns
string