Table of Contents
 Class Graph
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbGraph")]
public class Graph : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Graph
Implements
IDisposable
Derived
ObjectIdGraph
XrefGraph
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Graph(GraphNode)
public Graph(GraphNode root)
Parameters
root GraphNode
 Graph(IntPtr, bool)
protected Graph(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 IsEmpty
public bool IsEmpty { get; }
Property Value
bool
 NumNodes
public int NumNodes { get; }
Property Value
int
 RootNode
public GraphNode RootNode { get; }
Property Value
GraphNode
Methods
 AddEdge(GraphNode, GraphNode)
public void AddEdge(GraphNode from, GraphNode toPointer)
Parameters
from GraphNode
toPointer GraphNode
 AddNode(GraphNode)
public void AddNode(GraphNode nodeToAdd)
Parameters
nodeToAdd GraphNode
 BreakCycleEdge(GraphNode, GraphNode)
public void BreakCycleEdge(GraphNode from, GraphNode toPointer)
Parameters
from GraphNode
toPointer GraphNode
 ClearAll(byte)
public void ClearAll(byte flags)
Parameters
flags byte
 Create(IntPtr, bool)
public static Graph Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
Graph
 DelNode(GraphNode)
public void DelNode(GraphNode nodeToDelete)
Parameters
nodeToDelete GraphNode
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 FindCycles(GraphNode)
public virtual bool FindCycles(GraphNode start)
Parameters
start GraphNode
Returns
bool
 GetOutgoing()
public GraphNodeCollection GetOutgoing()
Returns
GraphNodeCollection
 Node(int)
public GraphNode Node(int index)
Parameters
index int
Returns
GraphNode
 Reset()
public void Reset()
 SetNodeGrowthRate(int)
public void SetNodeGrowthRate(int rate)
Parameters
rate int