Table of Contents
 Class Exception
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public class Exception : Exception, _Exception, ISerializable
Inheritance
object
Exception
Exception
Implements
_Exception
ISerializable
Derived
DataAdapterSourceFilesException
Inherited Members
 Exception.GetBaseException()
 Exception.ToString()
 Exception.GetType()
 Exception.Message
 Exception.Data
 Exception.InnerException
 Exception.TargetSite
 Exception.StackTrace
 Exception.HelpLink
 Exception.Source
 Exception.HResult
 Exception.SerializeObjectState
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Exception()
public Exception()
 Exception(ErrorStatus)
public Exception(ErrorStatus es)
Parameters
es ErrorStatus
 Exception(ErrorStatus, string)
public Exception(ErrorStatus es, string message)
Parameters
es ErrorStatus
message string
 Exception(ErrorStatus, string, Exception)
public Exception(ErrorStatus es, string message, Exception innerException)
Parameters
es ErrorStatus
message string
innerException Exception
 Exception(SerializationInfo, StreamingContext)
protected Exception(SerializationInfo info, StreamingContext context)
Parameters
info SerializationInfo
context StreamingContext
Properties
 ErrorStatus
public ErrorStatus ErrorStatus { get; set; }
Property Value
ErrorStatus
Methods
 GetObjectData(SerializationInfo, StreamingContext)
public override void GetObjectData(SerializationInfo info, StreamingContext context)
Parameters
info SerializationInfo
context StreamingContext