Table of Contents
 Enum ReservedStringEnumType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum ReservedStringEnumType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ByBlock = 1
ByColor = 9
ByLayer = 0
Continuous = 3
Data = 19
DefPoints = 6
Default = 7
Global = 11
Header = 18
Missing = 8
Model = 10
None = 2
Normal = 5
Standard = 4
Title = 17
VS2DWireframe = 12
VS3DHidden = 14
VS3DWireframe = 13
VSConceptual = 16
VSRealistic = 15
VSShaded = 24
VSShadedWithEdges = 23
VSShadesOfGray = 20
VSSketchy = 21
VSXRay = 22