Table of Contents
 Class EnumConverter
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class EnumConverter : EnumConverter
Inheritance
object
TypeConverter
EnumConverter
EnumConverter
Inherited Members
 EnumConverter.CanConvertTo(ITypeDescriptorContext, Type)
 EnumConverter.GetStandardValues(ITypeDescriptorContext)
 EnumConverter.GetStandardValuesExclusive(ITypeDescriptorContext)
 EnumConverter.GetStandardValuesSupported(ITypeDescriptorContext)
 EnumConverter.IsValid(ITypeDescriptorContext, object)
 EnumConverter.EnumType
 EnumConverter.Values
 EnumConverter.Comparer
 TypeConverter.CanConvertFrom(Type)
 TypeConverter.CanConvertTo(Type)
 TypeConverter.ConvertFrom(object)
 TypeConverter.ConvertFromInvariantString(string)
 TypeConverter.ConvertFromInvariantString(ITypeDescriptorContext, string)
 TypeConverter.ConvertFromString(string)
 TypeConverter.ConvertFromString(ITypeDescriptorContext, string)
 TypeConverter.ConvertFromString(ITypeDescriptorContext, CultureInfo, string)
 TypeConverter.ConvertTo(object, Type)
 TypeConverter.ConvertToInvariantString(object)
 TypeConverter.ConvertToInvariantString(ITypeDescriptorContext, object)
 TypeConverter.ConvertToString(object)
 TypeConverter.ConvertToString(ITypeDescriptorContext, object)
 TypeConverter.ConvertToString(ITypeDescriptorContext, CultureInfo, object)
 TypeConverter.CreateInstance(IDictionary)
 TypeConverter.CreateInstance(ITypeDescriptorContext, IDictionary)
 TypeConverter.GetConvertFromException(object)
 TypeConverter.GetConvertToException(object, Type)
 TypeConverter.GetCreateInstanceSupported()
 TypeConverter.GetCreateInstanceSupported(ITypeDescriptorContext)
 TypeConverter.GetProperties(object)
 TypeConverter.GetProperties(ITypeDescriptorContext, object)
 TypeConverter.GetProperties(ITypeDescriptorContext, object, Attribute[])
 TypeConverter.GetPropertiesSupported()
 TypeConverter.GetPropertiesSupported(ITypeDescriptorContext)
 TypeConverter.GetStandardValues()
 TypeConverter.GetStandardValuesExclusive()
 TypeConverter.GetStandardValuesSupported()
 TypeConverter.IsValid(object)
 TypeConverter.SortProperties(PropertyDescriptorCollection, string[])
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 EnumConverter(Type)
public EnumConverter(Type type)
Parameters
type Type
Methods
 CanConvertFrom(ITypeDescriptorContext, Type)
public override bool CanConvertFrom(ITypeDescriptorContext context, Type sourceType)
Parameters
context ITypeDescriptorContext
sourceType Type
Returns
bool
 ConvertFrom(ITypeDescriptorContext, CultureInfo, object)
public override object ConvertFrom(ITypeDescriptorContext context, CultureInfo culture, object value)
Parameters
context ITypeDescriptorContext
culture CultureInfo
value object
Returns
object
 ConvertTo(ITypeDescriptorContext, CultureInfo, object, Type)
public override object ConvertTo(ITypeDescriptorContext context, CultureInfo culture, object value, Type destinationType)
Parameters
context ITypeDescriptorContext
culture CultureInfo
value object
destinationType Type
Returns
object