Table of Contents
 Struct Point3d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGePoint3d")]
public struct Point3d : IFormattable
Implements
IFormattable
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 Point3d(PlanarEntity, Point2d)
public Point3d(PlanarEntity plane, Point2d point)
Parameters
plane PlanarEntity
point Point2d
 Point3d(double, double, double)
public Point3d(double x, double y, double z)
Parameters
x double
y double
z double
 Point3d(double[])
public Point3d(double[] xyz)
Parameters
xyz double[]
Properties
 this[int]
public double this[int i] { get; }
Parameters
i int
Property Value
double
 Origin
public static Point3d Origin { get; }
Property Value
Point3d
 X
public double X { get; }
Property Value
double
 Y
public double Y { get; }
Property Value
double
 Z
public double Z { get; }
Property Value
double
Methods
 Add(Vector3d)
public Point3d Add(Vector3d value)
Parameters
value Vector3d
Returns
Point3d
 Convert2d(PlanarEntity)
public Point2d Convert2d(PlanarEntity plane)
Parameters
plane PlanarEntity
Returns
Point2d
 DistanceTo(Point3d)
public double DistanceTo(Point3d point)
Parameters
point Point3d
Returns
double
 DivideBy(double)
public Point3d DivideBy(double value)
Parameters
value double
Returns
Point3d
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetAsVector()
public Vector3d GetAsVector()
Returns
Vector3d
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 GetVectorTo(Point3d)
public Vector3d GetVectorTo(Point3d point)
Parameters
point Point3d
Returns
Vector3d
 IsEqualTo(Point3d)
public bool IsEqualTo(Point3d point)
Parameters
point Point3d
Returns
bool
 IsEqualTo(Point3d, Tolerance)
public bool IsEqualTo(Point3d point, Tolerance tolerance)
Parameters
point Point3d
tolerance Tolerance
Returns
bool
 Mirror(Plane)
public Point3d Mirror(Plane plane)
Parameters
plane Plane
Returns
Point3d
 MultiplyBy(double)
public Point3d MultiplyBy(double value)
Parameters
value double
Returns
Point3d
 OrthoProject(Plane)
public Point3d OrthoProject(Plane plane)
Parameters
plane Plane
Returns
Point3d
 Project(Plane, Vector3d)
public Point3d Project(Plane plane, Vector3d vector)
Parameters
plane Plane
vector Vector3d
Returns
Point3d
 RotateBy(double, Vector3d, Point3d)
public Point3d RotateBy(double angle, Vector3d vector, Point3d centerPoint)
Parameters
angle double
vector Vector3d
centerPoint Point3d
Returns
Point3d
 ScaleBy(double, Point3d)
public Point3d ScaleBy(double scaleFactor, Point3d centerPoint)
Parameters
scaleFactor double
centerPoint Point3d
Returns
Point3d
 Subtract(Vector3d)
public Point3d Subtract(Vector3d value)
Parameters
value Vector3d
Returns
Point3d
 ToArray()
public double[] ToArray()
Returns
double[]
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
 ToString(string, IFormatProvider)
public string ToString(string format, IFormatProvider provider)
Parameters
format string
provider IFormatProvider
Returns
string
 TransformBy(Matrix3d)
public Point3d TransformBy(Matrix3d leftSide)
Parameters
leftSide Matrix3d
Returns
Point3d
Operators
 operator +(Point3d, Vector3d)
public static Point3d operator +(Point3d a, Vector3d vector)
Parameters
a Point3d
vector Vector3d
Returns
Point3d
 operator /(Point3d, double)
public static Point3d operator /(Point3d a, double value)
Parameters
a Point3d
value double
Returns
Point3d
 operator ==(Point3d, Point3d)
public static bool operator ==(Point3d a, Point3d b)
Parameters
a Point3d
b Point3d
Returns
bool
 operator !=(Point3d, Point3d)
public static bool operator !=(Point3d a, Point3d b)
Parameters
a Point3d
b Point3d
Returns
bool
 operator *(Matrix3d, Point3d)
public static Point3d operator *(Matrix3d mat, Point3d a)
Parameters
mat Matrix3d
a Point3d
Returns
Point3d
 operator *(Point3d, double)
public static Point3d operator *(Point3d a, double value)
Parameters
a Point3d
value double
Returns
Point3d
 operator *(double, Point3d)
public static Point3d operator *(double value, Point3d a)
Parameters
value double
a Point3d
Returns
Point3d
 operator -(Point3d, Point3d)
public static Vector3d operator -(Point3d a, Point3d b)
Parameters
a Point3d
b Point3d
Returns
Vector3d
 operator -(Point3d, Vector3d)
public static Point3d operator -(Point3d a, Vector3d b)
Parameters
a Point3d
b Vector3d
Returns
Point3d