Table of Contents
 Class ObjectIdGraph
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbObjectIdGraph")]
public sealed class ObjectIdGraph : Graph, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Graph
ObjectIdGraph
Implements
IDisposable
Inherited Members
 Graph.Create(IntPtr, bool)
 Graph.Node(int)
 Graph.AddNode(GraphNode)
 Graph.AddEdge(GraphNode, GraphNode)
 Graph.DelNode(GraphNode)
 Graph.Reset()
 Graph.ClearAll(byte)
 Graph.GetOutgoing()
 Graph.FindCycles(GraphNode)
 Graph.BreakCycleEdge(GraphNode, GraphNode)
 Graph.SetNodeGrowthRate(int)
 Graph.IsEmpty
 Graph.NumNodes
 Graph.RootNode
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ObjectIdGraph()
public ObjectIdGraph()
Methods
 AddNode(ObjectIdGraphNode)
public void AddNode(ObjectIdGraphNode nodeToAdd)
Parameters
nodeToAdd ObjectIdGraphNode
 DelNode(ObjectIdGraphNode)
public void DelNode(ObjectIdGraphNode nodeToDelete)
Parameters
nodeToDelete ObjectIdGraphNode
 FindNode(ObjectId)
public ObjectIdGraphNode FindNode(ObjectId id)
Parameters
id ObjectId
Returns
ObjectIdGraphNode
 IdNode(int)
public ObjectIdGraphNode IdNode(int index)
Parameters
index int
Returns
ObjectIdGraphNode