Table of Contents
 Struct ObjectId
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbObjectId")]
public struct ObjectId : IComparable<ObjectId>, IDynamicMetaObjectProvider
Implements
IComparable<ObjectId>
IDynamicMetaObjectProvider
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 ObjectId(IntPtr)
public ObjectId(IntPtr oldId)
Parameters
oldId IntPtr
Properties
 Database
public Database Database { get; }
Property Value
Database
 Handle
public Handle Handle { get; }
Property Value
Handle
 IsEffectivelyErased
public bool IsEffectivelyErased { get; }
Property Value
bool
 IsErased
public bool IsErased { get; }
Property Value
bool
 IsNull
public bool IsNull { get; }
Property Value
bool
 IsResident
public bool IsResident { get; }
Property Value
bool
 IsValid
public bool IsValid { get; }
Property Value
bool
 NonForwardedHandle
public Handle NonForwardedHandle { get; }
Property Value
Handle
 Null
public static ObjectId Null { get; }
Property Value
ObjectId
 ObjectClass
public RXClass ObjectClass { get; }
Property Value
RXClass
 ObjectLeftOnDisk
public bool ObjectLeftOnDisk { get; }
Property Value
bool
 OldId
[Obsolete("Use System::IntPtr OldIdPtr")]
public long OldId { get; }
Property Value
long
 OldIdPtr
public IntPtr OldIdPtr { get; }
Property Value
IntPtr
 OriginalDatabase
public Database OriginalDatabase { get; }
Property Value
Database
Methods
 Compare(ObjectId)
public bool Compare(ObjectId value1)
Parameters
value1 ObjectId
Returns
bool
 CompareTo(ObjectId)
public int CompareTo(ObjectId other)
Parameters
other ObjectId
Returns
int
 ConvertToRedirectedId()
public ObjectId ConvertToRedirectedId()
Returns
ObjectId
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public int GetHashCode()
Returns
int
 GetMetaObject(Expression)
public DynamicMetaObject GetMetaObject(Expression parameter)
Parameters
parameter Expression
Returns
DynamicMetaObject
 GetObject(OpenMode)
public DBObject GetObject(OpenMode mode)
Parameters
mode OpenMode
Returns
DBObject
 GetObject(OpenMode, bool)
public DBObject GetObject(OpenMode mode, bool openErased)
Parameters
mode OpenMode
openErased bool
Returns
DBObject
 GetObject(OpenMode, bool, bool)
public DBObject GetObject(OpenMode mode, bool openErased, bool forceOpenOnLockedLayer)
Parameters
mode OpenMode
openErased bool
forceOpenOnLockedLayer bool
Returns
DBObject
 Open(OpenMode)
[Obsolete("For advanced use only. Use GetObject instead")]
public DBObject Open(OpenMode mode)
Parameters
mode OpenMode
Returns
DBObject
 Open(OpenMode, bool)
[Obsolete("For advanced use only. Use GetObject instead")]
public DBObject Open(OpenMode mode, bool openErased)
Parameters
mode OpenMode
openErased bool
Returns
DBObject
 Open(OpenMode, bool, bool)
[Obsolete("For advanced use only. Use GetObject instead")]
public DBObject Open(OpenMode mode, bool openErased, bool forceOpenOnLockedLayer)
Parameters
mode OpenMode
openErased bool
forceOpenOnLockedLayer bool
Returns
DBObject
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
Operators
 operator ==(ObjectId, ObjectId)
public static bool operator ==(ObjectId a, ObjectId b)
Parameters
a ObjectId
b ObjectId
Returns
bool
 operator >(ObjectId, ObjectId)
public static bool operator >(ObjectId value1, ObjectId value2)
Parameters
value1 ObjectId
value2 ObjectId
Returns
bool
 operator !=(ObjectId, ObjectId)
public static bool operator !=(ObjectId a, ObjectId b)
Parameters
a ObjectId
b ObjectId
Returns
bool
 operator <(ObjectId, ObjectId)
public static bool operator <(ObjectId value1, ObjectId value2)
Parameters
value1 ObjectId
value2 ObjectId
Returns
bool