Table of Contents
 Class AssocSingleEdgePersSubentId
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocSingleEdgePersSubentId")]
public class AssocSingleEdgePersSubentId : AssocPersSubentityId, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
AssocPersSubentityId
AssocSingleEdgePersSubentId
Implements
IDisposable
ICloneable
Inherited Members
 AssocPersSubentityId.GetTransientSubentIds(Entity)
 AssocPersSubentityId.Mirror(Entity)
 AssocPersSubentityId.CreateObjectAndDwgInFields(Database, DwgFiler, ref AssocPersSubentityId)
 AssocPersSubentityId.CreateObjectAndDxfInFields(DxfFiler, ref AssocPersSubentityId)
 AssocPersSubentityId.DwgOutFields(DwgFiler)
 AssocPersSubentityId.DwgInFields(DwgFiler)
 AssocPersSubentityId.DxfOutFields(DxfFiler)
 AssocPersSubentityId.DxfInFields(DxfFiler)
 AssocPersSubentityId.Audit(AuditInfo)
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocSingleEdgePersSubentId()
public AssocSingleEdgePersSubentId()
 AssocSingleEdgePersSubentId(IntPtr, bool)
protected AssocSingleEdgePersSubentId(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 IsNull
public override bool IsNull { get; }
Property Value
bool
Methods
 IsEqualTo(Entity, AssocPersSubentityId)
public override bool IsEqualTo(Entity entity, AssocPersSubentityId other)
Parameters
entity Entity
other AssocPersSubentityId
Returns
bool
 SubentType(Entity)
public override SubentityType SubentType(Entity entity)
Parameters
entity Entity
Returns
SubentityType
 TransientSubentCount(Entity)
public override int TransientSubentCount(Entity entity)
Parameters
entity Entity
Returns
int