Table of Contents
 Class Model
Namespace
Autodesk.AutoCAD.GraphicsSystem
Assembly
Acdbmgd.dll
[Wrapper("AcGsModel")]
public class Model : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Model
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Model(RenderType)
public Model(RenderType renderType)
Parameters
renderType RenderType
 Model(IntPtr, bool)
protected Model(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 BackgroundId
public ObjectId BackgroundId { get; set; }
Property Value
ObjectId
 EnableSectioning
public bool EnableSectioning { get; set; }
Property Value
bool
 LinetypesEnabled
public bool LinetypesEnabled { get; set; }
Property Value
bool
 RenderType
public RenderType RenderType { get; }
Property Value
RenderType
 SectioningVisualStyle
public ObjectId SectioningVisualStyle { set; }
Property Value
ObjectId
 Selectable
public bool Selectable { get; set; }
Property Value
bool
 ShadowPlaneLocation
public double ShadowPlaneLocation { get; set; }
Property Value
double
 Transform
public Matrix3d Transform { get; set; }
Property Value
Matrix3d
 ViewClippingOverride
public bool ViewClippingOverride { set; }
Property Value
bool
 VisualStyle
public VisualStyle VisualStyle { get; set; }
Property Value
VisualStyle
 VisualStyleId
public ObjectId VisualStyleId { get; set; }
Property Value
ObjectId
Methods
 AddSceneGraphRoot(Drawable)
public bool AddSceneGraphRoot(Drawable pRoot)
Parameters
pRoot Drawable
Returns
bool
 Create(IntPtr, bool)
public static Model Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
Model
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 EraseSceneGraphRoot(Drawable)
public bool EraseSceneGraphRoot(Drawable pRoot)
Parameters
pRoot Drawable
Returns
bool
 Invalidate(InvalidationHint)
public void Invalidate(InvalidationHint hint)
Parameters
hint InvalidationHint
 OnAdded(Drawable, Drawable)
public void OnAdded(Drawable added, Drawable parent)
Parameters
added Drawable
parent Drawable
 OnAdded(Drawable, int)
public void OnAdded(Drawable added, int parentId)
Parameters
added Drawable
parentId int
 OnErased(Drawable, Drawable)
public void OnErased(Drawable erased, Drawable parent)
Parameters
erased Drawable
parent Drawable
 OnErased(Drawable, int)
public void OnErased(Drawable erased, int parentId)
Parameters
erased Drawable
parentId int
 OnModified(Drawable, Drawable)
public void OnModified(Drawable modified, Drawable parent)
Parameters
modified Drawable
parent Drawable
 OnModified(Drawable, int)
public void OnModified(Drawable modified, int parentId)
Parameters
modified Drawable
parentId int
 OnPaletteModified()
public void OnPaletteModified()
 SetExtents(Point3d, Point3d)
public void SetExtents(Point3d point3dx, Point3d point3dy)
Parameters
point3dx Point3d
point3dy Point3d
 SetSectioning(Point3dCollection, Vector3d)
public bool SetSectioning(Point3dCollection pts, Vector3d upVector)
Parameters
pts Point3dCollection
upVector Vector3d
Returns
bool
 SetSectioning(Point3dCollection, Vector3d, double, double)
public bool SetSectioning(Point3dCollection pts, Vector3d upVector, double top, double bottom)
Parameters
pts Point3dCollection
upVector Vector3d
top double
bottom double
Returns
bool