Table of Contents
 Enum DetailSymbolOverriddenProperty
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDetailSymbol::OverriddenProperty")]
public enum DetailSymbolOverriddenProperty
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
IdentifierPosition = 2
ModelEdge = 1