Table of Contents
 Class AssocPersSubentityId
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocPersSubentId")]
public abstract class AssocPersSubentityId : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
AssocPersSubentityId
Implements
IDisposable
ICloneable
Derived
AssocSimplePersSubentId
AssocSingleEdgePersSubentId
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocPersSubentityId()
public AssocPersSubentityId()
 AssocPersSubentityId(IntPtr, bool)
protected AssocPersSubentityId(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 IsNull
public abstract bool IsNull { get; }
Property Value
bool
Methods
 Audit(AuditInfo)
public virtual void Audit(AuditInfo auditInfo)
Parameters
auditInfo AuditInfo
 CreateObjectAndDwgInFields(Database, DwgFiler, ref AssocPersSubentityId)
public static void CreateObjectAndDwgInFields(Database database, DwgFiler filer, ref AssocPersSubentityId createdPersSubentId)
Parameters
database Database
filer DwgFiler
createdPersSubentId AssocPersSubentityId
 CreateObjectAndDxfInFields(DxfFiler, ref AssocPersSubentityId)
public static void CreateObjectAndDxfInFields(DxfFiler filer, ref AssocPersSubentityId createdPersSubentId)
Parameters
filer DxfFiler
createdPersSubentId AssocPersSubentityId
 DwgInFields(DwgFiler)
public virtual void DwgInFields(DwgFiler filer)
Parameters
filer DwgFiler
 DwgOutFields(DwgFiler)
public virtual void DwgOutFields(DwgFiler filer)
Parameters
filer DwgFiler
 DxfInFields(DxfFiler)
public virtual void DxfInFields(DxfFiler filer)
Parameters
filer DxfFiler
 DxfOutFields(DxfFiler)
public virtual void DxfOutFields(DxfFiler filer)
Parameters
filer DxfFiler
 GetTransientSubentIds(Entity)
public virtual SubentityId[] GetTransientSubentIds(Entity entity)
Parameters
entity Entity
Returns
SubentityId[]
 IsEqualTo(Entity, AssocPersSubentityId)
public virtual bool IsEqualTo(Entity entity, AssocPersSubentityId other)
Parameters
entity Entity
other AssocPersSubentityId
Returns
bool
 Mirror(Entity)
public virtual void Mirror(Entity mirroredEntity)
Parameters
mirroredEntity Entity
 SubentType(Entity)
public abstract SubentityType SubentType(Entity entity)
Parameters
entity Entity
Returns
SubentityType
 TransientSubentCount(Entity)
public virtual int TransientSubentCount(Entity entity)
Parameters
entity Entity
Returns
int