Table of Contents
 Class TextEditorParagraph
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class TextEditorParagraph : DisposableWrapper, IDisposable, ITextEditorSelectable
Inheritance
object
MarshalByRefObject
DisposableWrapper
TextEditorParagraph
Implements
IDisposable
ITextEditorSelectable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Alignment
public TextEditorParagraph.AlignmentType Alignment { get; set; }
Property Value
TextEditorParagraph.AlignmentType
 EndOfText
public virtual TextEditorLocation EndOfText { get; }
Property Value
TextEditorLocation
 FirstIndent
public double FirstIndent { get; set; }
Property Value
double
 LeftIndent
public double LeftIndent { get; set; }
Property Value
double
 LineSpaceFactor
public double LineSpaceFactor { get; set; }
Property Value
double
 LineSpaceStyle
public TextEditorParagraph.LineSpacingStyle LineSpaceStyle { get; set; }
Property Value
TextEditorParagraph.LineSpacingStyle
 MaxLineSpacingFactor
public double MaxLineSpacingFactor { get; }
Property Value
double
 MaxSpacingValue
public double MaxSpacingValue { get; }
Property Value
double
 MinLineSpacingFactor
public double MinLineSpacingFactor { get; }
Property Value
double
 MinSpacingValue
public double MinSpacingValue { get; }
Property Value
double
 ParaNumberingType
public TextEditorParagraph.NumberingType ParaNumberingType { get; set; }
Property Value
TextEditorParagraph.NumberingType
 RightIndent
public double RightIndent { get; set; }
Property Value
double
 SpaceAfter
public double SpaceAfter { get; set; }
Property Value
double
 SpaceBefore
public double SpaceBefore { get; set; }
Property Value
double
 StartOfText
public virtual TextEditorLocation StartOfText { get; }
Property Value
TextEditorLocation
 TabsCount
public int TabsCount { get; }
Property Value
int
Methods
 AddTab(TextEditorParagraphTab)
public void AddTab(TextEditorParagraphTab tab)
Parameters
tab TextEditorParagraphTab
 ContinueNumbering()
public void ContinueNumbering()
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 GetTab(int)
public TextEditorParagraphTab GetTab(int idx)
Parameters
idx int
Returns
TextEditorParagraphTab
 RemoveTab(TextEditorParagraphTab)
public void RemoveTab(TextEditorParagraphTab tab)
Parameters
tab TextEditorParagraphTab
 RestartNumbering()
public void RestartNumbering()