Table of Contents
 Class Assoc2dConstraintGroup
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssoc2dConstraintGroup")]
public class Assoc2dConstraintGroup : AssocAction, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
AssocAction
Assoc2dConstraintGroup
Implements
IDisposable
ICloneable
Inherited Members
 AssocAction.GetActionBody(ObjectId)
 AssocAction.SetStatus(AssocStatus, bool, bool)
 AssocAction.SetOwningNetwork(ObjectId, bool)
 AssocAction.GetDependencies(bool, bool)
 AssocAction.AddDependency(ObjectId, bool)
 AssocAction.RemoveDependency(ObjectId, bool)
 AssocAction.RemoveAllDependencies(bool)
 AssocAction.GetDependentObjects(bool, bool)
 AssocAction.IsOwnedDependency(AssocDependency)
 AssocAction.IsExternalDependency(AssocDependency)
 AssocAction.IsRelevantDependencyChange(AssocDependency)
 AssocAction.HasDependencyCachedValue(AssocDependency)
 AssocAction.AreDependenciesOnTheSameThing(AssocDependency, AssocDependency)
 AssocAction.AreDependenciesEqual(AssocDependency, AssocDependency)
 AssocAction.GetActionsDependentOnObject(DBObject, bool, bool, ObjectIdCollection)
 AssocAction.GetActionsDependentOnObject(DBObject, bool, bool)
 AssocAction.DependentObjectCloned(AssocDependency, DBObject, DBObject)
 AssocAction.AddMoreObjectsToDeepClone(IdMapping, ObjectIdCollection)
 AssocAction.PostProcessAfterDeepClone(IdMapping)
 AssocAction.PostProcessAfterDeepCloneCancel(IdMapping)
 AssocAction.EvaluateDependencies()
 AssocAction.EvaluateDependency(AssocDependency)
 AssocAction.OwnedDependencyStatusChanged(AssocDependency, AssocStatus)
 AssocAction.IsEqualTo(AssocAction)
 AssocAction.EvaluationPriority()
 AssocAction.GetDependentActionsToEvaluate(ActionsToEvaluateCallback)
 AssocAction.Evaluate(AssocEvaluationCallback)
 AssocAction.ObjectThatOwnsNetworkInstance()
 AssocAction.DragStatus(DragStatus)
 AssocAction.RemoveActionsControllingObject(ObjectId, int, ObjectId)
 AssocAction.RemoveActionsControllingObject(ObjectId, int)
 AssocAction.RemoveActionsControllingObject(ObjectId)
 AssocAction.CurrentEvaluationCallback
 AssocAction.IsActionEvaluationInProgress
 AssocAction.OwningNetwork
 AssocAction.Status
 AssocAction.IsActionBodyAProxy
 AssocAction.ActionBody
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Assoc2dConstraintGroup(Plane)
public Assoc2dConstraintGroup(Plane plane)
Parameters
plane Plane
 Assoc2dConstraintGroup(IntPtr, bool)
protected Assoc2dConstraintGroup(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 ConstrainedGeometries
public ConstrainedGeometry[] ConstrainedGeometries { get; }
Property Value
ConstrainedGeometry[]
 Constraints
public GeometricalConstraint[] Constraints { get; }
Property Value
GeometricalConstraint[]
 GetDOF
public int GetDOF { get; }
Property Value
int
 WorkPlane
public Plane WorkPlane { get; set; }
Property Value
Plane
Methods
 Add3PointAngularConstraint(ConstrainedPoint, ConstrainedPoint, ConstrainedPoint, AngularSectorType, ObjectId, ObjectId)
public ThreePointAngleConstraint Add3PointAngularConstraint(ConstrainedPoint consPoint1, ConstrainedPoint consPoint2, ConstrainedPoint consPoint3, AngularConstraint.AngularSectorType sectorType, ObjectId valueDependencyId, ObjectId dimDependencyId)
Parameters
consPoint1 ConstrainedPoint
consPoint2 ConstrainedPoint
consPoint3 ConstrainedPoint
sectorType AngularConstraint.AngularSectorType
valueDependencyId ObjectId
dimDependencyId ObjectId
Returns
ThreePointAngleConstraint
 AddAngularConstraint(ConstrainedLine, ConstrainedLine, AngularSectorType, ObjectId, ObjectId)
public AngularConstraint AddAngularConstraint(ConstrainedLine consLine1, ConstrainedLine consLine2, AngularConstraint.AngularSectorType sectorType, ObjectId valueDependencyId, ObjectId dimDependencyId)
Parameters
consLine1 ConstrainedLine
consLine2 ConstrainedLine
sectorType AngularConstraint.AngularSectorType
valueDependencyId ObjectId
dimDependencyId ObjectId
Returns
AngularConstraint
 AddConstrainedGeometry(FullSubentityPath)
public ConstrainedGeometry AddConstrainedGeometry(FullSubentityPath subentPath)
Parameters
subentPath FullSubentityPath
Returns
ConstrainedGeometry
 AddDistanceConstraint(ConstrainedGeometry, ConstrainedGeometry, DistanceDirectionType, ObjectId, ObjectId, Vector3d, ConstrainedLine)
public DistanceConstraint AddDistanceConstraint(ConstrainedGeometry consGeom1, ConstrainedGeometry consGeom2, DistanceConstraint.DistanceDirectionType directionType, ObjectId valueDependencyId, ObjectId dimDependencyId, Vector3d fixedDirection, ConstrainedLine directionLine)
Parameters
consGeom1 ConstrainedGeometry
consGeom2 ConstrainedGeometry
directionType DistanceConstraint.DistanceDirectionType
valueDependencyId ObjectId
dimDependencyId ObjectId
fixedDirection Vector3d
directionLine ConstrainedLine
Returns
DistanceConstraint
 AddGeometricalConstraint(ConstraintType, ConstrainedGeometry[])
public GeometricalConstraint AddGeometricalConstraint(GeometricalConstraint.ConstraintType type, ConstrainedGeometry[] consGeoms)
Parameters
type GeometricalConstraint.ConstraintType
consGeoms ConstrainedGeometry[]
Returns
GeometricalConstraint
 AddGeometricalConstraint(ConstraintType, FullSubentityPath[])
public GeometricalConstraint AddGeometricalConstraint(GeometricalConstraint.ConstraintType type, FullSubentityPath[] paths)
Parameters
type GeometricalConstraint.ConstraintType
paths FullSubentityPath[]
Returns
GeometricalConstraint
 AddGlobalCallback(Assoc2dConstraintCallback)
public static void AddGlobalCallback(Assoc2dConstraintCallback callback)
Parameters
callback Assoc2dConstraintCallback
 AddRadiusDiameterConstraint(ConstrainedGeometry, RadDiaConstrType, ObjectId, ObjectId)
public RadiusDiameterConstraint AddRadiusDiameterConstraint(ConstrainedGeometry consGeom, RadiusDiameterConstraint.RadDiaConstrType type, ObjectId valueDependencyId, ObjectId dimDependencyId)
Parameters
consGeom ConstrainedGeometry
type RadiusDiameterConstraint.RadDiaConstrType
valueDependencyId ObjectId
dimDependencyId ObjectId
Returns
RadiusDiameterConstraint
 AutoConstrain(FullSubentityPath[], Tolerance, AutoConstrainEvaluationCallback)
public void AutoConstrain(FullSubentityPath[] paths, Tolerance tol, AutoConstrainEvaluationCallback callback)
Parameters
paths FullSubentityPath[]
tol Tolerance
callback AutoConstrainEvaluationCallback
 ConstraintStatus(GeometricalConstraint)
public Assoc2dConstraintGroup.SolutionStatusType ConstraintStatus(GeometricalConstraint constraint)
Parameters
constraint GeometricalConstraint
Returns
Assoc2dConstraintGroup.SolutionStatusType
 DeleteConstrainedGeometry(ObjectId)
public void DeleteConstrainedGeometry(ObjectId geomDependencyId)
Parameters
geomDependencyId ObjectId
 DeleteConstraint(GeometricalConstraint)
public void DeleteConstraint(GeometricalConstraint geomConst)
Parameters
geomConst GeometricalConstraint
 GeometryMirrored(AssocGeomDependency)
public void GeometryMirrored(AssocGeomDependency geomDependency)
Parameters
geomDependency AssocGeomDependency
 GeometryStatus(ConstrainedGeometry)
public Assoc2dConstraintGroup.SolutionStatusType GeometryStatus(ConstrainedGeometry consGeom)
Parameters
consGeom ConstrainedGeometry
Returns
Assoc2dConstraintGroup.SolutionStatusType
 GetAllConnectedGeomDependencies(ObjectIdCollection)
public ObjectIdCollection GetAllConnectedGeomDependencies(ObjectIdCollection srcGeomDependencyIds)
Parameters
srcGeomDependencyIds ObjectIdCollection
Returns
ObjectIdCollection
 GetConstrainedGeometry(AssocGeomDependency)
public ConstrainedGeometry GetConstrainedGeometry(AssocGeomDependency geomDependency)
Parameters
geomDependency AssocGeomDependency
Returns
ConstrainedGeometry
 GetConstrainedGeometry(AssocGeomDependency, ImplicitPointType, int, bool)
public ConstrainedGeometry GetConstrainedGeometry(AssocGeomDependency geomDependency, ImplicitPointType ptType, int defPtIndex, bool bCreateArcLineMid)
Parameters
geomDependency AssocGeomDependency
ptType ImplicitPointType
defPtIndex int
bCreateArcLineMid bool
Returns
ConstrainedGeometry
 GetConstrainedGeometry(FullSubentityPath, bool)
public ConstrainedGeometry GetConstrainedGeometry(FullSubentityPath subentPath, bool createArcLineMid)
Parameters
subentPath FullSubentityPath
createArcLineMid bool
Returns
ConstrainedGeometry
 GetGroupNode(uint)
public ConstraintGroupNode GetGroupNode(uint nodeId)
Parameters
nodeId uint
Returns
ConstraintGroupNode
 GlobalCallback()
public static Assoc2dConstraintCallback GlobalCallback()
Returns
Assoc2dConstraintCallback
 RegenDimensionSystem()
public void RegenDimensionSystem()
 RemoveGlobalCallback(Assoc2dConstraintCallback)
public static void RemoveGlobalCallback(Assoc2dConstraintCallback callback)
Parameters
callback Assoc2dConstraintCallback
 SolutionStatus(bool)
public Assoc2dConstraintGroup.SolutionStatusType SolutionStatus(bool alsoCheckForConstraints)
Parameters
alsoCheckForConstraints bool
Returns
Assoc2dConstraintGroup.SolutionStatusType
 TransformActionBy(Matrix3d)
public void TransformActionBy(Matrix3d transform)
Parameters
transform Matrix3d