Table of Contents
 Enum TextEditorParagraph.LineSpacingStyle
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum TextEditorParagraph.LineSpacingStyle
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
LineSpacingAtLeast = 2
LineSpacingDefault = 0
LineSpacingExactly = 1
LineSpacingMultiple = 3