Table of Contents
 Enum TextEditorStack.StackType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum TextEditorStack.StackType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
DecimalStack = 3
DiagonalStack = 1
HorizontalStack = 0
ToleranceStack = 2