Table of Contents
 Enum LayerStateMasks
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbLayerStateManager::LayerStateMask")]
[Flags]
public enum LayerStateMasks
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Color = 32
CurrentViewport = 512
Frozen = 2
LastRestored = 65536
LineType = 64
LineWeight = 128
Locked = 4
NewViewport = 16
None = 0
On = 1
Plot = 8
PlotStyle = 256
Transparency = 1024