Table of Contents
 Enum VSEdgeModel
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiVisualStyleProperties::EdgeModel")]
public enum VSEdgeModel
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
FacetEdges = 2
Isolines = 1
NoEdges = 0