Table of Contents
 Class Variable
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
public class Variable : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Variable
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Variable(IntPtr, bool)
public Variable(IntPtr pImp, bool autoDelete)
Parameters
pImp IntPtr
autoDelete bool
Properties
 IsLocked
public bool IsLocked { get; }
Property Value
bool
 IsReadOnly
public bool IsReadOnly { get; set; }
Property Value
bool
 Name
public string Name { get; }
Property Value
string
 PrimaryType
public short PrimaryType { get; }
Property Value
short
 Range
public Variable.RangeInfo Range { get; }
Property Value
Variable.RangeInfo
 SecondaryType
public Variable.SecondaryTypeInfo SecondaryType { get; }
Property Value
Variable.SecondaryTypeInfo
 Storage
public Variable.StorageType Storage { get; }
Property Value
Variable.StorageType
 TypeFlags
public short TypeFlags { get; }
Property Value
short
 Value
public object Value { get; set; }
Property Value
object
Methods
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 Reset()
public void Reset()
Events
 Changed
public event VariableChangedEventHandler Changed
Event Type
VariableChangedEventHandler
 Changing
public event VariableChangingEventHandler Changing
Event Type
VariableChangingEventHandler