Table of Contents
 Enum LoftedSurface.LoftSurfaceType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbLoftedSurface::LoftSurfaceType")]
public enum LoftedSurface.LoftSurfaceType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BlendSurface = 1
LoftSurface = 0
NetworkSurface = 2