Table of Contents
 Struct MlineStyleElement
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct MlineStyleElement
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 MlineStyleElement(double, Color, ObjectId)
public MlineStyleElement(double offset, Color color, ObjectId linetypeId)
Parameters
offset double
color Color
linetypeId ObjectId
Properties
 Color
public Color Color { get; }
Property Value
Color
 LinetypeId
public ObjectId LinetypeId { get; }
Property Value
ObjectId
 Offset
[UnitType(UnitType.Distance)]
public double Offset { get; }
Property Value
double
Methods
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string