Table of Contents
 Class CircularArc2d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeCircArc2d")]
public sealed class CircularArc2d : Curve2d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity2d
Curve2d
CircularArc2d
Implements
IDisposable
ICloneable
Inherited Members
 Curve2d.GetInterval()
 Curve2d.SetInterval(Interval)
 Curve2d.GetReverseParameterCurve()
 Curve2d.GetDistanceTo(Curve2d)
 Curve2d.GetDistanceTo(Curve2d, Tolerance)
 Curve2d.GetDistanceTo(Point2d)
 Curve2d.GetDistanceTo(Point2d, Tolerance)
 Curve2d.GetClosestPointTo(Curve2d)
 Curve2d.GetClosestPointTo(Curve2d, Tolerance)
 Curve2d.GetClosestPointTo(Point2d)
 Curve2d.GetClosestPointTo(Point2d, Tolerance)
 Curve2d.GetNormalPoint(Point2d)
 Curve2d.GetNormalPoint(Point2d, Tolerance)
 Curve2d.IsOn(double)
 Curve2d.IsOn(double, Tolerance)
 Curve2d.IsOn(Point2d, out double)
 Curve2d.IsOn(Point2d, out double, Tolerance)
 Curve2d.IsOn(Point2d)
 Curve2d.IsOn(Point2d, Tolerance)
 Curve2d.GetParameterOf(Point2d)
 Curve2d.GetParameterOf(Point2d, Tolerance)
 Curve2d.GetTrimmedOffset(double, OffsetCurveExtensionType)
 Curve2d.GetTrimmedOffset(double, OffsetCurveExtensionType, Tolerance)
 Curve2d.IsClosed()
 Curve2d.IsClosed(Tolerance)
 Curve2d.IsPeriodic(out double)
 Curve2d.IsLinear(out Line2d)
 Curve2d.IsLinear(out Line2d, Tolerance)
 Curve2d.GetLength(double, double)
 Curve2d.GetLength(double, double, Tolerance)
 Curve2d.GetParameterAtLength(double, double, bool)
 Curve2d.GetParameterAtLength(double, double, bool, Tolerance)
 Curve2d.GetArea(double, double)
 Curve2d.GetArea(double, double, Tolerance)
 Curve2d.IsDegenerate(out Entity2d)
 Curve2d.IsDegenerate(out Entity2d, Tolerance)
 Curve2d.GetSplitCurves(double)
 Curve2d.Explode(Interval)
 Curve2d.GetBoundBlockOf(Interval)
 Curve2d.GetOrthoBoundBlockOf(Interval)
 Curve2d.EvaluatePoint(double)
 Curve2d.GetSamplePoints(int)
 Curve2d.GetSamplePoints(double, double, double)
 Curve2d.HasEndPoint
 Curve2d.HasStartPoint
 Curve2d.OrthoBoundBlock
 Curve2d.BoundBlock
 Entity2d.Clone()
 Entity2d.IsEqualTo(Entity2d)
 Entity2d.IsEqualTo(Entity2d, Tolerance)
 Entity2d.TransformBy(Matrix2d)
 Entity2d.TranslateBy(Vector2d)
 Entity2d.RotateBy(double, Point2d)
 Entity2d.Mirror(Line2d)
 Entity2d.ScaleBy(double, Point2d)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 CircularArc2d()
public CircularArc2d()
 CircularArc2d(Point2d, Point2d, Point2d)
public CircularArc2d(Point2d startPoint, Point2d point, Point2d endPoint)
Parameters
startPoint Point2d
point Point2d
endPoint Point2d
 CircularArc2d(Point2d, Point2d, double, bool)
public CircularArc2d(Point2d startPoint, Point2d endPoint, double bulge, bool bulgeFlag)
Parameters
startPoint Point2d
endPoint Point2d
bulge double
bulgeFlag bool
 CircularArc2d(Point2d, double)
public CircularArc2d(Point2d center, double radius)
Parameters
center Point2d
radius double
 CircularArc2d(Point2d, double, double, double, Vector2d, bool)
public CircularArc2d(Point2d center, double radius, double startAngle, double endAngle, Vector2d referenceVector, bool isClockWise)
Parameters
center Point2d
radius double
startAngle double
endAngle double
referenceVector Vector2d
isClockWise bool
Properties
 Center
public Point2d Center { get; set; }
Property Value
Point2d
 EndAngle
public double EndAngle { get; }
Property Value
double
 EndPoint
public Point2d EndPoint { get; }
Property Value
Point2d
 IsClockWise
public bool IsClockWise { get; }
Property Value
bool
 Radius
public double Radius { get; set; }
Property Value
double
 ReferenceVector
public Vector2d ReferenceVector { get; set; }
Property Value
Vector2d
 StartAngle
public double StartAngle { get; }
Property Value
double
 StartPoint
public Point2d StartPoint { get; }
Property Value
Point2d
Methods
 Create(IntPtr, bool)
public static CircularArc2d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
CircularArc2d
 GetTangent(Point2d)
public Line2d GetTangent(Point2d point)
Parameters
point Point2d
Returns
Line2d
 GetTangent(Point2d, Tolerance)
public Line2d GetTangent(Point2d point, Tolerance tolerance)
Parameters
point Point2d
tolerance Tolerance
Returns
Line2d
 IntersectWith(CircularArc2d)
public Point2d[] IntersectWith(CircularArc2d arc)
Parameters
arc CircularArc2d
Returns
Point2d[]
 IntersectWith(CircularArc2d, Tolerance)
public Point2d[] IntersectWith(CircularArc2d arc, Tolerance tolerance)
Parameters
arc CircularArc2d
tolerance Tolerance
Returns
Point2d[]
 IntersectWith(LinearEntity2d)
public Point2d[] IntersectWith(LinearEntity2d line)
Parameters
line LinearEntity2d
Returns
Point2d[]
 IntersectWith(LinearEntity2d, Tolerance)
public Point2d[] IntersectWith(LinearEntity2d line, Tolerance tolerance)
Parameters
line LinearEntity2d
tolerance Tolerance
Returns
Point2d[]
 IsInside(Point2d)
public bool IsInside(Point2d point)
Parameters
point Point2d
Returns
bool
 IsInside(Point2d, Tolerance)
public bool IsInside(Point2d point, Tolerance tolerance)
Parameters
point Point2d
tolerance Tolerance
Returns
bool
 Set(Curve2d, Curve2d, Curve2d, double, double, double)
public void Set(Curve2d curve1, Curve2d curve2, Curve2d curve3, double parameter1, double parameter2, double parameter3)
Parameters
curve1 Curve2d
curve2 Curve2d
curve3 Curve2d
parameter1 double
parameter2 double
parameter3 double
 Set(Curve2d, Curve2d, double, double, double)
public void Set(Curve2d curve1, Curve2d curve2, double radius, double parameter1, double parameter2)
Parameters
curve1 Curve2d
curve2 Curve2d
radius double
parameter1 double
parameter2 double
 Set(Point2d, Point2d, Point2d)
public void Set(Point2d startPoint, Point2d point, Point2d endPoint)
Parameters
startPoint Point2d
point Point2d
endPoint Point2d
 Set(Point2d, Point2d, double, bool)
public void Set(Point2d startPoint, Point2d endPoint, double bulge, bool bulgeFlag)
Parameters
startPoint Point2d
endPoint Point2d
bulge double
bulgeFlag bool
 Set(Point2d, double)
public void Set(Point2d center, double radius)
Parameters
center Point2d
radius double
 Set(Point2d, double, double, double, Vector2d, bool)
public void Set(Point2d center, double radius, double angle1, double angle2, Vector2d referenceVector, bool isClockWise)
Parameters
center Point2d
radius double
angle1 double
angle2 double
referenceVector Vector2d
isClockWise bool
 SetAngles(double, double)
public void SetAngles(double startAngle, double endAngle)
Parameters
startAngle double
endAngle double
 SetToComplement()
public void SetToComplement()