Table of Contents
 Class Curve
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbCurve")]
public abstract class Curve : Entity, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
Entity
Curve
Implements
IDisposable
ICloneable
Derived
Arc
Circle
Ellipse
Leader
Line
Polyline
Polyline2d
Polyline3d
Ray
Spline
Xline
Inherited Members
 Entity.SetLayerId(ObjectId, bool)
 Entity.SetPropertiesFrom(Entity)
 Entity.GetPlane()
 Entity.AddSubentityPaths(FullSubentityPath[])
 Entity.DeleteSubentityPaths(FullSubentityPath[])
 Entity.TransformSubentityPathsBy(FullSubentityPath[], Matrix3d)
 Entity.GetGripPointsAtSubentityPath(FullSubentityPath, GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.MoveGripPointsAtSubentityPaths(FullSubentityPath[], IntPtr[], Vector3d, MoveGripPointsFlags)
 Entity.GetSubentityGeometricExtents(FullSubentityPath)
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, IntPtr, Point3d, Matrix3d, ObjectId[])
 Entity.GetSubentityPathsAtGraphicsMarker(SubentityType, long, Point3d, Matrix3d, int, ObjectId[])
 Entity.GetGraphicsMarkersAtSubentityPathIntPtr(FullSubentityPath)
 Entity.Highlight(FullSubentityPath, bool)
 Entity.Highlight()
 Entity.Unhighlight(FullSubentityPath, bool)
 Entity.Unhighlight()
 Entity.PushHighlight(FullSubentityPath, HighlightStyle)
 Entity.PopHighlight(FullSubentityPath)
 Entity.HighlightState(FullSubentityPath)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection, Matrix3d)
 Entity.GetObjectSnapPoints(ObjectSnapModes, int, Point3d, Point3d, Matrix3d, Point3dCollection, IntegerCollection)
 Entity.IsContentSnappable()
 Entity.GetGripPoints(GripDataCollection, double, int, Vector3d, GetGripPointsFlags)
 Entity.GetGripPoints(Point3dCollection, IntegerCollection, IntegerCollection)
 Entity.MoveGripPointsAt(GripDataCollection, Vector3d, MoveGripPointsFlags)
 Entity.MoveGripPointsAt(IntegerCollection, Vector3d)
 Entity.GetStretchPoints(Point3dCollection)
 Entity.MoveStretchPointsAt(IntegerCollection, Vector3d)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.IntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.IntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, IntPtr, IntPtr)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Point3dCollection, long, long)
 Entity.BoundingBoxIntersectWith(Entity, Intersect, Plane, Point3dCollection, long, long)
 Entity.List()
 Entity.TransformBy(Matrix3d)
 Entity.GetTransformedCopy(Matrix3d)
 Entity.GetSubentity(FullSubentityPath)
 Entity.Explode(DBObjectCollection)
 Entity.RecordGraphicsModified(bool)
 Entity.Draw()
 Entity.SaveAs(WorldDraw, SaveType)
 Entity.SetDatabaseDefaults(Database)
 Entity.SetDatabaseDefaults()
 Entity.SetDragStatus(DragStatus)
 Entity.SetGripStatus(GripStatus)
 Entity.SetSubentityGripStatus(GripStatus, FullSubentityPath)
 Entity.JoinEntity(Entity)
 Entity.JoinEntities(Entity[])
 Entity.EdgeStyleId
 Entity.FaceStyleId
 Entity.VisualStyleId
 Entity.ForceAnnoAllVisible
 Entity.BlockName
 Entity.MaterialMapper
 Entity.MaterialId
 Entity.Material
 Entity.ReceiveShadows
 Entity.CastShadows
 Entity.Hyperlinks
 Entity.CloneMeForDragging
 Entity.CompoundObjectTransform
 Entity.GeometricExtents
 Entity.Ecs
 Entity.IsPlanar
 Entity.CollisionType
 Entity.LineWeight
 Entity.Visible
 Entity.LinetypeScale
 Entity.LinetypeId
 Entity.Linetype
 Entity.LayerId
 Entity.Layer
 Entity.PlotStyleNameId
 Entity.PlotStyleName
 Entity.Transparency
 Entity.EntityColor
 Entity.ColorIndex
 Entity.Color
 Entity.BlockId
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Curve(IntPtr, bool)
protected Curve(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 Area
[UnitType(UnitType.Area)]
public virtual double Area { get; }
Property Value
double
 Closed
public bool Closed { get; }
Property Value
bool
 EndParam
[UnitType(UnitType.AngleNotTransformed)]
public virtual double EndParam { get; }
Property Value
double
 EndPoint
public virtual Point3d EndPoint { get; set; }
Property Value
Point3d
 IsPeriodic
public virtual bool IsPeriodic { get; }
Property Value
bool
 Spline
public virtual Spline Spline { get; }
Property Value
Spline
 StartParam
[UnitType(UnitType.AngleNotTransformed)]
public virtual double StartParam { get; }
Property Value
double
 StartPoint
public virtual Point3d StartPoint { get; set; }
Property Value
Point3d
Methods
 CreateFromGeCurve(Curve3d)
public static Curve CreateFromGeCurve(Curve3d geCurve)
Parameters
geCurve Curve3d
Returns
Curve
 CreateFromGeCurve(Curve3d, Tolerance)
public static Curve CreateFromGeCurve(Curve3d geCurve, Tolerance tolerance)
Parameters
geCurve Curve3d
tolerance Tolerance
Returns
Curve
 CreateFromGeCurve(Curve3d, Vector3d)
public static Curve CreateFromGeCurve(Curve3d geCurve, Vector3d __unnamed001)
Parameters
geCurve Curve3d
__unnamed001 Vector3d
Returns
Curve
 CreateFromGeCurve(Curve3d, Vector3d, Tolerance)
public static Curve CreateFromGeCurve(Curve3d geCurve, Vector3d __unnamed001, Tolerance tolerance)
Parameters
geCurve Curve3d
__unnamed001 Vector3d
tolerance Tolerance
Returns
Curve
 Extend(bool, Point3d)
public virtual void Extend(bool extendStart, Point3d toPoint)
Parameters
extendStart bool
toPoint Point3d
 Extend(double)
public virtual void Extend(double newParameter)
Parameters
newParameter double
 GetClosestPointTo(Point3d, Vector3d, bool)
public virtual Point3d GetClosestPointTo(Point3d givenPoint, Vector3d direction, bool extend)
Parameters
givenPoint Point3d
direction Vector3d
extend bool
Returns
Point3d
 GetClosestPointTo(Point3d, bool)
public virtual Point3d GetClosestPointTo(Point3d givenPoint, bool extend)
Parameters
givenPoint Point3d
extend bool
Returns
Point3d
 GetDistAtPoint(Point3d)
public virtual double GetDistAtPoint(Point3d point)
Parameters
point Point3d
Returns
double
 GetDistanceAtParameter(double)
public virtual double GetDistanceAtParameter(double value)
Parameters
value double
Returns
double
 GetFirstDerivative(Point3d)
public virtual Vector3d GetFirstDerivative(Point3d point)
Parameters
point Point3d
Returns
Vector3d
 GetFirstDerivative(double)
public virtual Vector3d GetFirstDerivative(double value)
Parameters
value double
Returns
Vector3d
 GetGeCurve()
public Curve3d GetGeCurve()
Returns
Curve3d
 GetGeCurve(Tolerance)
public Curve3d GetGeCurve(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
Curve3d
 GetOffsetCurves(double)
public virtual DBObjectCollection GetOffsetCurves(double offsetDist)
Parameters
offsetDist double
Returns
DBObjectCollection
 GetOffsetCurvesGivenPlaneNormal(Vector3d, double)
public virtual DBObjectCollection GetOffsetCurvesGivenPlaneNormal(Vector3d normal, double offsetDist)
Parameters
normal Vector3d
offsetDist double
Returns
DBObjectCollection
 GetOrthoProjectedCurve(Plane)
public virtual Curve GetOrthoProjectedCurve(Plane planeToProjectOn)
Parameters
planeToProjectOn Plane
Returns
Curve
 GetParameterAtDistance(double)
public virtual double GetParameterAtDistance(double dist)
Parameters
dist double
Returns
double
 GetParameterAtPoint(Point3d)
public virtual double GetParameterAtPoint(Point3d point)
Parameters
point Point3d
Returns
double
 GetPointAtDist(double)
public virtual Point3d GetPointAtDist(double value)
Parameters
value double
Returns
Point3d
 GetPointAtParameter(double)
public virtual Point3d GetPointAtParameter(double value)
Parameters
value double
Returns
Point3d
 GetProjectedCurve(Plane, Vector3d)
public virtual Curve GetProjectedCurve(Plane planeToProjectOn, Vector3d projectionDirection)
Parameters
planeToProjectOn Plane
projectionDirection Vector3d
Returns
Curve
 GetSecondDerivative(Point3d)
public virtual Vector3d GetSecondDerivative(Point3d point)
Parameters
point Point3d
Returns
Vector3d
 GetSecondDerivative(double)
public virtual Vector3d GetSecondDerivative(double value)
Parameters
value double
Returns
Vector3d
 GetSplitCurves(DoubleCollection)
public virtual DBObjectCollection GetSplitCurves(DoubleCollection value)
Parameters
value DoubleCollection
Returns
DBObjectCollection
 GetSplitCurves(Point3dCollection)
public virtual DBObjectCollection GetSplitCurves(Point3dCollection points)
Parameters
points Point3dCollection
Returns
DBObjectCollection
 ReverseCurve()
public virtual void ReverseCurve()
 SetFromGeCurve(Curve3d)
public void SetFromGeCurve(Curve3d geCurve)
Parameters
geCurve Curve3d
 SetFromGeCurve(Curve3d, Tolerance)
public void SetFromGeCurve(Curve3d geCurve, Tolerance tolerance)
Parameters
geCurve Curve3d
tolerance Tolerance
 SetFromGeCurve(Curve3d, Vector3d)
public void SetFromGeCurve(Curve3d geCurve, Vector3d __unnamed001)
Parameters
geCurve Curve3d
__unnamed001 Vector3d
 SetFromGeCurve(Curve3d, Vector3d, Tolerance)
public void SetFromGeCurve(Curve3d geCurve, Vector3d __unnamed001, Tolerance tolerance)
Parameters
geCurve Curve3d
__unnamed001 Vector3d
tolerance Tolerance