Table of Contents
 Delegate AddObjectSnapInfo
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public delegate void AddObjectSnapInfo(ObjectSnapContext context, ObjectSnapInfo result)
Parameters
context ObjectSnapContext
result ObjectSnapInfo
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AddObjectSnapInfo(object, IntPtr)
public AddObjectSnapInfo(object A_0, IntPtr A_1)
Parameters
A_0 object
A_1 IntPtr
Methods
 BeginInvoke(ObjectSnapContext, ObjectSnapInfo, AsyncCallback, object)
public IAsyncResult BeginInvoke(ObjectSnapContext context, ObjectSnapInfo result, AsyncCallback callback, object obj)
Parameters
context ObjectSnapContext
result ObjectSnapInfo
callback AsyncCallback
obj object
Returns
IAsyncResult
 EndInvoke(IAsyncResult)
public void EndInvoke(IAsyncResult result)
Parameters
result IAsyncResult
 Invoke(ObjectSnapContext, ObjectSnapInfo)
public void Invoke(ObjectSnapContext context, ObjectSnapInfo result)
Parameters
context ObjectSnapContext
result ObjectSnapInfo