Table of Contents
 Enum TextHorizontalMode
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::TextHorzMode")]
public enum TextHorizontalMode
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
TextAlign = 3
TextCenter = 1
TextFit = 5
TextLeft = 0
TextMid = 4
TextRight = 2