Table of Contents
 Enum TypeOfCoordinates
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbGeoData::TypeOfCoordinates")]
public enum TypeOfCoordinates
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CoordinateTypeGeographic = 3
CoordinateTypeGrid = 2
CoordinateTypeLocal = 1
CoordinateTypeUnknown = 0