Table of Contents
 Class ConstrainedCircle
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcConstrainedCircle")]
public class ConstrainedCircle : ConstrainedCurve, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
ConstraintGroupNode
ConstrainedGeometry
ConstrainedCurve
ConstrainedCircle
Implements
IDisposable
ICloneable
Derived
ConstrainedArc
Inherited Members
 ConstrainedCurve.ConstrainedImplicitPoints
 ConstrainedCurve.IsBounded
 ConstrainedGeometry.CommonConstraints(ConstrainedGeometry)
 ConstrainedGeometry.FullSubentityPaths
 ConstrainedGeometry.ConnectedGeometries
 ConstrainedGeometry.ConnectedConstraints
 ConstrainedGeometry.OwningRigidSet
 ConstrainedGeometry.GeomDependencyId
 ConstrainedGeometry.IsReadOnly
 ConstraintGroupNode.OwningConstraintGroupId
 ConstraintGroupNode.NodeId
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ConstrainedCircle()
public ConstrainedCircle()
 ConstrainedCircle(ObjectId)
public ConstrainedCircle(ObjectId geomDependencyId)
Parameters
geomDependencyId ObjectId
 ConstrainedCircle(IntPtr, bool)
protected ConstrainedCircle(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 CenterPoint
public Point3d CenterPoint { get; }
Property Value
Point3d
 Radius
public double Radius { get; }
Property Value
double