Table of Contents
 Enum DeviationType
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiDeviationType")]
public enum DeviationType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
MaxDevForBoundary = 2
MaxDevForCircle = 0
MaxDevForCurve = 1
MaxDevForFacet = 4
MaxDevForIsoline = 3