Table of Contents
 Class Plane
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGePlane")]
public sealed class Plane : PlanarEntity, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
Surface
PlanarEntity
Plane
Implements
IDisposable
ICloneable
Inherited Members
 PlanarEntity.IsPerpendicularTo(PlanarEntity)
 PlanarEntity.IsPerpendicularTo(PlanarEntity, Tolerance)
 PlanarEntity.IsPerpendicularTo(LinearEntity3d)
 PlanarEntity.IsPerpendicularTo(LinearEntity3d, Tolerance)
 PlanarEntity.IsParallelTo(PlanarEntity)
 PlanarEntity.IsParallelTo(PlanarEntity, Tolerance)
 PlanarEntity.IsParallelTo(LinearEntity3d)
 PlanarEntity.IsParallelTo(LinearEntity3d, Tolerance)
 PlanarEntity.IntersectWith(LinearEntity3d)
 PlanarEntity.IntersectWith(LinearEntity3d, Tolerance)
 PlanarEntity.ClosestPointToLinearEntity(LinearEntity3d)
 PlanarEntity.ClosestPointToLinearEntity(LinearEntity3d, Tolerance)
 PlanarEntity.ClosestPointToPlanarEntity(PlanarEntity)
 PlanarEntity.ClosestPointToPlanarEntity(PlanarEntity, Tolerance)
 PlanarEntity.IsCoplanarTo(PlanarEntity)
 PlanarEntity.IsCoplanarTo(PlanarEntity, Tolerance)
 PlanarEntity.GetCoordinateSystem()
 PlanarEntity.Coefficients
 PlanarEntity.Normal
 PlanarEntity.PointOnPlane
 Surface.GetClosestPointTo(Point3d)
 Surface.GetClosestPointTo(Point3d, Tolerance)
 Surface.GetEnvelope()
 Surface.ParameterOf(Point3d)
 Surface.ParameterOf(Point3d, Tolerance)
 Surface.IsOn(Point3d, Point2d)
 Surface.IsOn(Point3d, Point2d, Tolerance)
 Surface.ClosestPointTo(Point3d)
 Surface.ClosestPointTo(Point3d, Tolerance)
 Surface.DistanceTo(Point3d)
 Surface.DistanceTo(Point3d, Tolerance)
 Surface.IsClosedInU()
 Surface.IsClosedInU(Tolerance)
 Surface.IsClosedInV()
 Surface.IsClosedInV(Tolerance)
 Surface.EvaluatePoint(Point2d, int, ref Vector3dCollection, ref Vector3d)
 Surface.EvaluatePoint(Point2d, int, ref Vector3dCollection)
 Surface.EvaluatePoint(Point2d)
 Surface.ReverseNormal
 Surface.IsNormalReversed
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.IsOn(Point3d)
 Entity3d.IsOn(Point3d, Tolerance)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 Plane()
public Plane()
 Plane(Plane)
public Plane(Plane source)
Parameters
source Plane
 Plane(Point3d, Point3d, Point3d)
public Plane(Point3d u, Point3d origin, Point3d v)
Parameters
u Point3d
origin Point3d
v Point3d
 Plane(Point3d, Vector3d)
public Plane(Point3d origin, Vector3d normal)
Parameters
origin Point3d
normal Vector3d
 Plane(Point3d, Vector3d, Vector3d)
public Plane(Point3d origin, Vector3d u, Vector3d v)
Parameters
origin Point3d
u Vector3d
v Vector3d
 Plane(double, double, double, double)
public Plane(double a, double b, double c, double d)
Parameters
a double
b double
c double
d double
Methods
 Create(IntPtr, bool)
public static Plane Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
Plane
 GetSignedDistanceTo(Point3d)
public double GetSignedDistanceTo(Point3d pointValue)
Parameters
pointValue Point3d
Returns
double
 IntersectWith(BoundedPlane)
public LineSegment3d IntersectWith(BoundedPlane boundPlane)
Parameters
boundPlane BoundedPlane
Returns
LineSegment3d
 IntersectWith(BoundedPlane, Tolerance)
public LineSegment3d IntersectWith(BoundedPlane boundPlane, Tolerance tolerance)
Parameters
boundPlane BoundedPlane
tolerance Tolerance
Returns
LineSegment3d
 IntersectWith(Plane)
public Line3d IntersectWith(Plane otherPlane)
Parameters
otherPlane Plane
Returns
Line3d
 IntersectWith(Plane, Tolerance)
public Line3d IntersectWith(Plane otherPlane, Tolerance tolerance)
Parameters
otherPlane Plane
tolerance Tolerance
Returns
Line3d
 Set(Point3d, Point3d, Point3d)
public void Set(Point3d u, Point3d origin, Point3d v)
Parameters
u Point3d
origin Point3d
v Point3d
 Set(Point3d, Vector3d)
public void Set(Point3d pointValue, Vector3d normal)
Parameters
pointValue Point3d
normal Vector3d
 Set(Point3d, Vector3d, Vector3d)
public void Set(Point3d origin, Vector3d u, Vector3d v)
Parameters
origin Point3d
u Vector3d
v Vector3d
 Set(double, double, double, double)
public void Set(double a, double b, double c, double d)
Parameters
a double
b double
c double
d double