Table of Contents
 Enum AssocEvaluationMode
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocEvaluationMode")]
public enum AssocEvaluationMode
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ModifyActionAssocEvaluationMode = 1
ModifyObjectsAssocEvaluationMode = 0