Table of Contents
 Class BoundedPlane
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeBoundedPlane")]
public sealed class BoundedPlane : PlanarEntity, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity3d
Surface
PlanarEntity
BoundedPlane
Implements
IDisposable
ICloneable
Inherited Members
 PlanarEntity.IsPerpendicularTo(PlanarEntity)
 PlanarEntity.IsPerpendicularTo(PlanarEntity, Tolerance)
 PlanarEntity.IsPerpendicularTo(LinearEntity3d)
 PlanarEntity.IsPerpendicularTo(LinearEntity3d, Tolerance)
 PlanarEntity.IsParallelTo(PlanarEntity)
 PlanarEntity.IsParallelTo(PlanarEntity, Tolerance)
 PlanarEntity.IsParallelTo(LinearEntity3d)
 PlanarEntity.IsParallelTo(LinearEntity3d, Tolerance)
 PlanarEntity.IntersectWith(LinearEntity3d)
 PlanarEntity.IntersectWith(LinearEntity3d, Tolerance)
 PlanarEntity.ClosestPointToLinearEntity(LinearEntity3d)
 PlanarEntity.ClosestPointToLinearEntity(LinearEntity3d, Tolerance)
 PlanarEntity.ClosestPointToPlanarEntity(PlanarEntity)
 PlanarEntity.ClosestPointToPlanarEntity(PlanarEntity, Tolerance)
 PlanarEntity.IsCoplanarTo(PlanarEntity)
 PlanarEntity.IsCoplanarTo(PlanarEntity, Tolerance)
 PlanarEntity.GetCoordinateSystem()
 PlanarEntity.Coefficients
 PlanarEntity.Normal
 PlanarEntity.PointOnPlane
 Surface.GetClosestPointTo(Point3d)
 Surface.GetClosestPointTo(Point3d, Tolerance)
 Surface.GetEnvelope()
 Surface.ParameterOf(Point3d)
 Surface.ParameterOf(Point3d, Tolerance)
 Surface.IsOn(Point3d, Point2d)
 Surface.IsOn(Point3d, Point2d, Tolerance)
 Surface.ClosestPointTo(Point3d)
 Surface.ClosestPointTo(Point3d, Tolerance)
 Surface.DistanceTo(Point3d)
 Surface.DistanceTo(Point3d, Tolerance)
 Surface.IsClosedInU()
 Surface.IsClosedInU(Tolerance)
 Surface.IsClosedInV()
 Surface.IsClosedInV(Tolerance)
 Surface.EvaluatePoint(Point2d, int, ref Vector3dCollection, ref Vector3d)
 Surface.EvaluatePoint(Point2d, int, ref Vector3dCollection)
 Surface.EvaluatePoint(Point2d)
 Surface.ReverseNormal
 Surface.IsNormalReversed
 Entity3d.Clone()
 Entity3d.IsEqualTo(Entity3d)
 Entity3d.IsEqualTo(Entity3d, Tolerance)
 Entity3d.TransformBy(Matrix3d)
 Entity3d.TranslateBy(Vector3d)
 Entity3d.RotateBy(double, Vector3d, Point3d)
 Entity3d.Mirror(Plane)
 Entity3d.ScaleBy(double, Point3d)
 Entity3d.IsOn(Point3d)
 Entity3d.IsOn(Point3d, Tolerance)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 BoundedPlane()
public BoundedPlane()
 BoundedPlane(Point3d, Point3d, Point3d)
public BoundedPlane(Point3d p1, Point3d origin, Point3d p2)
Parameters
p1 Point3d
origin Point3d
p2 Point3d
 BoundedPlane(Point3d, Vector3d, Vector3d)
public BoundedPlane(Point3d origin, Vector3d u, Vector3d v)
Parameters
origin Point3d
u Vector3d
v Vector3d
Methods
 Create(IntPtr, bool)
public static BoundedPlane Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
BoundedPlane
 IntersectWith(BoundedPlane)
public LineSegment3d IntersectWith(BoundedPlane plane)
Parameters
plane BoundedPlane
Returns
LineSegment3d
 IntersectWith(BoundedPlane, Tolerance)
public LineSegment3d IntersectWith(BoundedPlane plane, Tolerance tolerance)
Parameters
plane BoundedPlane
tolerance Tolerance
Returns
LineSegment3d
 IntersectWith(Plane)
public LineSegment3d IntersectWith(Plane plane)
Parameters
plane Plane
Returns
LineSegment3d
 IntersectWith(Plane, Tolerance)
public LineSegment3d IntersectWith(Plane plane, Tolerance tolerance)
Parameters
plane Plane
tolerance Tolerance
Returns
LineSegment3d
 Set(Point3d, Point3d, Point3d)
public void Set(Point3d p1, Point3d origin, Point3d p2)
Parameters
p1 Point3d
origin Point3d
p2 Point3d
 Set(Point3d, Vector3d, Vector3d)
public void Set(Point3d origin, Vector3d u, Vector3d v)
Parameters
origin Point3d
u Vector3d
v Vector3d