Table of Contents
 Enum SelectionFlags
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Flags]
[Wrapper("AcGiSubEntityTraits::SelectionFlags")]
public enum SelectionFlags
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
None = 0
SelectionIgnore = 1