Table of Contents
 Enum RigidSetTypeInfo
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum RigidSetTypeInfo
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
NonScalableRigidSet = 2
NotRigidSet = 0
ScalableRigidSet = 1