Table of Contents
 Struct TableHitTestInfo
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct TableHitTestInfo
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Properties
 Column
public int Column { get; }
Property Value
int
 Row
public int Row { get; }
Property Value
int
 Type
public TableHitTestType Type { get; }
Property Value
TableHitTestType
Methods
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string