Table of Contents
 Struct Vector3d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeVector3d")]
public struct Vector3d : IFormattable
Implements
IFormattable
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 Vector3d(PlanarEntity, Vector2d)
public Vector3d(PlanarEntity plane, Vector2d vector2d)
Parameters
plane PlanarEntity
vector2d Vector2d
 Vector3d(double, double, double)
public Vector3d(double x, double y, double z)
Parameters
x double
y double
z double
 Vector3d(double[])
public Vector3d(double[] xyz)
Parameters
xyz double[]
Properties
 this[int]
public double this[int i] { get; }
Parameters
i int
Property Value
double
 LargestElement
public int LargestElement { get; }
Property Value
int
 Length
public double Length { get; }
Property Value
double
 LengthSqrd
public double LengthSqrd { get; }
Property Value
double
 X
public double X { get; }
Property Value
double
 XAxis
public static Vector3d XAxis { get; }
Property Value
Vector3d
 Y
public double Y { get; }
Property Value
double
 YAxis
public static Vector3d YAxis { get; }
Property Value
Vector3d
 Z
public double Z { get; }
Property Value
double
 ZAxis
public static Vector3d ZAxis { get; }
Property Value
Vector3d
Methods
 Add(Vector3d)
public Vector3d Add(Vector3d v)
Parameters
v Vector3d
Returns
Vector3d
 AngleOnPlane(PlanarEntity)
public double AngleOnPlane(PlanarEntity plane)
Parameters
plane PlanarEntity
Returns
double
 Convert2d(PlanarEntity)
public Vector2d Convert2d(PlanarEntity plane)
Parameters
plane PlanarEntity
Returns
Vector2d
 CrossProduct(Vector3d)
public Vector3d CrossProduct(Vector3d vector)
Parameters
vector Vector3d
Returns
Vector3d
 DivideBy(double)
public Vector3d DivideBy(double value)
Parameters
value double
Returns
Vector3d
 DotProduct(Vector3d)
public double DotProduct(Vector3d v)
Parameters
v Vector3d
Returns
double
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetAngleTo(Vector3d)
public double GetAngleTo(Vector3d vector)
Parameters
vector Vector3d
Returns
double
 GetAngleTo(Vector3d, Vector3d)
public double GetAngleTo(Vector3d vector, Vector3d referenceVector)
Parameters
vector Vector3d
referenceVector Vector3d
Returns
double
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 GetNormal()
public Vector3d GetNormal()
Returns
Vector3d
 GetNormal(Tolerance)
public Vector3d GetNormal(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
Vector3d
 GetPerpendicularVector()
public Vector3d GetPerpendicularVector()
Returns
Vector3d
 IsCodirectionalTo(Vector3d)
public bool IsCodirectionalTo(Vector3d vector)
Parameters
vector Vector3d
Returns
bool
 IsCodirectionalTo(Vector3d, Tolerance)
public bool IsCodirectionalTo(Vector3d vector, Tolerance tolerance)
Parameters
vector Vector3d
tolerance Tolerance
Returns
bool
 IsEqualTo(Vector3d)
public bool IsEqualTo(Vector3d vector)
Parameters
vector Vector3d
Returns
bool
 IsEqualTo(Vector3d, Tolerance)
public bool IsEqualTo(Vector3d vector, Tolerance tolerance)
Parameters
vector Vector3d
tolerance Tolerance
Returns
bool
 IsParallelTo(Vector3d)
public bool IsParallelTo(Vector3d vector)
Parameters
vector Vector3d
Returns
bool
 IsParallelTo(Vector3d, Tolerance)
public bool IsParallelTo(Vector3d vector, Tolerance tolerance)
Parameters
vector Vector3d
tolerance Tolerance
Returns
bool
 IsPerpendicularTo(Vector3d)
public bool IsPerpendicularTo(Vector3d vector)
Parameters
vector Vector3d
Returns
bool
 IsPerpendicularTo(Vector3d, Tolerance)
public bool IsPerpendicularTo(Vector3d vector, Tolerance tolerance)
Parameters
vector Vector3d
tolerance Tolerance
Returns
bool
 IsUnitLength()
public bool IsUnitLength()
Returns
bool
 IsUnitLength(Tolerance)
public bool IsUnitLength(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 IsZeroLength()
public bool IsZeroLength()
Returns
bool
 IsZeroLength(Tolerance)
public bool IsZeroLength(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 Mirror(Vector3d)
public Vector3d Mirror(Vector3d normalToPlane)
Parameters
normalToPlane Vector3d
Returns
Vector3d
 MultiplyBy(double)
public Vector3d MultiplyBy(double value)
Parameters
value double
Returns
Vector3d
 Negate()
public Vector3d Negate()
Returns
Vector3d
 OrthoProjectTo(Vector3d)
public Vector3d OrthoProjectTo(Vector3d planeNormal)
Parameters
planeNormal Vector3d
Returns
Vector3d
 ProjectTo(Vector3d, Vector3d)
public Vector3d ProjectTo(Vector3d planeNormal, Vector3d projectDirection)
Parameters
planeNormal Vector3d
projectDirection Vector3d
Returns
Vector3d
 RotateBy(double, Vector3d)
public Vector3d RotateBy(double angle, Vector3d axis)
Parameters
angle double
axis Vector3d
Returns
Vector3d
 Subtract(Vector3d)
public Vector3d Subtract(Vector3d v)
Parameters
v Vector3d
Returns
Vector3d
 ToArray()
public double[] ToArray()
Returns
double[]
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
 ToString(string, IFormatProvider)
public string ToString(string format, IFormatProvider provider)
Parameters
format string
provider IFormatProvider
Returns
string
 TransformBy(Matrix3d)
public Vector3d TransformBy(Matrix3d leftSide)
Parameters
leftSide Matrix3d
Returns
Vector3d
Operators
 operator +(Vector3d, Vector3d)
public static Vector3d operator +(Vector3d a, Vector3d b)
Parameters
a Vector3d
b Vector3d
Returns
Vector3d
 operator /(Vector3d, double)
public static Vector3d operator /(Vector3d a, double factor)
Parameters
a Vector3d
factor double
Returns
Vector3d
 operator ==(Vector3d, Vector3d)
public static bool operator ==(Vector3d a, Vector3d b)
Parameters
a Vector3d
b Vector3d
Returns
bool
 operator !=(Vector3d, Vector3d)
public static bool operator !=(Vector3d a, Vector3d b)
Parameters
a Vector3d
b Vector3d
Returns
bool
 operator *(Matrix3d, Vector3d)
public static Vector3d operator *(Matrix3d a, Vector3d b)
Parameters
a Matrix3d
b Vector3d
Returns
Vector3d
 operator *(Vector3d, double)
public static Vector3d operator *(Vector3d a, double factor)
Parameters
a Vector3d
factor double
Returns
Vector3d
 operator *(double, Vector3d)
public static Vector3d operator *(double factor, Vector3d a)
Parameters
factor double
a Vector3d
Returns
Vector3d
 operator -(Vector3d, Vector3d)
public static Vector3d operator -(Vector3d a, Vector3d b)
Parameters
a Vector3d
b Vector3d
Returns
Vector3d
 operator -(Vector3d)
public static Vector3d operator -(Vector3d a)
Parameters
a Vector3d
Returns
Vector3d