Table of Contents
 Class GeoCoordinateTransformer
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbGeoCoordinateSystemTransformer")]
public class GeoCoordinateTransformer : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
GeoCoordinateTransformer
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 GeoCoordinateTransformer(IntPtr, bool)
protected GeoCoordinateTransformer(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 SourceCSid
public string SourceCSid { get; }
Property Value
string
 TargetCSid
public string TargetCSid { get; }
Property Value
string
Methods
 Create(string, string)
public static GeoCoordinateTransformer Create(string source, string target)
Parameters
source string
target string
Returns
GeoCoordinateTransformer
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 TransformPoint(Point3d)
public Point3d TransformPoint(Point3d sourcePt)
Parameters
sourcePt Point3d
Returns
Point3d
 TransformPoint(string, string, Point3d)
public static Point3d TransformPoint(string source, string target, Point3d sourcePt)
Parameters
source string
target string
sourcePt Point3d
Returns
Point3d
 TransformPoints(Point3dCollection)
public Point3dCollection TransformPoints(Point3dCollection sourcePts)
Parameters
sourcePts Point3dCollection
Returns
Point3dCollection
 TransformPoints(string, string, Point3dCollection)
public static Point3dCollection TransformPoints(string source, string target, Point3dCollection sourcePts)
Parameters
source string
target string
sourcePts Point3dCollection
Returns
Point3dCollection