Table of Contents
 Enum AssocTransformationType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocTransformationType")]
public enum AssocTransformationType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Move = 3
NotSpecified = 0
Rotate = 2
Stretch = 1