Table of Contents
 Class DataAdapter
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDataAdapter")]
public abstract class DataAdapter : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
DataAdapter
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 DataAdapter()
protected DataAdapter()
 DataAdapter(IntPtr, bool)
protected DataAdapter(IntPtr unmanagedObjPtr, bool autoDelete)
Parameters
unmanagedObjPtr IntPtr
autoDelete bool
Properties
 DataAdapterId
public abstract string DataAdapterId { get; }
Property Value
string
 Description
public abstract string Description { get; }
Property Value
string
 Name
public abstract string Name { get; }
Property Value
string
Methods
 CreateDataObject(DataLink)
public abstract LinkedData CreateDataObject(DataLink dataLink)
Parameters
dataLink DataLink
Returns
LinkedData
 GetSourceFiles(DataLink, DataLinkGetSourceContext)
public abstract ArrayList GetSourceFiles(DataLink dataLink, DataLinkGetSourceContext nContext)
Parameters
dataLink DataLink
nContext DataLinkGetSourceContext
Returns
ArrayList
 IsValid(DataLink)
public abstract bool IsValid(DataLink dataLink)
Parameters
dataLink DataLink
Returns
bool
 RepathSourceFiles(DataLink, string, PathOption)
public abstract void RepathSourceFiles(DataLink dataLink, string sBasePath, PathOption nOption)
Parameters
dataLink DataLink
sBasePath string
nOption PathOption
 SourceFileModified(DataLink, string, out UpdateAction)
public abstract void SourceFileModified(DataLink dataLink, string sModifiedFile, out UpdateAction pAction)
Parameters
dataLink DataLink
sModifiedFile string
pAction UpdateAction
 Update(DataLink, LinkedData, UpdateDirection, UpdateOption)
public abstract void Update(DataLink dataLink, LinkedData data, UpdateDirection direction, UpdateOption option)
Parameters
dataLink DataLink
data LinkedData
direction UpdateDirection
option UpdateOption