Table of Contents
 Class ObjectDiffEventArgs
Namespace
Autodesk.AutoCAD.DatabaseServices.Internal
Assembly
Acdbmgd.dll
public class ObjectDiffEventArgs : EventArgs
Inheritance
object
EventArgs
ObjectDiffEventArgs
Inherited Members
 EventArgs.Empty
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 ObjectDiffEventArgs(int, ulong*, int)
public ObjectDiffEventArgs(int drawingId, ulong* handle, int changeType)
Parameters
drawingId int
handle ulong*
changeType int
Properties
 ChangeType
public int ChangeType { get; }
Property Value
int
 DrawingId
public int DrawingId { get; }
Property Value
int
 ObjHandle
public Handle ObjHandle { get; }
Property Value
Handle