Table of Contents
 Enum Poly2dType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::Poly2dType")]
public enum Poly2dType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CubicSplinePoly = 3
FitCurvePoly = 1
QuadSplinePoly = 2
SimplePoly = 0