Table of Contents
 Struct ItemLocator
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbItemLocator")]
public struct ItemLocator
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 ItemLocator(AcDbItemLocator*)
protected ItemLocator(AcDbItemLocator* index)
Parameters
index AcDbItemLocator*
 ItemLocator(int, int, int)
public ItemLocator(int itemIndex, int rowIndex, int levelIndex)
Parameters
itemIndex int
rowIndex int
levelIndex int
Properties
 ItemIndex
public int ItemIndex { get; set; }
Property Value
int
 LevelIndex
public int LevelIndex { get; set; }
Property Value
int
 RowIndex
public int RowIndex { get; set; }
Property Value
int