Table of Contents
 Class FileDependencyManager
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcFileDependencyManager")]
public sealed class FileDependencyManager : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
FileDependencyManager
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 CountEntries
public int CountEntries { get; }
Property Value
int
 IteratorNext
public int IteratorNext { get; }
Property Value
int
Methods
 CreateEntry(string, string, bool, bool)
public int CreateEntry(string feature, string fullFileName, bool affectsGraphics, bool noIncrement)
Parameters
feature string
fullFileName string
affectsGraphics bool
noIncrement bool
Returns
int
 DeleteUnmanagedObject()
protected override sealed void DeleteUnmanagedObject()
 EraseEntry(int, bool)
public void EraseEntry(int index, bool forceRemove)
Parameters
index int
forceRemove bool
 EraseEntry(string, string, bool)
public void EraseEntry(string feature, string fullFileName, bool forceRemove)
Parameters
feature string
fullFileName string
forceRemove bool
 GetEntry(int, bool)
public FileDependencyInfo GetEntry(int index, bool useCachedInfo)
Parameters
index int
useCachedInfo bool
Returns
FileDependencyInfo
 GetEntry(string, string, bool)
public FileDependencyInfo GetEntry(string feature, string fullFileName, bool useCachedInfo)
Parameters
feature string
fullFileName string
useCachedInfo bool
Returns
FileDependencyInfo
 IteratorInitialize(string, bool, bool, bool)
public void IteratorInitialize(string feature, bool modifiedOnly, bool affectsGraphicsOnly, bool walkXRefTree)
Parameters
feature string
modifiedOnly bool
affectsGraphicsOnly bool
walkXRefTree bool
 UpdateEntry(int)
public void UpdateEntry(int index)
Parameters
index int
 UpdateEntry(string, string)
public void UpdateEntry(string feature, string fullFileName)
Parameters
feature string
fullFileName string