Table of Contents
 Class SweepOptionsBuilder
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class SweepOptionsBuilder
Inheritance
object
SweepOptionsBuilder
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 SweepOptionsBuilder()
public SweepOptionsBuilder()
 SweepOptionsBuilder(SweepOptions)
public SweepOptionsBuilder(SweepOptions value)
Parameters
value SweepOptions
Properties
 Align
public SweepOptionsAlignOption Align { get; set; }
Property Value
SweepOptionsAlignOption
 AlignAngle
[UnitType(UnitType.Angle)]
public double AlignAngle { get; set; }
Property Value
double
 AlignStart
public bool AlignStart { get; set; }
Property Value
bool
 Bank
public bool Bank { get; set; }
Property Value
bool
 BasePoint
public Point3d BasePoint { get; set; }
Property Value
Point3d
 CheckIntersections
public bool CheckIntersections { get; set; }
Property Value
bool
 DraftAngle
[UnitType(UnitType.Angle)]
public double DraftAngle { get; set; }
Property Value
double
 EndDraftDist
[UnitType(UnitType.Distance)]
public double EndDraftDist { get; set; }
Property Value
double
 PathEntityTransform
public Matrix3d PathEntityTransform { get; set; }
Property Value
Matrix3d
 ScaleFactor
[UnitType(UnitType.Unitless)]
public double ScaleFactor { get; set; }
Property Value
double
 StartDraftDist
[UnitType(UnitType.Distance)]
public double StartDraftDist { get; set; }
Property Value
double
 SweepEntityTransform
public Matrix3d SweepEntityTransform { get; set; }
Property Value
Matrix3d
 TwistAngle
[UnitType(UnitType.Angle)]
public double TwistAngle { get; set; }
Property Value
double
Methods
 SetPathEntityTransform(Entity, bool)
public void SetPathEntityTransform(Entity pathEnt, bool displayErrorMessages)
Parameters
pathEnt Entity
displayErrorMessages bool
 SetSweepEntityTransform(Entity[], bool)
public void SetSweepEntityTransform(Entity[] sweepEntities, bool displayErrorMessages)
Parameters
sweepEntities Entity[]
displayErrorMessages bool
 ToSweepOptions()
public SweepOptions ToSweepOptions()
Returns
SweepOptions