Table of Contents
 Struct TypedValue
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct TypedValue
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 TypedValue(int)
public TypedValue(int typeCode)
Parameters
typeCode int
 TypedValue(int, object)
public TypedValue(int typeCode, object value)
Parameters
typeCode int
value object
Properties
 TypeCode
public short TypeCode { get; }
Property Value
short
 Value
public object Value { get; }
Property Value
object
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
Operators
 operator ==(TypedValue, TypedValue)
public static bool operator ==(TypedValue a, TypedValue b)
Parameters
a TypedValue
b TypedValue
Returns
bool
 operator !=(TypedValue, TypedValue)
public static bool operator !=(TypedValue a, TypedValue b)
Parameters
a TypedValue
b TypedValue
Returns
bool