Table of Contents
Namespace Autodesk.AutoCAD.DatabaseServices
 Classes
AbstractViewTable
AbstractViewTableRecord
ActionsToEvaluateCallback
AlignedDimension
AngularConstraint
AnnotationScale
Arc
ArcDimension
Assoc2dConstraintCallback
Assoc2dConstraintGroup
AssocAction
AssocActionBody
AssocActionParam
AssocArray
AssocArrayCommonParameters
AssocArrayParameters
AssocArrayPathParameters
AssocArrayPolarParameters
AssocArrayRectangularParameters
AssocAsmBodyActionParam
AssocBlendSurfaceActionBody
AssocCompoundActionParam
AssocDependency
AssocDependencyBody
AssocDependencyPE
AssocDimDependencyBody
AssocDimDependencyBodyBase
AssocDimDependencyBodyBase.NotificationIgnorerDotNet
AssocEdgeActionParam
AssocEdgeChamferActionBody
AssocEdgeFilletActionBody
AssocEvaluationCallback
AssocExtendSurfaceActionBody
AssocExtrudedSurfaceActionBody
AssocFaceActionParam
AssocFilletSurfaceActionBody
AssocGeomDependency
AssocGlobalUtility
AssocLoftedSurfaceActionBody
AssocManager
AssocNetwork
AssocNetworkSurfaceActionBody
AssocObjectTransaction
AssocOffsetSurfaceActionBody
AssocParamBasedActionBody
AssocPatchSurfaceActionBody
AssocPathActionParam
AssocPathBasedSurfaceActionBody
AssocPersSubentityId
AssocPersSubentityIdPE
AssocPlaneSurfaceActionBody
AssocRevolvedSurfaceActionBody
AssocSimplePersSubentId
AssocSingleEdgePersSubentId
AssocSurfaceActionBody
AssocSweptSurfaceActionBody
AssocTrimSurfaceActionBody
AssocValueDependency
AssocValueProviderPE
AssocVariable
AssocVariableCallback
AssocVertexActionParam
AttributeCollection
AttributeDefinition
AttributeReference
AuditInfo
AutoConstrainEvaluationCallback
Background
BeginInsertEventArgs
BeginWblockBlockEventArgs
BeginWblockEntireDatabaseEventArgs
BeginWblockObjectsEventArgs
BeginWblockSelectedObjectsEventArgs
BlendOptions
BlendOptionsBuilder
BlockBegin
BlockEnd
BlockInsertionPointsEventArgs
BlockPropertiesTable
BlockPropertiesTable.AuditError
BlockPropertiesTableColumn
BlockPropertiesTableColumnCollection
BlockPropertiesTableRow
BlockPropertiesTableRowCollection
BlockReference
BlockTable
BlockTableRecord
BlockTableRecordEnumerator
Body
BulgeVertex
BulgeVertexCollection
CallerMustCloseAttribute
Cell
CellBorder
CellBorders
CellContent
CellContentsCollection
CellRange
CenterPointConstraint
Circle
ColinearConstraint
Column
ColumnsCollection
CompositeConstraint
CompoundObjectId
ConcentricConstraint
Constrained2PointsConstructionLine
ConstrainedArc
ConstrainedBoundedEllipse
ConstrainedBoundedLine
ConstrainedCircle
ConstrainedConstructionLine
ConstrainedCurve
ConstrainedDatumLine
ConstrainedEllipse
ConstrainedGeometry
ConstrainedImplicitPoint
ConstrainedLine
ConstrainedPoint
ConstrainedRigidSet
ConstrainedSpline
ConstraintGroupNode
Curve
CustomObjectSnapMode
DBDictionary
DBObject
DBObjectCollection
DBObjectReferenceCollection
DBPoint
DBText
DBVisualStyle
DataAdapter
DataAdapterManager
DataAdapterProvider
DataAdapterSourceFilesException
DataCell
DataCellCollection
DataColumn
DataLink
DataLinkManager
DataTable
Database
DatabaseIOEventArgs
DatabaseSummaryInfoBuilder
DbDictionaryEnumerator
DbHomeView
DetailSymbol
DetailViewStyle
DgnDefinition
DgnReference
DgnUnderlayItem
DiametricDimension
DictionaryWithDefaultDictionary
DimStyleTable
DimStyleTableRecord
Dimension
DimensionStyleOverrule
DistanceConstraint
DrawOrderTable
DwfDefinition
DwfReference
DwgFiler
DxfFiler
DynamicBlockReferenceProperty
DynamicBlockReferencePropertyCollection
DynamicBlockReferencePropertyCollectionEnumerator
DynamicDimensionChangedEventArgs
DynamicDimensionData
DynamicDimensionDataCollection
EdgeRef
Ellipse
Entity
EntityAlignmentEventArgs
EnumConverter
EqualCurvatureConstraint
EqualDistanceConstraint
EqualHelpParameterConstraint
EqualLengthConstraint
EqualRadiusConstraint
ExplicitConstraint
ExtrudedSurface
Face
FaceRecord
FaceRef
FeatureControlFrame
Field
FieldCodeWithChildren
FileDependencyInfo
FileDependencyManager
FixedConstraint
FormattedTableData
G2SmoothConstraint
GeoCoordinateCategory
GeoCoordinateSystem
GeoCoordinateTransformer
GeoLocationData
GeoPositionMarker
GeomRef
GeomapImage
GeometricalConstraint
GeometryOverrule
GradientBackground
Graph
GraphNode
GraphNodeCollection
GripData
GripDataCollection
GripMode
GripModeCollection
GripOverrule
GroundPlaneBackground
Group
Hatch
HatchLoop
Helix
HelpParameter
HighlightOverrule
HighlightStateOverrule
HorizontalConstraint
HostApplicationServices
HyperLink
HyperLinkCollection
IBLBackground
IdMapping
IdMappingEventArgs
Image
ImageBackground
InterferenceProtocolExtension
LayerStateDeletedEventArgs
LayerStateEventArgs
LayerStateManager
LayerStateRenameEventArgs
LayerTable
LayerTableRecord
LayerViewportProperties
Layout
LayoutCopiedEventArgs
LayoutEventArgs
LayoutManager
LayoutRenamedEventArgs
Leader
Light
Line
LineAngularDimension2
LineWeightConverter
LinetypeTable
LinetypeTableRecord
LinkedData
LinkedTableData
LoftOptions
LoftOptionsBuilder
LoftOptionsCheckCurvesOut
LoftProfile
LoftedSurface
LongTransaction
MInsertBlock
MLeader
MLeaderStyle
MText
MTextFragment
MatchProperties
Material
MentalRayRenderSettings
MidPointConstraint
Mline
MlineStyle
MlineStyleElementCollection
MlineStyleElementCollectionEnumerator
ModifiesOwnerAttribute
MultiModesGripPE
NormalConstraint
Notifier
NurbSurface
ObjectClosedEventArgs
ObjectContext
ObjectContextCollection
ObjectContextCollectionEnumerator
ObjectContextManager
ObjectErasedEventArgs
ObjectEventArgs
ObjectIdCollection
ObjectIdGraph
ObjectIdGraphNode
ObjectOverrule
ObjectSnapContext
ObjectSnapInfo
ObjectTypeAttribute
Ole2Frame
OpenCloseTransaction
OpenModeAttribute
OrdinateDimension
OsnapOverrule
ParallelConstraint
ParameterValueSet
ParameterValueSetIncrement
ParameterValueSetList
ParameterValueSetMinMax
PathRef
PdfDefinition
PdfReference
PerpendicularConstraint
PlaceHolder
PlaneSurface
PlotSettings
PlotSettingsValidator
PlotStyleTableChangedEventArgs
Point3AngularDimension
PointCloud
PointCloudClassificationColorRamp
PointCloudColorMap
PointCloudColorRamp
PointCloudCrop
PointCloudDefEx
PointCloudEx
PointCloudItem
PointCoincidenceConstraint
PointCurveConstraint
PolyFaceMesh
PolyFaceMeshVertex
PolygonMesh
PolygonMeshVertex
Polyline
Polyline2d
Polyline3d
PolylineVertex3d
Profile3d
PropertiesOverrule
ProxyEntity
ProxyObject
ProxyResurrectionCompletedEventArgs
RadialDimension
RadialDimensionLarge
RadiusDiameterConstraint
RapidRTRenderSettings
RasterImage
RasterImageDef
RasterVariables
Ray
RegAppTable
RegAppTableRecord
Region
RenderEnvironment
RenderGlobal
RenderSettings
ResultBuffer
ResultBufferEnumerator
RevolveOptions
RevolveOptionsBuilder
RevolveOptionsCheckRevolveCurveOut
RevolvedSurface
RotatedDimension
Row
RowsCollection
Section
SectionManager
SectionSettings
SectionSymbol
SectionViewStyle
SecurityParameters
SequenceEnd
Shape
SkyBackground
Solid
Solid3d
SolidBackground
Spline
SubDMesh
SubentRef
SubentityGeometry
SubentityOverrule
Sun
Surface
SurfaceTrimInfo
SweepOptions
SweepOptionsBuilder
SweepOptionsCheckSweepCurveOut
SweptSurface
SymbolTable
SymbolTableEnumerator
SymbolTableRecord
SymbolUtilityServices
SymmetricConstraint
SystemVariableChangedEventArgs
SystemVariableChangingEventArgs
Table
TableContent
TableEnumerator
TableStyle
TableTemplate
TangentConstraint
TextEditor
TextEditorColumn
TextEditorColumns
TextEditorCursor
TextEditorLocation
TextEditorParagraph
TextEditorSelection
TextEditorSelectionbase
TextEditorWipeout
TextStyleTable
TextStyleTableRecord
ThreePointAngleConstraint
Trace
Transaction
TransactionManager
TransformOverrule
UcsTable
UcsTableRecord
UnderlayDefinition
UnderlayFile
UnderlayHost
UnderlayItem
UnderlayItemCollection
UnderlayLayer
UnderlayLayerCollection
UnderlayReference
UnitTypeAttribute
UnitsConverter
Vertex
Vertex2d
VertexRef
VerticalConstraint
ViewBorder
ViewRepBlockReference
ViewTable
ViewTableRecord
Viewport
ViewportTable
ViewportTableRecord
VisibilityOverrule
WblockNoticeEventArgs
Wipeout
Xline
Xrecord
XrecordEnumerator
XrefBeginOperationEventArgs
XrefComandeeredEventArgs
XrefGraph
XrefGraphNode
XrefPreXrefLockFileEventArgs
XrefRedirectedEventArgs
XrefSubCommandEventArgs
XrefVetoableSubCommandEventArgs
 Structs
AssocActionBody.ValueParam
CellReference
CustomScale
DBDictionaryEntry
DBObjectReference
DataTypeParameter
DatabaseSummaryInfo
DecomposeForSaveReplacementRecord
Extents2d
Extents3d
FieldEvaluationResult
FieldEvaluationStatusResult
FitData
Font
FullDwgVersion
FullSubentityPath
GradientColor
GridPropertyParameter
Handle
IdPair
ItemLocator
MeshDataCollection
MeshFaceterData
MeshPointMap
MeshPointMaps
MlineStyleElement
NurbsData
ObjectId
PCAdsName
PatternDefinition
PlotStyleDescriptor
Rectangle3d
RegionAreaProperties
RenderEnvironment.DoubleRangeParameter
RenderGlobal.DimensionsParameter
RenderGlobal.ProcedureAndDestinationParameter
SectionHitTestInfo
Solid3dMassProperties
SubentityId
SurfaceSliceResults
TableHitTestInfo
TextEditorParagraphTab
TextEditorStack
TypedValue
XrefObjectId
 Interfaces
IParameter
ISpecialValueConverter
ISubObject
ITextEditorSelectable
 Enums
AngleConstraint
AngularConstraint.AngularSectorType
AnnotationType
AnnotativeStates
ApplicationLoadReasons
Assoc2dConstraintGroup.SolutionStatusType
AssocArrayPathParameters.MethodType
AssocArrayPolarParameters.ArcDirection
AssocConstraintType
AssocDraggingState
AssocEvaluationMode
AssocEvaluationPriority
AssocLoftedSurfaceActionBody.ProfileType
AssocStatus
AssocTransformationType
AttachmentPoint
AuditPass
BlendOptions.DriveModeType
BlockConnectionType
BlockPropertiesTable.AuditErrorType
BlockScaling
BooleanOperationType
CellAlignment
CellClass
CellContentLayout
CellContentTypes
CellEdgeMasks
CellMargins
CellOption
CellProperties
CellStates
CellType
ClipBoundaryType
CollisionType
ColumnType
CompoundObjectId.StatusType
ConstrainType
ContentType
DataLinkGetSourceContext
DataLinkOption
DataType
DeepCloneType
DefaultLightingType
DetailSymbolBoundaryType
DetailSymbolOverriddenProperty
DetailViewIdentifierPlacement
DetailViewModelEdge
DimArrowFlag
DimensionCenterMarkType
DistanceConstraint.DistanceDirectionType
DragStatus
DrawLeaderOrderType
DrawMLeaderOrderType
DuplicateRecordCloning
DwgVersion
DxfCode
DynamicBlockReferencePropertyUnitsType
EndCap
EntityVisualStyleType
EraseFlags
FieldCodeFlags
FieldEvaluationContext
FieldEvaluationOptions
FieldEvaluationStatus
FieldFilingOptions
FieldState
FileOpenMode
FilerType
FilletTrimMode
FindFileHint
FlowDirection
FormatOption
FrameSetting
GeoCSProjectionCode
GeoCSType
GeoCSUnit
GeometricalConstraint.ConstraintType
GetGripPointsFlags
GradientPatternType
GraphicsMetafileType
GridLineStyle
GridLineType
GridProperties
GripData.Context
GripData.DrawType
GripData.ReturnValue
GripData.Status
GripMode.ActionType
GripMode.CursorType
GripMode.ModeIdentifier
GripStatus
GsMarkType
HatchEdgeType
HatchLoopTypes
HatchObjectType
HatchPatternType
HatchStyle
ImageDisplayOptions
ImageQuality
ImplicitPointType
IndexCreation
Intersect
JoinStyle
LampColorPreset
LampColorType
LayerEvaluation
LayerStateMasks
LeaderDirectionType
LeaderType
LightingUnits
LineSpacingStyle
LineWeight
LoftOptionsNormalOption
LoftedSurface.LoftSurfaceType
LongTransactionType
MTextFragmentCallbackStatus
MaintenanceReleaseVersion
MeasurementValue
MergeCellStyleOption
MlineJustification
ModelDocViewLabelAlignmentType
ModelDocViewLabelAttachmentPoint
ModelerFlavor
MoveGripPointsFlags
MoveType
MultiModesGripPE.GripType
NewLayerNotification
ObjectSnapModes
Ole2Frame.ItemType
OpenMode
OrthographicView
PaperOrientationStates
ParseOption
PasswordOptions
PathOption
PhysicalIntensityMethod
Planarity
PlotPaperUnit
PlotRotation
PlotSettingsShadePlotType
PlotStyleNameType
PlotType
PointCloudCropType
PointCloudDispOptionOutOfRange
PointCloudItemType
PointCloudProperty
PointCloudPropertyState
PointCloudStylizationType
Poly2dType
Poly3dType
PolyMeshType
RadiusDiameterConstraint.RadDiaConstrType
RapidRTRenderTarget
RenderGlobal.Destination
RenderGlobal.Procedure
ReservedStringEnumType
RigidSetTypeInfo
RotationAngle
RowType
SaveType
ScaleEstimationMethod
SectionGeneration
SectionGeometry
SectionHeight
SectionState
SectionSubItem
SectionType
SectionViewArrowDirection
SectionViewIdentifierPosition
SecurityActions
SecurityAlgorithm
SegmentType
SelectType
ShadePlotResLevel
ShadePlotType
ShadowSamplingMultiplier
SourceType
SplineType
StandardScaleType
StdScaleType
SubentityType
Surface.EdgeExtensionType
Surface.WireframeTypeEnum
SurfaceTrimInfo.TrimRelation
SweepOptionsAlignOption
TableBreakFlowDirection
TableBreakOptions
TableCellType
TableCopyOptions
TableEnumeratorOption
TableFillOptions
TableHitTestType
TableStyleFlags
TableStyleOverride
TextAlignment
TextAlignmentType
TextAngleType
TextAttachmentDirection
TextAttachmentType
TextEditor.ExitStatus
TextEditor.TextFindFlags
TextEditorParagraph.AlignmentType
TextEditorParagraph.LineSpacingStyle
TextEditorParagraph.NumberingType
TextEditorParagraphTab.ParagraphTabType
TextEditorSelectionbase.FlowAlign
TextEditorSelectionbase.InsertTextType
TextEditorStack.StackType
TextHorizontalMode
TextVerticalMode
TimeZone
TypeOfCoordinates
UnderlayLayerState
Unit
UnitType
UnitsValue
UpdateAction
UpdateDirection
UpdateOption
Vertex2dType
Vertex3dType
ViewStyleType
Visibility
XrefNotificationStatus
XrefOperation
XrefStatus
 Delegates
AddObjectSnapInfo
BeginInsertEventHandler
BeginWblockBlockEventHandler
BeginWblockEntireDatabaseEventHandler
BeginWblockObjectsEventHandler
BeginWblockSelectedObjectsEventHandler
BlockInsertionPointsEventHandler
DatabaseIOEventHandler
EntityAlignmentEventHandler
IdMappingEventHandler
LayerStateDeletedEventHandler
LayerStateEventHandler
LayerStateRenameEventHandler
LayoutCopiedEventHandler
LayoutEventHandler
LayoutRenamedEventHandler
MTextFragmentCallback
ObjectClosedEventHandler
ObjectErasedEventHandler
ObjectEventHandler
PlotStyleTableChangedEventHandler
PointCloudColorSchemeChangedEventHandler
ProxyResurrectionCompletedEventHandler
SystemVariableChangedEventHandler
SystemVariableChangingEventHandler
WblockNoticeEventHandler
XrefBeginOperationEventHandler
XrefComandeeredEventHandler
XrefPreXrefLockFileEventHandler
XrefRedirectedEventHandler
XrefSubCommandAbortedEventHandler
XrefSubCommandEndEventHandler
XrefSubCommandStartEventHandler