Table of Contents
 Class PhotographicExposureParameters
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiPhotographicExposureParameters")]
public sealed class PhotographicExposureParameters : ToneOperatorParameters, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
ToneOperatorParameters
PhotographicExposureParameters
Implements
IDisposable
ICloneable
Inherited Members
 ToneOperatorParameters.ExteriorDaylight
 ToneOperatorParameters.MidTones
 ToneOperatorParameters.Contrast
 ToneOperatorParameters.Brightness
 ToneOperatorParameters.ProcessBackground
 ToneOperatorParameters.ColorDifferentiation
 ToneOperatorParameters.ChromaticAdaptation
 ToneOperatorParameters.IsActive
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 PhotographicExposureParameters()
public PhotographicExposureParameters()
 PhotographicExposureParameters(IntPtr, bool)
protected PhotographicExposureParameters(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 Exposure
public double Exposure { get; set; }
Property Value
double
 WhiteColor
public Color WhiteColor { get; }
Property Value
Color
 WhitePoint
public double WhitePoint { get; set; }
Property Value
double
Methods
 CopyFrom(RXObject)
public override sealed void CopyFrom(RXObject source)
Parameters
source RXObject
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
Operators
 operator ==(PhotographicExposureParameters, PhotographicExposureParameters)
public static bool operator ==(PhotographicExposureParameters a, PhotographicExposureParameters b)
Parameters
a PhotographicExposureParameters
b PhotographicExposureParameters
Returns
bool
 operator !=(PhotographicExposureParameters, PhotographicExposureParameters)
public static bool operator !=(PhotographicExposureParameters a, PhotographicExposureParameters b)
Parameters
a PhotographicExposureParameters
b PhotographicExposureParameters
Returns
bool