Table of Contents
 Enum VisualStyleProperty
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiVisualStyleProperties::Property")]
public enum VisualStyleProperty
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BloomEffect = 35
BloomIntensity = 50
BloomRadius = 43
BloomThreshold = 42
BlurAmount = 37
BlurEffect = 33
Color = 51
DepthOfField = 55
DisplayBrightness = 26
DisplayShadowType = 27
DisplayStyle = 25
EdgeColor = 15
EdgeCreaseAngle = 13
EdgeHaloGap = 22
EdgeHidePrecision = 24
EdgeIntersectionColor = 9
EdgeIntersectionLinePattern = 12
EdgeIsolines = 23
EdgeJitterAmount = 19
EdgeModel = 7
EdgeModifier = 14
EdgeObscuredColor = 10
EdgeObscuredLinePattern = 11
EdgeOpacity = 16
EdgeOverhang = 18
EdgeSilhouetteColor = 20
EdgeSilhouetteWidth = 21
EdgeStyle = 8
EdgeTexturePath = 54
EdgeWidth = 17
EdgeWiggleAmount = 53
FaceAdjustment = 45
FaceColorMode = 2
FaceLightingModel = 0
FaceLightingQuality = 1
FaceModifier = 3
FaceMonoColor = 6
FaceOpacity = 4
FaceSpecular = 5
FocusDistance = 56
FocusWidth = 57
InvalidProperty = -1
LightingEnabled = 30
MonoEffect = 32
PastelEffect = 36
PencilAngle = 38
PencilColor = 41
PencilEffect = 34
PencilPattern = 40
PencilScale = 39
PostBrightness = 47
PostContrast = 46
PostPower = 48
PosterizeEffect = 31
PropertyCount = 58
TintColor = 44
TintEffect = 49
Transparency = 52
UseDrawOrder = 28
ViewportTransparency = 29