Table of Contents
 Class GeoCoordinateSystem
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbGeoCoordinateSystem")]
public class GeoCoordinateSystem : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
GeoCoordinateSystem
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 GeoCoordinateSystem(IntPtr, bool)
protected GeoCoordinateSystem(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 CartesianExtents
public Extents2d CartesianExtents { get; }
Property Value
Extents2d
 Datum
public GeoDatum Datum { get; }
Property Value
GeoDatum
 Description
public string Description { get; }
Property Value
string
 EPSGcode
public int EPSGcode { get; }
Property Value
int
 Ellipsoid
public GeoEllipsoid Ellipsoid { get; }
Property Value
GeoEllipsoid
 GeoUnit
public GeoCSUnit GeoUnit { get; }
Property Value
GeoCSUnit
 GeodeticExtents
public Extents2d GeodeticExtents { get; }
Property Value
Extents2d
 ID
public string ID { get; }
Property Value
string
 Offset
public Vector2d Offset { get; }
Property Value
Vector2d
 ProjectionCode
public GeoCSProjectionCode ProjectionCode { get; }
Property Value
GeoCSProjectionCode
 Type
public GeoCSType Type { get; }
Property Value
GeoCSType
 Unit
public UnitsValue Unit { get; }
Property Value
UnitsValue
 UnitScale
public double UnitScale { get; }
Property Value
double
 WktRepresentation
public string WktRepresentation { get; }
Property Value
string
 XmlRepresentation
public string XmlRepresentation { get; }
Property Value
string
Methods
 Create(string)
public static GeoCoordinateSystem Create(string coordSysIdOrFullDef)
Parameters
coordSysIdOrFullDef string
Returns
GeoCoordinateSystem
 CreateAll()
public static GeoCoordinateSystem[] CreateAll()
Returns
GeoCoordinateSystem[]
 CreateAll(GeoCoordinateCategory)
public static GeoCoordinateSystem[] CreateAll(GeoCoordinateCategory coordCategory)
Parameters
coordCategory GeoCoordinateCategory
Returns
GeoCoordinateSystem[]
 CreateAll(ValueType)
public static GeoCoordinateSystem[] CreateAll(ValueType geoPt)
Parameters
geoPt ValueType
Returns
GeoCoordinateSystem[]
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 GetProjectionParamList(bool)
public GeoProjectionParam[] GetProjectionParamList(bool includeSpecialParams)
Parameters
includeSpecialParams bool
Returns
GeoProjectionParam[]