Table of Contents
 Enum DxfCode
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::DxfCode")]
public enum DxfCode
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Alpha = 440
Angle = 50
ArbitraryHandle = 320
AttributePrompt = 3
AttributeTag = 2
BinaryChunk = 310
BlockName = 2
Bool = 290
CLShapeName = 4
CLShapeText = 9
CircleSides = 72
Color = 62
ColorName = 430
ColorRgb = 420
Comment = 999
ControlString = 102
DashLength = 49
Description = 3
DimBlk1 = 6
DimBlk2 = 7
DimPostString = 3
DimStyleName = 3
DimVarHandle = 105
DimensionAlternativePrefixSuffix = 4
DimensionBlock = 5
Elevation = 38
EmbeddedObjectStart = 101
End = -1
ExtendedDataAsciiString = 1000
ExtendedDataBinaryChunk = 1004
ExtendedDataControlString = 1002
ExtendedDataDist = 1041
ExtendedDataHandle = 1005
ExtendedDataInteger16 = 1070
ExtendedDataInteger32 = 1071
ExtendedDataLayerName = 1003
ExtendedDataReal = 1040
ExtendedDataRegAppName = 1001
ExtendedDataScale = 1042
ExtendedDataWorldXCoordinate = 1011
ExtendedDataWorldXDir = 1013
ExtendedDataWorldXDisp = 1012
ExtendedDataWorldYCoordinate = 1021
ExtendedDataWorldYDir = 1023
ExtendedDataWorldYDisp = 1022
ExtendedDataWorldZCoordinate = 1031
ExtendedDataWorldZDir = 1033
ExtendedDataWorldZDisp = 1032
ExtendedDataXCoordinate = 1010
ExtendedDataYCoordinate = 1020
ExtendedDataZCoordinate = 1030
ExtendedInt16 = 400
FirstEntityId = -2
GradientAngle = 460
GradientColCount = 453
GradientColVal = 463
GradientName = 470
GradientObjType = 450
GradientPatType = 451
GradientShift = 461
GradientTintType = 452
GradientTintVal = 462
Handle = 5
HardOwnershipId = 360
HardPointerId = 340
HasSubentities = 66
HeaderId = -2
Int16 = 70
Int32 = 90
Int64 = 160
Int8 = 280
Invalid = -9999
LayerLinetype = 61
LayerName = 8
LayoutName = 410
LineWeight = 370
LinetypeAlign = 72
LinetypeElement = 49
LinetypeName = 6
LinetypePdc = 73
LinetypeProse = 3
LinetypeScale = 48
MlineOffset = 49
MlineStyleName = 2
NormalX = 210
NormalY = 220
NormalZ = 230
Operator = -4
PReactors = -5
PixelScale = 47
PlotStyleNameId = 390
PlotStyleNameType = 380
Real = 40
RegAppFlags = 71
RenderMode = 281
ShapeName = 2
ShapeScale = 46
ShapeXOffset = 44
ShapeYOffset = 45
SoftOwnershipId = 350
SoftPointerId = 330
Start = 0
Subclass = 100
SymbolTableName = 2
SymbolTableRecordComments = 4
SymbolTableRecordName = 2
Text = 1
TextBigFontFile = 4
TextFontFile = 3
TextStyleName = 7
Thickness = 39
TxtSize = 40
TxtStyleFlags = 71
TxtStylePSize = 42
TxtStyleXScale = 41
UcsOrg = 110
UcsOrientationX = 111
UcsOrientationY = 112
ViewBackClip = 44
ViewBrightness = 141
ViewContrast = 142
ViewFrontClip = 43
ViewHeight = 45
ViewLensLength = 42
ViewMode = 71
ViewWidth = 41
ViewportActive = 68
ViewportAspect = 41
ViewportGrid = 76
ViewportHeight = 40
ViewportIcon = 74
ViewportNumber = 69
ViewportSnap = 75
ViewportSnapAngle = 50
ViewportSnapPair = 78
ViewportSnapStyle = 77
ViewportTwist = 51
ViewportVisibility = 67
ViewportZoom = 73
Visibility = 60
XCoordinate = 10
XDataStart = -3
XDictionary = -6
XInt16 = 170
XReal = 140
XRefPath = 1
XTextString = 300
XXInt16 = 270
YCoordinate = 20
ZCoordinate = 30