Table of Contents
 Class AssocArrayPolarParameters
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbAssocArrayPolarParameters")]
public class AssocArrayPolarParameters : AssocArrayCommonParameters, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
AssocArrayParameters
AssocArrayCommonParameters
AssocArrayPolarParameters
Implements
IDisposable
ICloneable
Inherited Members
 AssocArrayCommonParameters.GetRowCount(out string, out string)
 AssocArrayCommonParameters.SetRowCount(int, string, string)
 AssocArrayCommonParameters.GetRowSpacing(out string, out string)
 AssocArrayCommonParameters.SetRowSpacing(double, string, string)
 AssocArrayCommonParameters.GetRowElevation(out string, out string)
 AssocArrayCommonParameters.SetRowElevation(double, string, string)
 AssocArrayCommonParameters.GetLevelCount(out string, out string)
 AssocArrayCommonParameters.SetLevelCount(int, string, string)
 AssocArrayCommonParameters.GetLevelSpacing(out string, out string)
 AssocArrayCommonParameters.SetLevelSpacing(double, string, string)
 AssocArrayCommonParameters.BasePoint
 AssocArrayCommonParameters.BaseNormal
 AssocArrayCommonParameters.BasePlane
 AssocArrayCommonParameters.LevelSpacing
 AssocArrayCommonParameters.LevelCount
 AssocArrayCommonParameters.RowElevation
 AssocArrayCommonParameters.RowSpacing
 AssocArrayCommonParameters.RowCount
 AssocArrayParameters.Commit()
 AssocArrayParameters.Owner
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 RXObject.DeleteUnmanagedObject()
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 AssocArrayPolarParameters()
public AssocArrayPolarParameters()
 AssocArrayPolarParameters(double, double, double, int, int, int, double)
public AssocArrayPolarParameters(double angle, double rowSpacing, double levelSpacing, int itemCount, int rowCount, int levelCount, double rowElevation)
Parameters
angle double
rowSpacing double
levelSpacing double
itemCount int
rowCount int
levelCount int
rowElevation double
 AssocArrayPolarParameters(IntPtr, bool)
protected AssocArrayPolarParameters(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 AngleBetweenItems
public double AngleBetweenItems { get; set; }
Property Value
double
 Direction
public AssocArrayPolarParameters.ArcDirection Direction { get; set; }
Property Value
AssocArrayPolarParameters.ArcDirection
 FillAngle
public double FillAngle { get; set; }
Property Value
double
 ItemCount
public int ItemCount { get; set; }
Property Value
int
 Radius
public double Radius { get; set; }
Property Value
double
 RotateItems
public bool RotateItems { get; set; }
Property Value
bool
 StartAngle
public double StartAngle { get; set; }
Property Value
double
Methods
 GetAngleBetweenItems(out string, out string)
public double GetAngleBetweenItems(out string expression, out string evaluatorId)
Parameters
expression string
evaluatorId string
Returns
double
 GetFillAngle(out string, out string)
public double GetFillAngle(out string expression, out string evaluatorId)
Parameters
expression string
evaluatorId string
Returns
double
 GetItemCount(out string, out string)
public int GetItemCount(out string expression, out string evaluatorId)
Parameters
expression string
evaluatorId string
Returns
int
 GetRadius(out string, out string)
public double GetRadius(out string expression, out string evaluatorId)
Parameters
expression string
evaluatorId string
Returns
double
 GetStartAngle(out string, out string)
public double GetStartAngle(out string expression, out string evaluatorId)
Parameters
expression string
evaluatorId string
Returns
double
 SetAngleBetweenItems(double, string, string)
public void SetAngleBetweenItems(double val, string expression, string evaluatorId)
Parameters
val double
expression string
evaluatorId string
 SetFillAngle(double, string, string)
public void SetFillAngle(double val, string expression, string evaluatorId)
Parameters
val double
expression string
evaluatorId string
 SetItemCount(int, string, string)
public void SetItemCount(int count, string expression, string evaluatorId)
Parameters
count int
expression string
evaluatorId string
 SetRadius(double, string, string)
public void SetRadius(double val, string expression, string evaluatorId)
Parameters
val double
expression string
evaluatorId string
 SetStartAngle(double, string, string)
public void SetStartAngle(double val, string expression, string evaluatorId)
Parameters
val double
expression string
evaluatorId string