Table of Contents
 Enum UpdateOption
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::UpdateOption")]
[Flags]
public enum UpdateOption
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
AllowSourceUpdate = 1048576
ForPreview = 16777216
ForceFullSourceUpdate = 2097152
IncludeXrefs = 33554432
None = 0
OverwriteContentModifiedAfterUpdate = 4194304
OverwriteFormatModifiedAfterUpdate = 8388608
SkipFormat = 131072
UpdateColumnWidth = 524288
UpdateRowHeight = 262144