Table of Contents
 Struct Point2d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGePoint2d")]
public struct Point2d : IFormattable
Implements
IFormattable
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 Point2d(double, double)
public Point2d(double x, double y)
Parameters
x double
y double
 Point2d(double[])
public Point2d(double[] xy)
Parameters
xy double[]
Properties
 this[int]
public double this[int i] { get; }
Parameters
i int
Property Value
double
 Origin
public static Point2d Origin { get; }
Property Value
Point2d
 X
public double X { get; }
Property Value
double
 Y
public double Y { get; }
Property Value
double
Methods
 Add(Vector2d)
public Point2d Add(Vector2d value)
Parameters
value Vector2d
Returns
Point2d
 DivideBy(double)
public Point2d DivideBy(double value)
Parameters
value double
Returns
Point2d
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetAsVector()
public Vector2d GetAsVector()
Returns
Vector2d
 GetDistanceTo(Point2d)
public double GetDistanceTo(Point2d point)
Parameters
point Point2d
Returns
double
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 GetVectorTo(Point2d)
public Vector2d GetVectorTo(Point2d point)
Parameters
point Point2d
Returns
Vector2d
 IsEqualTo(Point2d)
public bool IsEqualTo(Point2d a)
Parameters
a Point2d
Returns
bool
 IsEqualTo(Point2d, Tolerance)
public bool IsEqualTo(Point2d a, Tolerance tolerance)
Parameters
a Point2d
tolerance Tolerance
Returns
bool
 Mirror(Line2d)
public Point2d Mirror(Line2d line)
Parameters
line Line2d
Returns
Point2d
 MultiplyBy(double)
public Point2d MultiplyBy(double value)
Parameters
value double
Returns
Point2d
 RotateBy(double, Point2d)
public Point2d RotateBy(double angle, Point2d origin)
Parameters
angle double
origin Point2d
Returns
Point2d
 ScaleBy(double, Point2d)
public Point2d ScaleBy(double scaleFactor, Point2d origin)
Parameters
scaleFactor double
origin Point2d
Returns
Point2d
 Subtract(Vector2d)
public Point2d Subtract(Vector2d value)
Parameters
value Vector2d
Returns
Point2d
 ToArray()
public double[] ToArray()
Returns
double[]
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
 ToString(string, IFormatProvider)
public string ToString(string format, IFormatProvider provider)
Parameters
format string
provider IFormatProvider
Returns
string
 TransformBy(Matrix2d)
public Point2d TransformBy(Matrix2d leftSide)
Parameters
leftSide Matrix2d
Returns
Point2d
Operators
 operator +(Point2d, Vector2d)
public static Point2d operator +(Point2d a, Vector2d vector)
Parameters
a Point2d
vector Vector2d
Returns
Point2d
 operator /(Point2d, double)
public static Point2d operator /(Point2d a, double value)
Parameters
a Point2d
value double
Returns
Point2d
 operator ==(Point2d, Point2d)
public static bool operator ==(Point2d a, Point2d b)
Parameters
a Point2d
b Point2d
Returns
bool
 operator !=(Point2d, Point2d)
public static bool operator !=(Point2d a, Point2d b)
Parameters
a Point2d
b Point2d
Returns
bool
 operator *(Matrix2d, Point2d)
public static Point2d operator *(Matrix2d mat, Point2d a)
Parameters
mat Matrix2d
a Point2d
Returns
Point2d
 operator *(Point2d, double)
public static Point2d operator *(Point2d a, double value)
Parameters
a Point2d
value double
Returns
Point2d
 operator *(double, Point2d)
public static Point2d operator *(double value, Point2d a)
Parameters
value double
a Point2d
Returns
Point2d
 operator -(Point2d, Point2d)
public static Vector2d operator -(Point2d a, Point2d b)
Parameters
a Point2d
b Point2d
Returns
Vector2d
 operator -(Point2d, Vector2d)
public static Point2d operator -(Point2d a, Vector2d b)
Parameters
a Point2d
b Vector2d
Returns
Point2d