Table of Contents
 Class LayerCollection
Namespace
Autodesk.AutoCAD.LayerManager
Assembly
Acdbmgd.dll
[Wrapper("AcArray<AcDbObjectId>")]
public sealed class LayerCollection : ICollection, IEnumerable
Inheritance
object
LayerCollection
Implements
ICollection
IEnumerable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 Count
public int Count { get; }
Property Value
int
 this[int]
public ObjectId this[int index] { get; }
Parameters
index int
Property Value
ObjectId
Methods
 Add(ObjectId)
public void Add(ObjectId value)
Parameters
value ObjectId
 Clear()
public void Clear()
 Contains(ObjectId)
public bool Contains(ObjectId value)
Parameters
value ObjectId
Returns
bool
 CopyTo(ObjectId[], int)
public void CopyTo(ObjectId[] array, int index)
Parameters
array ObjectId[]
index int
 GetEnumerator()
public IEnumerator GetEnumerator()
Returns
IEnumerator
 Remove(ObjectId)
public void Remove(ObjectId value)
Parameters
value ObjectId