Table of Contents
 Enum VSFaceColorMode
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiVisualStyleProperties::FaceColorMode")]
public enum VSFaceColorMode
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BackgroundColor = 2
Desaturate = 5
Mono = 3
None = 0
ObjectColor = 1
Tint = 4