Table of Contents
 Struct FullDwgVersion
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public struct FullDwgVersion
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 FullDwgVersion(DwgVersion, MaintenanceReleaseVersion)
public FullDwgVersion(DwgVersion majorVersion, MaintenanceReleaseVersion minorVersion)
Parameters
majorVersion DwgVersion
minorVersion MaintenanceReleaseVersion
Properties
 MajorVersion
public DwgVersion MajorVersion { get; }
Property Value
DwgVersion
 MinorVersion
public MaintenanceReleaseVersion MinorVersion { get; }
Property Value
MaintenanceReleaseVersion
Methods
 Equals(object)
public override sealed bool Equals(object other)
Parameters
other object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 ToString()
public override sealed string ToString()
Returns
string
Operators
 operator ==(FullDwgVersion, FullDwgVersion)
public static bool operator ==(FullDwgVersion ver1, FullDwgVersion ver2)
Parameters
ver1 FullDwgVersion
ver2 FullDwgVersion
Returns
bool
 operator !=(FullDwgVersion, FullDwgVersion)
public static bool operator !=(FullDwgVersion ver1, FullDwgVersion ver2)
Parameters
ver1 FullDwgVersion
ver2 FullDwgVersion
Returns
bool