Table of Contents
 Enum CellStates
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::CellState")]
[Flags]
public enum CellStates
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ContentLocked = 1
ContentModifiedAfterUpdate = 8
ContentReadOnly = 2
FormatLocked = 16
FormatModifiedAfterUpdate = 64
FormatReadOnly = 32
Linked = 4
None = 0