Table of Contents
 Class SweepOptionsCheckSweepCurveOut
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class SweepOptionsCheckSweepCurveOut
Inheritance
object
SweepOptionsCheckSweepCurveOut
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 SweepOptionsCheckSweepCurveOut()
public SweepOptionsCheckSweepCurveOut()
Properties
 ApproximateArcLength
[UnitType(UnitType.Distance)]
public double ApproximateArcLength { get; }
Property Value
double
 Closed
public bool Closed { get; }
Property Value
bool
 Planarity
public Planarity Planarity { get; }
Property Value
Planarity
 Point
public Point3d Point { get; }
Property Value
Point3d
 Vector
public Vector3d Vector { get; }
Property Value
Vector3d