Table of Contents
 Struct IdPair
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbIdPair")]
public struct IdPair
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 IdPair(ObjectId, ObjectId, bool, bool, bool)
public IdPair(ObjectId key, ObjectId value, bool isCloned, bool isPrimary, bool isOwnerTranslated)
Parameters
key ObjectId
value ObjectId
isCloned bool
isPrimary bool
isOwnerTranslated bool
Properties
 IsCloned
public bool IsCloned { get; }
Property Value
bool
 IsOwnerTranslated
public bool IsOwnerTranslated { get; }
Property Value
bool
 IsPrimary
public bool IsPrimary { get; }
Property Value
bool
 Key
public ObjectId Key { get; }
Property Value
ObjectId
 Value
public ObjectId Value { get; }
Property Value
ObjectId
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
Operators
 operator ==(IdPair, IdPair)
public static bool operator ==(IdPair a, IdPair b)
Parameters
a IdPair
b IdPair
Returns
bool
 operator !=(IdPair, IdPair)
public static bool operator !=(IdPair a, IdPair b)
Parameters
a IdPair
b IdPair
Returns
bool