Table of Contents
 Enum SurfaceTrimInfo.TrimRelation
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum SurfaceTrimInfo.TrimRelation
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
InsideTool = 0
OutsideTool = 1