Table of Contents
 Enum VariantType
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiVariant::VariantType")]
public enum VariantType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Boolean = 1
Color = 4
Double = 3
Int = 2
String = 5
Table = 6
Undefined = 0