Table of Contents
 Class EllipticalArc2d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeEllipArc2d")]
public sealed class EllipticalArc2d : Curve2d, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
Entity2d
Curve2d
EllipticalArc2d
Implements
IDisposable
ICloneable
Inherited Members
 Curve2d.GetInterval()
 Curve2d.SetInterval(Interval)
 Curve2d.GetReverseParameterCurve()
 Curve2d.GetDistanceTo(Curve2d)
 Curve2d.GetDistanceTo(Curve2d, Tolerance)
 Curve2d.GetDistanceTo(Point2d)
 Curve2d.GetDistanceTo(Point2d, Tolerance)
 Curve2d.GetClosestPointTo(Curve2d)
 Curve2d.GetClosestPointTo(Curve2d, Tolerance)
 Curve2d.GetClosestPointTo(Point2d)
 Curve2d.GetClosestPointTo(Point2d, Tolerance)
 Curve2d.GetNormalPoint(Point2d)
 Curve2d.GetNormalPoint(Point2d, Tolerance)
 Curve2d.IsOn(double)
 Curve2d.IsOn(double, Tolerance)
 Curve2d.IsOn(Point2d, out double)
 Curve2d.IsOn(Point2d, out double, Tolerance)
 Curve2d.IsOn(Point2d)
 Curve2d.IsOn(Point2d, Tolerance)
 Curve2d.GetParameterOf(Point2d)
 Curve2d.GetParameterOf(Point2d, Tolerance)
 Curve2d.GetTrimmedOffset(double, OffsetCurveExtensionType)
 Curve2d.GetTrimmedOffset(double, OffsetCurveExtensionType, Tolerance)
 Curve2d.IsClosed()
 Curve2d.IsClosed(Tolerance)
 Curve2d.IsPeriodic(out double)
 Curve2d.IsLinear(out Line2d)
 Curve2d.IsLinear(out Line2d, Tolerance)
 Curve2d.GetLength(double, double)
 Curve2d.GetLength(double, double, Tolerance)
 Curve2d.GetParameterAtLength(double, double, bool)
 Curve2d.GetParameterAtLength(double, double, bool, Tolerance)
 Curve2d.GetArea(double, double)
 Curve2d.GetArea(double, double, Tolerance)
 Curve2d.IsDegenerate(out Entity2d)
 Curve2d.IsDegenerate(out Entity2d, Tolerance)
 Curve2d.GetSplitCurves(double)
 Curve2d.Explode(Interval)
 Curve2d.GetBoundBlockOf(Interval)
 Curve2d.GetOrthoBoundBlockOf(Interval)
 Curve2d.EvaluatePoint(double)
 Curve2d.GetSamplePoints(int)
 Curve2d.GetSamplePoints(double, double, double)
 Curve2d.HasEndPoint
 Curve2d.HasStartPoint
 Curve2d.OrthoBoundBlock
 Curve2d.BoundBlock
 Entity2d.Clone()
 Entity2d.IsEqualTo(Entity2d)
 Entity2d.IsEqualTo(Entity2d, Tolerance)
 Entity2d.TransformBy(Matrix2d)
 Entity2d.TranslateBy(Vector2d)
 Entity2d.RotateBy(double, Point2d)
 Entity2d.Mirror(Line2d)
 Entity2d.ScaleBy(double, Point2d)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 EllipticalArc2d()
public EllipticalArc2d()
 EllipticalArc2d(CircularArc2d)
public EllipticalArc2d(CircularArc2d arc)
Parameters
arc CircularArc2d
 EllipticalArc2d(Point2d, Vector2d, Vector2d, double, double)
public EllipticalArc2d(Point2d center, Vector2d majorAxis, Vector2d minorAxis, double majorRadius, double minorRadius)
Parameters
center Point2d
majorAxis Vector2d
minorAxis Vector2d
majorRadius double
minorRadius double
 EllipticalArc2d(Point2d, Vector2d, Vector2d, double, double, double, double)
public EllipticalArc2d(Point2d center, Vector2d majorAxis, Vector2d minorAxis, double majorRadius, double minorRadius, double startAngle, double endAngle)
Parameters
center Point2d
majorAxis Vector2d
minorAxis Vector2d
majorRadius double
minorRadius double
startAngle double
endAngle double
Properties
 Center
public Point2d Center { get; set; }
Property Value
Point2d
 EndAngle
public double EndAngle { get; }
Property Value
double
 EndPoint
public Point2d EndPoint { get; }
Property Value
Point2d
 IsClockWise
public bool IsClockWise { get; }
Property Value
bool
 MajorAxis
public Vector2d MajorAxis { get; }
Property Value
Vector2d
 MajorRadius
public double MajorRadius { get; set; }
Property Value
double
 MinorAxis
public Vector2d MinorAxis { get; }
Property Value
Vector2d
 MinorRadius
public double MinorRadius { get; set; }
Property Value
double
 StartAngle
public double StartAngle { get; }
Property Value
double
 StartPoint
public Point2d StartPoint { get; }
Property Value
Point2d
Methods
 Create(IntPtr, bool)
public static EllipticalArc2d Create(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Returns
EllipticalArc2d
 IntersectWith(LinearEntity2d)
public Point2d[] IntersectWith(LinearEntity2d line)
Parameters
line LinearEntity2d
Returns
Point2d[]
 IntersectWith(LinearEntity2d, Tolerance)
public Point2d[] IntersectWith(LinearEntity2d line, Tolerance tolerance)
Parameters
line LinearEntity2d
tolerance Tolerance
Returns
Point2d[]
 IsCircular()
public bool IsCircular()
Returns
bool
 IsCircular(Tolerance)
public bool IsCircular(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 IsInside(Point2d)
public bool IsInside(Point2d point)
Parameters
point Point2d
Returns
bool
 IsInside(Point2d, Tolerance)
public bool IsInside(Point2d point, Tolerance tolerance)
Parameters
point Point2d
tolerance Tolerance
Returns
bool
 Set(CircularArc2d)
public void Set(CircularArc2d arc)
Parameters
arc CircularArc2d
 Set(Point2d, Vector2d, Vector2d, double, double)
public void Set(Point2d center, Vector2d majorAxis, Vector2d minorAxis, double majorRadius, double minorRadius)
Parameters
center Point2d
majorAxis Vector2d
minorAxis Vector2d
majorRadius double
minorRadius double
 Set(Point2d, Vector2d, Vector2d, double, double, double, double)
public void Set(Point2d center, Vector2d majorAxis, Vector2d minorAxis, double majorRadius, double minorRadius, double startAngle, double endAngle)
Parameters
center Point2d
majorAxis Vector2d
minorAxis Vector2d
majorRadius double
minorRadius double
startAngle double
endAngle double
 SetAngles(double, double)
public void SetAngles(double startAngle, double endAngle)
Parameters
startAngle double
endAngle double
 SetAxes(Vector2d, Vector2d)
public void SetAxes(Vector2d majorAxis, Vector2d minorAxis)
Parameters
majorAxis Vector2d
minorAxis Vector2d