Table of Contents
 Class LayerGroup
Namespace
Autodesk.AutoCAD.LayerManager
Assembly
Acdbmgd.dll
[Wrapper("AcLyLayerGroup")]
public class LayerGroup : LayerFilter, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
LayerFilter
LayerGroup
Implements
IDisposable
ICloneable
Inherited Members
 LayerFilter.Filter(LayerTableRecord)
 LayerFilter.CompareTo(LayerFilter)
 LayerFilter.ShowEditor()
 LayerFilter.GetFilterExpressionTree()
 LayerFilter.GenerateNested()
 LayerFilter.FilterExpression
 LayerFilter.DisplayImages
 LayerFilter.IsIdFilter
 LayerFilter.IsProxy
 LayerFilter.AllowDelete
 LayerFilter.DynamicallyGenerated
 LayerFilter.AllowNested
 LayerFilter.NestedFilters
 LayerFilter.Parent
 LayerFilter.AllowRename
 LayerFilter.Name
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 LayerGroup()
public LayerGroup()
 LayerGroup(IntPtr, bool)
protected LayerGroup(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 LayerIds
public LayerCollection LayerIds { get; }
Property Value
LayerCollection
Methods
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()