Table of Contents
 Class IdMapping
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbIdMapping")]
public sealed class IdMapping : RXObject, IDisposable, ICloneable, IEnumerable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
IdMapping
Implements
IDisposable
ICloneable
IEnumerable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 IdMapping()
public IdMapping()
Properties
 DeepCloneContext
public DeepCloneType DeepCloneContext { get; }
Property Value
DeepCloneType
 DestinationDatabase
public Database DestinationDatabase { get; set; }
Property Value
Database
 DuplicateRecordCloning
public DuplicateRecordCloning DuplicateRecordCloning { get; }
Property Value
DuplicateRecordCloning
 this[ObjectId]
public IdPair this[ObjectId key] { get; set; }
Parameters
key ObjectId
Property Value
IdPair
 OriginalDatabase
public Database OriginalDatabase { get; }
Property Value
Database
Methods
 Add(IdPair)
public void Add(IdPair pairToAdd)
Parameters
pairToAdd IdPair
 Change(IdPair)
public void Change(IdPair pairToChange)
Parameters
pairToChange IdPair
 Contains(ObjectId)
public bool Contains(ObjectId key)
Parameters
key ObjectId
Returns
bool
 Delete(ObjectId)
public void Delete(ObjectId key)
Parameters
key ObjectId
 GetEnumerator()
public IEnumerator GetEnumerator()
Returns
IEnumerator
 Lookup(ObjectId)
public IdPair Lookup(ObjectId key)
Parameters
key ObjectId
Returns
IdPair