Table of Contents
 Enum TableStyleOverride
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbTable::TableStyleOverrides")]
public enum TableStyleOverride
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
CellAlignment = 130
CellBackgroundColor = 132
CellBackgroundFillNone = 131
CellBottomGridColor = 138
CellBottomGridLineWeight = 142
CellBottomVisibility = 146
CellContentColor = 133
CellDataType = 148
CellLeftGridColor = 139
CellLeftGridLineWeight = 143
CellLeftVisibility = 147
CellRightGridColor = 137
CellRightGridLineWeight = 141
CellRightVisibility = 145
CellTextHeight = 135
CellTextStyle = 134
CellTopGridColor = 136
CellTopGridLineWeight = 140
CellTopVisibility = 144
DataHorizontalBottomColor = 54
DataHorizontalBottomLineWeight = 84
DataHorizontalBottomVisibility = 114
DataHorizontalInsideColor = 53
DataHorizontalInsideLineWeight = 83
DataHorizontalInsideVisibility = 113
DataHorizontalTopColor = 52
DataHorizontalTopLineWeight = 82
DataHorizontalTopVisibility = 112
DataRowAlignment = 17
DataRowColor = 8
DataRowDataType = 26
DataRowFillColor = 14
DataRowFillNone = 11
DataRowTextHeight = 23
DataRowTextStyle = 20
DataVerticalInsideColor = 56
DataVerticalInsideLineWeight = 86
DataVerticalInsideVisibility = 116
DataVerticalLeftColor = 55
DataVerticalLeftLineWeight = 85
DataVerticalLeftVisibility = 115
DataVerticalRightColor = 57
DataVerticalRightLineWeight = 87
DataVerticalRightVisibility = 117
FlowDirection = 3
HeaderHorizontalBottomColor = 48
HeaderHorizontalBottomLineWeight = 78
HeaderHorizontalBottomVisibility = 108
HeaderHorizontalInsideColor = 47
HeaderHorizontalInsideLineWeight = 77
HeaderHorizontalInsideVisibility = 107
HeaderHorizontalTopColor = 46
HeaderHorizontalTopLineWeight = 76
HeaderHorizontalTopVisibility = 106
HeaderRowAlignment = 16
HeaderRowColor = 7
HeaderRowDataType = 25
HeaderRowFillColor = 13
HeaderRowFillNone = 10
HeaderRowTextHeight = 22
HeaderRowTextStyle = 19
HeaderSuppressed = 2
HeaderVerticalInsideColor = 50
HeaderVerticalInsideLineWeight = 80
HeaderVerticalInsideVisibility = 110
HeaderVerticalLeftColor = 49
HeaderVerticalLeftLineWeight = 79
HeaderVerticalLeftVisibility = 109
HeaderVerticalRightColor = 51
HeaderVerticalRightLineWeight = 81
HeaderVerticalRightVisibility = 111
HorizontalCellMargin = 4
TitleHorizontalBottomColor = 42
TitleHorizontalBottomLineWeight = 72
TitleHorizontalBottomVisibility = 102
TitleHorizontalInsideColor = 41
TitleHorizontalInsideLineWeight = 71
TitleHorizontalInsideVisibility = 101
TitleHorizontalTopColor = 40
TitleHorizontalTopLineWeight = 70
TitleHorizontalTopVisibility = 100
TitleRowAlignment = 15
TitleRowColor = 6
TitleRowDataType = 24
TitleRowFillColor = 12
TitleRowFillNone = 9
TitleRowTextHeight = 21
TitleRowTextStyle = 18
TitleSuppressed = 1
TitleVerticalInsideColor = 44
TitleVerticalInsideLineWeight = 74
TitleVerticalInsideVisibility = 104
TitleVerticalLeftColor = 43
TitleVerticalLeftLineWeight = 73
TitleVerticalLeftVisibility = 103
TitleVerticalRightColor = 45
TitleVerticalRightLineWeight = 75
TitleVerticalRightVisibility = 105
VerticalCellMargin = 5