Table of Contents
 Struct Scale2d
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
[Wrapper("AcGeScale2d")]
public struct Scale2d
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Constructors
 Scale2d(double)
public Scale2d(double factor)
Parameters
factor double
 Scale2d(double, double)
public Scale2d(double x, double y)
Parameters
x double
y double
 Scale2d(double[])
public Scale2d(double[] xy)
Parameters
xy double[]
Properties
 this[int]
public double this[int i] { get; }
Parameters
i int
Property Value
double
 X
public double X { get; }
Property Value
double
 Y
public double Y { get; }
Property Value
double
Methods
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 ExtractScale(Matrix2d)
public static Scale2d ExtractScale(Matrix2d mat)
Parameters
mat Matrix2d
Returns
Scale2d
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 GetMatrix()
public Matrix2d GetMatrix()
Returns
Matrix2d
 Inverse()
public Scale2d Inverse()
Returns
Scale2d
 IsEqualTo(Scale2d)
public bool IsEqualTo(Scale2d a)
Parameters
a Scale2d
Returns
bool
 IsEqualTo(Scale2d, Tolerance)
public bool IsEqualTo(Scale2d a, Tolerance tolerance)
Parameters
a Scale2d
tolerance Tolerance
Returns
bool
 IsProportional()
public bool IsProportional()
Returns
bool
 IsProportional(Tolerance)
public bool IsProportional(Tolerance tolerance)
Parameters
tolerance Tolerance
Returns
bool
 MultiplyBy(double)
public Scale2d MultiplyBy(double factor)
Parameters
factor double
Returns
Scale2d
 PostMultiplyBy(Scale2d)
public Scale2d PostMultiplyBy(Scale2d rightSide)
Parameters
rightSide Scale2d
Returns
Scale2d
 PreMultiplyBy(Scale2d)
public Scale2d PreMultiplyBy(Scale2d leftSide)
Parameters
leftSide Scale2d
Returns
Scale2d
 RemoveScale(Matrix2d)
public static Scale2d RemoveScale(Matrix2d mat)
Parameters
mat Matrix2d
Returns
Scale2d
 ToArray()
public double[] ToArray()
Returns
double[]
 ToString()
public override sealed string ToString()
Returns
string
 ToString(IFormatProvider)
public string ToString(IFormatProvider provider)
Parameters
provider IFormatProvider
Returns
string
Operators
 operator ==(Scale2d, Scale2d)
public static bool operator ==(Scale2d a, Scale2d b)
Parameters
a Scale2d
b Scale2d
Returns
bool
 operator !=(Scale2d, Scale2d)
public static bool operator !=(Scale2d a, Scale2d b)
Parameters
a Scale2d
b Scale2d
Returns
bool
 operator *(Scale2d, Scale2d)
public static Scale2d operator *(Scale2d a, Scale2d b)
Parameters
a Scale2d
b Scale2d
Returns
Scale2d
 operator *(Scale2d, double)
public static Scale2d operator *(Scale2d a, double factor)
Parameters
a Scale2d
factor double
Returns
Scale2d
 operator *(double, Scale2d)
public static Scale2d operator *(double factor, Scale2d a)
Parameters
factor double
a Scale2d
Returns
Scale2d