Table of Contents
 Class IntegerCollectionEnumerator
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public sealed class IntegerCollectionEnumerator : IEnumerator
Inheritance
object
IntegerCollectionEnumerator
Implements
IEnumerator
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 IntegerCollectionEnumerator(IntegerCollection)
public IntegerCollectionEnumerator(IntegerCollection col)
Parameters
col IntegerCollection
Properties
 Current
public int Current { get; }
Property Value
int
Methods
 MoveNext()
public bool MoveNext()
Returns
bool
 Reset()
public void Reset()