Table of Contents
 Enum AssocLoftedSurfaceActionBody.ProfileType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum AssocLoftedSurfaceActionBody.ProfileType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
EndCrossSection = 2
EndGuide = 8
StartCrossSection = 1
StartGuide = 4