Table of Contents
 Class GripData
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public class GripData : DisposableWrapper, IDisposable
Inheritance
object
MarshalByRefObject
DisposableWrapper
GripData
Implements
IDisposable
Inherited Members
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose(bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 GripData()
protected GripData()
Properties
 AlternateBasePoint
public Point3d? AlternateBasePoint { get; set; }
Property Value
Point3d?
 DrawAtDragImageGripPoint
public bool DrawAtDragImageGripPoint { get; set; }
Property Value
bool
 ForcedPickOn
public bool ForcedPickOn { get; set; }
Property Value
bool
 GizmosEnabled
public bool GizmosEnabled { get; set; }
Property Value
bool
 GripPoint
public Point3d GripPoint { get; set; }
Property Value
Point3d
 HotGripInvokesRightClick
public bool HotGripInvokesRightClick { get; set; }
Property Value
bool
 IsPerViewport
public bool IsPerViewport { get; set; }
Property Value
bool
 ModeKeywordsDisabled
public bool ModeKeywordsDisabled { get; set; }
Property Value
bool
 RubberBandLineDisabled
public bool RubberBandLineDisabled { get; set; }
Property Value
bool
 SkipWhenShared
public bool SkipWhenShared { get; set; }
Property Value
bool
 TriggerGrip
public bool TriggerGrip { get; set; }
Property Value
bool
Methods
 DeleteUnmanagedObject()
protected override void DeleteUnmanagedObject()
 GetHotGripDimensionData(ObjectId, double)
public virtual DynamicDimensionDataCollection GetHotGripDimensionData(ObjectId id, double dimScale)
Parameters
id ObjectId
dimScale double
Returns
DynamicDimensionDataCollection
 GetHoverDimensionData(ObjectId, double)
public virtual DynamicDimensionDataCollection GetHoverDimensionData(ObjectId id, double dimScale)
Parameters
id ObjectId
dimScale double
Returns
DynamicDimensionDataCollection
 GetTooltip()
public virtual string GetTooltip()
Returns
string
 OnGripStatusChanged(ObjectId, Status)
public virtual void OnGripStatusChanged(ObjectId entityId, GripData.Status newStatus)
Parameters
entityId ObjectId
newStatus GripData.Status
 OnHotGrip(ObjectId, Context)
public virtual GripData.ReturnValue OnHotGrip(ObjectId entityId, GripData.Context contextFlags)
Parameters
entityId ObjectId
contextFlags GripData.Context
Returns
GripData.ReturnValue
 OnHover(ObjectId, Context)
public virtual GripData.ReturnValue OnHover(ObjectId entityId, GripData.Context contextFlags)
Parameters
entityId ObjectId
contextFlags GripData.Context
Returns
GripData.ReturnValue
 OnRightClick(GripDataCollection, ObjectIdCollection)
public virtual IEnumerable<IMenuItem> OnRightClick(GripDataCollection hotGrips, ObjectIdCollection entities)
Parameters
hotGrips GripDataCollection
entities ObjectIdCollection
Returns
IEnumerable<IMenuItem>
 ViewportDraw(ViewportDraw, ObjectId, DrawType, Point3d?, int)
public virtual bool ViewportDraw(ViewportDraw worldDraw, ObjectId entityId, GripData.DrawType type, Point3d? imageGripPoint, int gripSizeInPixels)
Parameters
worldDraw ViewportDraw
entityId ObjectId
type GripData.DrawType
imageGripPoint Point3d?
gripSizeInPixels int
Returns
bool
 WorldDraw(WorldDraw, ObjectId, DrawType, Point3d?, double)
public virtual bool WorldDraw(WorldDraw worldDraw, ObjectId entityId, GripData.DrawType type, Point3d? imageGripPoint, double dGripSize)
Parameters
worldDraw WorldDraw
entityId ObjectId
type GripData.DrawType
imageGripPoint Point3d?
dGripSize double
Returns
bool