Table of Contents
 Enum DynamicBlockReferencePropertyUnitsType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDynBlockReferenceProperty::UnitsType")]
public enum DynamicBlockReferencePropertyUnitsType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Angular = 1
Area = 3
Distance = 2
NoUnits = 0