Table of Contents
 Enum ColorMethod
Namespace
Autodesk.AutoCAD.Colors
Assembly
Acdbmgd.dll
[Wrapper("AcCmEntityColor::ColorMethod")]
public enum ColorMethod
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
ByAci = 195
ByBlock = 193
ByColor = 194
ByLayer = 192
ByPen = 196
Foreground = 197
LayerFrozen = 199
LayerOff = 198
None = 200