Table of Contents
 Class UInt32CollectionEnumerator
Namespace
Autodesk.AutoCAD.Geometry
Assembly
Acdbmgd.dll
public sealed class UInt32CollectionEnumerator : IEnumerator
Inheritance
object
UInt32CollectionEnumerator
Implements
IEnumerator
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 UInt32CollectionEnumerator(UInt32Collection)
public UInt32CollectionEnumerator(UInt32Collection col)
Parameters
col UInt32Collection
Properties
 Current
public uint Current { get; }
Property Value
uint
Methods
 MoveNext()
public bool MoveNext()
Returns
bool
 Reset()
public void Reset()