Table of Contents
 Enum ImageSource
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiViewportGeometry::ImageSource")]
public enum ImageSource
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
FromDwg = 0
FromOleObject = 1
FromRender = 2