Table of Contents
 Enum FilerType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::FilerType")]
public enum FilerType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
BagFiler = 3
CopyFiler = 1
DeepCloneFiler = 6
FileFiler = 0
IdFiler = 7
IdTranslateFiler = 4
PageFiler = 5
PurgeFiler = 8
UndoFiler = 2
WblockCloneFiler = 9