Table of Contents
 Class DynamicLinker
Namespace
Autodesk.AutoCAD.Runtime
Assembly
Acdbmgd.dll
[Wrapper("AcRxDynamicLinker")]
public sealed class DynamicLinker : RXObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
DynamicLinker
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Properties
 ProductLcid
public int ProductLcid { get; }
Property Value
int
Methods
 GetLoadedModules()
public StringCollection GetLoadedModules()
Returns
StringCollection
 IsAppBusy(string)
public bool IsAppBusy(string moduleName)
Parameters
moduleName string
Returns
bool
 IsAppMdiAware(string)
public bool IsAppMdiAware(string moduleName)
Parameters
moduleName string
Returns
bool
 IsApplicationLocked(string)
public bool IsApplicationLocked(string moduleName)
Parameters
moduleName string
Returns
bool
 IsModuleLoaded(string)
public bool IsModuleLoaded(string fileName)
Parameters
fileName string
Returns
bool
 LoadApp(string, bool, bool)
public void LoadApp(string appName, bool printIt, bool asCmd)
Parameters
appName string
printIt bool
asCmd bool
 LoadModule(string, bool, bool)
public void LoadModule(string fileName, bool printIt, bool asCmd)
Parameters
fileName string
printIt bool
asCmd bool
 SetAppBusy(string, bool)
public void SetAppBusy(string moduleName, bool busyFlag)
Parameters
moduleName string
busyFlag bool
 UnloadApp(string, bool)
public void UnloadApp(string appName, bool asCmd)
Parameters
appName string
asCmd bool
 UnloadModule(string, bool)
public void UnloadModule(string fileName, bool asCmd)
Parameters
fileName string
asCmd bool
Events
 ModuleLoadAborted
public event ModuleLoadAbortedEventHandler ModuleLoadAborted
Event Type
ModuleLoadAbortedEventHandler
 ModuleLoaded
public event ModuleLoadedEventHandler ModuleLoaded
Event Type
ModuleLoadedEventHandler
 ModuleLoading
public event ModuleLoadingEventHandler ModuleLoading
Event Type
ModuleLoadingEventHandler
 ModuleUnloadAborted
public event ModuleUnloadAbortedEventHandler ModuleUnloadAborted
Event Type
ModuleUnloadAbortedEventHandler
 ModuleUnloaded
public event ModuleUnloadedEventHandler ModuleUnloaded
Event Type
ModuleUnloadedEventHandler
 ModuleUnloading
public event ModuleUnloadingEventHandler ModuleUnloading
Event Type
ModuleUnloadingEventHandler