Table of Contents
 Enum TextEditorParagraph.NumberingType
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public enum TextEditorParagraph.NumberingType
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Bullet = 1
LetterLower = 3
LetterLowerWide = 6
LetterUpper = 4
LetterUpperWide = 7
Number = 2
NumberWide = 5
Off = 0