Table of Contents
 Enum DetailViewIdentifierPlacement
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbDetailViewStyle::IdentifierPlacement")]
public enum DetailViewIdentifierPlacement
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
OnBoundary = 2
OnBoundaryWithLeader = 3
OutsideBoundary = 0
OutsideBoundaryWithLeader = 1