Table of Contents
 Enum GridProperties
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDb::GridProperty")]
[Flags]
public enum GridProperties
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
Fields
Color = 8
DoubleLineSpacing = 32
Invalid = 0
LineStyle = 1
LineWeight = 2
Linetype = 4
Visibility = 16