Table of Contents
 Delegate MTextFragmentCallback
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
public delegate MTextFragmentCallbackStatus MTextFragmentCallback(MTextFragment A_0, object A_1)
Parameters
A_0 MTextFragment
A_1 object
Returns
MTextFragmentCallbackStatus
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 MTextFragmentCallback(object, IntPtr)
public MTextFragmentCallback(object A_0, IntPtr A_1)
Parameters
A_0 object
A_1 IntPtr
Methods
 BeginInvoke(MTextFragment, object, AsyncCallback, object)
public IAsyncResult BeginInvoke(MTextFragment __unnamed000, object __unnamed001, AsyncCallback callback, object obj)
Parameters
__unnamed000 MTextFragment
__unnamed001 object
callback AsyncCallback
obj object
Returns
IAsyncResult
 EndInvoke(IAsyncResult)
public MTextFragmentCallbackStatus EndInvoke(IAsyncResult result)
Parameters
result IAsyncResult
Returns
MTextFragmentCallbackStatus
 Invoke(MTextFragment, object)
public MTextFragmentCallbackStatus Invoke(MTextFragment A_0, object A_1)
Parameters
A_0 MTextFragment
A_1 object
Returns
MTextFragmentCallbackStatus