Table of Contents
 Class PlotSettings
Namespace
Autodesk.AutoCAD.DatabaseServices
Assembly
Acdbmgd.dll
[Wrapper("AcDbPlotSettings")]
public class PlotSettings : DBObject, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
Drawable
DBObject
PlotSettings
Implements
IDisposable
ICloneable
Derived
Layout
Inherited Members
 DBObject.SubSetAttributes(DrawableTraits)
 DBObject.SubWorldDraw(WorldDraw)
 DBObject.SubViewportDraw(ViewportDraw)
 DBObject.SubViewportDrawLogicalFlags(ViewportDraw)
 DBObject.DeleteUnmanagedObject()
 DBObject.DeepClone(DBObject, IdMapping, bool)
 DBObject.WblockClone(RXObject, IdMapping, bool)
 DBObject.DecomposeForSave(DwgVersion)
 DBObject.CreateExtensionDictionary()
 DBObject.ReleaseExtensionDictionary()
 DBObject.UpgradeOpen()
 DBObject.UpgradeFromNotify()
 DBObject.DowngradeOpen()
 DBObject.DowngradeToNotify(bool)
 DBObject.Cancel()
 DBObject.Close()
 DBObject.CloseAndPage(bool)
 DBObject.Erase()
 DBObject.Erase(bool)
 DBObject.HandOverTo(DBObject, bool, bool)
 DBObject.SwapIdWith(ObjectId, bool, bool)
 DBObject.SwapReferences(IdMapping)
 DBObject.Audit(AuditInfo)
 DBObject.DwgIn(DwgFiler)
 DBObject.DwgOut(DwgFiler)
 DBObject.DxfIn(DxfFiler)
 DBObject.DxfOut(DxfFiler)
 DBObject.XDataTransformBy(Matrix3d)
 DBObject.GetXDataForApplication(string)
 DBObject.DisableUndoRecording(bool)
 DBObject.ApplyPartialUndo(DwgFiler, RXClass)
 DBObject.HasPersistentReactor(ObjectId)
 DBObject.GetReactors()
 DBObject.GetTransientReactors()
 DBObject.GetPersistentReactorIds()
 DBObject.SetObjectIdsInFlux()
 DBObject.GetObjectSaveVersion(DxfFiler)
 DBObject.GetObjectSaveVersion(DwgFiler)
 DBObject.FromAcadObject(object)
 DBObject.IsCustomObject(ObjectId)
 DBObject.GetField(string)
 DBObject.GetField()
 DBObject.SetField(string, Field)
 DBObject.SetField(Field)
 DBObject.RemoveField(ObjectId)
 DBObject.RemoveField(string)
 DBObject.RemoveField()
 DBObject.SetFromStyle()
 DBObject.ResetScaleDependentProperties()
 DBObject.SetPaperOrientation(bool)
 DBObject.ApplyPaperOrientationTransform(Viewport)
 DBObject.SupportsCollection(string)
 DBObject.HasContext(ObjectContext)
 DBObject.AddContext(ObjectContext)
 DBObject.RemoveContext(ObjectContext)
 DBObject.GetEventExtender(bool)
 DBObject.GetParameterInterface(string, bool)
 DBObject.Dispose(bool)
 DBObject.PaperOrientation
 DBObject.Annotative
 DBObject.HasFields
 DBObject.AcadObject
 DBObject.ClassID
 DBObject.ObjectBirthVersion
 DBObject.HasSaveVersionOverride
 DBObject.IsObjectIdsInFlux
 DBObject.UndoFiler
 DBObject.IsAProxy
 DBObject.IsTransactionResident
 DBObject.IsReallyClosing
 DBObject.IsCancelling
 DBObject.IsUndoing
 DBObject.IsNotifying
 DBObject.IsNewObject
 DBObject.IsModifiedGraphics
 DBObject.IsModifiedXData
 DBObject.IsModified
 DBObject.IsNotifyEnabled
 DBObject.IsWriteEnabled
 DBObject.IsReadEnabled
 DBObject.IsErased
 DBObject.IsEraseStatusToggled
 DBObject.XData
 DBObject.MergeStyle
 DBObject.ExtensionDictionary
 DBObject.Drawable
 DBObject.Database
 DBObject.Handle
 DBObject.OwnerId
 DBObject.ObjectId
 DBObject.Id
 DBObject.IsPersistent
 DBObject.ObjectClosed
 DBObject.Reappended
 DBObject.Unappended
 DBObject.ModifiedXData
 DBObject.ModifyUndone
 DBObject.SubObjectModified
 DBObject.Modified
 DBObject.OpenedForModify
 DBObject.Goodbye
 DBObject.Erased
 DBObject.Copied
 DBObject.Cancelled
 Drawable.SetAttributes(DrawableTraits)
 Drawable.WorldDraw(WorldDraw)
 Drawable.ViewportDraw(ViewportDraw)
 Drawable.ViewportDrawLogicalFlags(ViewportDraw)
 Drawable.DrawStream
 Drawable.Bounds
 Drawable.DrawableType
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.Clone()
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Equals(object)
 DisposableWrapper.GetHashCode()
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.MemberwiseClone(bool)
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 PlotSettings(bool)
public PlotSettings(bool modelType)
Parameters
modelType bool
 PlotSettings(IntPtr, bool)
protected PlotSettings(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 CanonicalMediaName
public string CanonicalMediaName { get; }
Property Value
string
 CurrentStyleSheet
public string CurrentStyleSheet { get; }
Property Value
string
 CustomPrintScale
public CustomScale CustomPrintScale { get; }
Property Value
CustomScale
 DrawViewportsFirst
public bool DrawViewportsFirst { get; set; }
Property Value
bool
 ModelType
public bool ModelType { get; }
Property Value
bool
 PlotAsRaster
public bool PlotAsRaster { get; }
Property Value
bool
 PlotCentered
public bool PlotCentered { get; }
Property Value
bool
 PlotConfigurationName
public string PlotConfigurationName { get; }
Property Value
string
 PlotHidden
public bool PlotHidden { get; set; }
Property Value
bool
 PlotOrigin
public Point2d PlotOrigin { get; }
Property Value
Point2d
 PlotPaperMargins
public Extents2d PlotPaperMargins { get; }
Property Value
Extents2d
 PlotPaperSize
public Point2d PlotPaperSize { get; }
Property Value
Point2d
 PlotPaperUnits
public PlotPaperUnit PlotPaperUnits { get; }
Property Value
PlotPaperUnit
 PlotPlotStyles
public bool PlotPlotStyles { get; set; }
Property Value
bool
 PlotRotation
public PlotRotation PlotRotation { get; }
Property Value
PlotRotation
 PlotSettingsName
public string PlotSettingsName { get; set; }
Property Value
string
 PlotTransparency
public bool PlotTransparency { get; set; }
Property Value
bool
 PlotType
public PlotType PlotType { get; }
Property Value
PlotType
 PlotViewName
public string PlotViewName { get; }
Property Value
string
 PlotViewportBorders
public bool PlotViewportBorders { get; set; }
Property Value
bool
 PlotWindowArea
public Extents2d PlotWindowArea { get; }
Property Value
Extents2d
 PlotWireframe
public bool PlotWireframe { get; }
Property Value
bool
 PrintLineweights
public bool PrintLineweights { get; set; }
Property Value
bool
 ScaleLineweights
public bool ScaleLineweights { get; set; }
Property Value
bool
 ShadePlot
public PlotSettingsShadePlotType ShadePlot { get; set; }
Property Value
PlotSettingsShadePlotType
 ShadePlotCustomDpi
public short ShadePlotCustomDpi { get; set; }
Property Value
short
 ShadePlotId
public ObjectId ShadePlotId { get; }
Property Value
ObjectId
 ShadePlotResLevel
public ShadePlotResLevel ShadePlotResLevel { get; set; }
Property Value
ShadePlotResLevel
 ShowPlotStyles
public bool ShowPlotStyles { get; set; }
Property Value
bool
 StdScale
[UnitType(UnitType.Unitless)]
public double StdScale { get; }
Property Value
double
 StdScaleType
public StdScaleType StdScaleType { get; }
Property Value
StdScaleType
 UseStandardScale
public bool UseStandardScale { get; }
Property Value
bool
Methods
 AddToPlotSettingsDictionary(Database)
public void AddToPlotSettingsDictionary(Database toWhichDatabase)
Parameters
toWhichDatabase Database
 SetShadePlot(PlotSettingsShadePlotType, ObjectId)
public void SetShadePlot(PlotSettingsShadePlotType type, ObjectId shadePlotId)
Parameters
type PlotSettingsShadePlotType
shadePlotId ObjectId