Table of Contents
 Class GenericTexture
Namespace
Autodesk.AutoCAD.GraphicsInterface
Assembly
Acdbmgd.dll
[Wrapper("AcGiGenericTexture")]
public sealed class GenericTexture : ProceduralTexture, IDisposable, ICloneable
Inheritance
object
MarshalByRefObject
DisposableWrapper
RXObject
MaterialTexture
ProceduralTexture
GenericTexture
Implements
IDisposable
ICloneable
Inherited Members
 RXObject.Create(IntPtr, bool)
 RXObject.GetClass(Type)
 RXObject.X(RXClass)
 RXObject.QueryX(RXClass)
 RXObject.GetRXClass()
 RXObject.CompareTo(object)
 RXObject.CopyFrom(RXObject)
 DisposableWrapper.Create(Type, IntPtr, bool)
 DisposableWrapper.Dispose()
 DisposableWrapper.AutoDelete
 DisposableWrapper.IsDisposed
 DisposableWrapper.UnmanagedObject
 MarshalByRefObject.GetLifetimeService()
 MarshalByRefObject.InitializeLifetimeService()
 MarshalByRefObject.CreateObjRef(Type)
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Extension Methods
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull<T>(T, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 ArgumentNullEx.NotNull(object?, string)
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.GetProperty(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.Invoke(object, string, params object[])
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.ReleaseInstance(object)
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 LateBinding.SetProperty(object, string, params object[])
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.Print(object)
 ObjEx.PrintLine(object)
 ObjEx.PrintLine(object)
Constructors
 GenericTexture()
public GenericTexture()
 GenericTexture(IntPtr, bool)
protected GenericTexture(IntPtr unmanagedPointer, bool autoDelete)
Parameters
unmanagedPointer IntPtr
autoDelete bool
Properties
 Definition
public object Definition { get; set; }
Property Value
object
Methods
 Clone()
public GenericTexture Clone()
Returns
GenericTexture
 CopyFrom(GenericTexture)
public void CopyFrom(GenericTexture pSrc)
Parameters
pSrc GenericTexture
 Equals(object)
public override sealed bool Equals(object obj)
Parameters
obj object
Returns
bool
 GetHashCode()
public override sealed int GetHashCode()
Returns
int
 Set(GenericTexture)
public void Set(GenericTexture value)
Parameters
value GenericTexture
Operators
 operator ==(GenericTexture, GenericTexture)
public static bool operator ==(GenericTexture a, GenericTexture b)
Parameters
a GenericTexture
b GenericTexture
Returns
bool
 operator !=(GenericTexture, GenericTexture)
public static bool operator !=(GenericTexture a, GenericTexture b)
Parameters
a GenericTexture
b GenericTexture
Returns
bool